<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Dostosowywanie Thunara</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Mened&#380;er Plików Thunar"><link rel="up" href="index.html" title="Mened&#380;er Plików Thunar"><link rel="prev" href="preferences.html" title="Ustawienia mened&#380;era plików"><link rel="next" href="advanced-topics.html" title="Zaawansowane zagadnienia"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Dostosowywanie Thunara</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="preferences.html">Poprzedni</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="advanced-topics.html">Nast&#281;pny</a></td></tr></table><hr></div><div class="sect1" lang="pl"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="customizing-thunar"></a>Dostosowywanie Thunara</h2></div></div></div><p>Ten rozdzia&#322; opisuje, jak dostosowa&#263; pewne cz&#281;&#347;ci mened&#380;era plików do twoich w&#322;asnych potrzeb.</p><div class="sect2" lang="pl"><div class="titlepage"><div><div><h3 class="title"><a name="sendto"></a>Menu "Wy&#347;lij do"</h3></div></div></div><p>Thunar zawiera menu <span class="guilabel"><strong>Wy&#347;lij do</strong></span>, zawieraj&#261;ce pewne miejsca docelowe, do których mo&#380;na wysy&#322;a&#263; pliki i foldery. Aby uzyska&#263; dost&#281;p do menu <span class="guilabel"><strong>Wy&#347;lij do</strong></span>, wybierz <span class="guimenu"><strong>Plik</strong></span> &#8594; <span class="guimenuitem"><strong>Wy&#347;lij do</strong></span> z g&#322;ównego menu lub kliknij prawym przyciskiem myszy na pliku lub folderze, po czym wybierz <span class="guimenuitem"><strong>Wy&#347;lij do</strong></span>.</p><div class="screenshot"><div class="mediaobject"><img src="images/sendto-menu.png" alt='Menu "Wy&#347;lij do"'></div></div><p>Domy&#347;lnie menu <span class="guilabel"><strong>Wy&#347;lij do</strong></span> zawiera pozycj&#281; zwan&#261; <span class="guilabel"><strong>Pulpit (utwórz &#322;&#261;cze)</strong></span> dost&#281;pn&#261; dla wszystkich plików i folderów. Tworzy ona &#322;&#261;cze na pulpicie do ka&#380;dego zaznaczonego pliku. Poza tym, je&#347;li <span class="guilabel"><strong>Panel skrótów</strong></span> jest aktywny, menu zawiera tak&#380;e pozycj&#281; <span class="guilabel"><strong>Panel boczny (utwórz skrót)</strong></span>, który umo&#380;liwia u&#380;ytkownikom dodawanie nowych skrótów do panelu bocznego (opcja ta dotyczy tylko katalogów). Poni&#380;ej tych dwóch pozycji, <strong class="application"><code>Thunar</code></strong> wy&#347;wietla list&#281; nap&#281;dów wymiennych aktualnie pod&#322;&#261;czonych do komputera. W zrzucie ekranu powy&#380;ej, <span class="guilabel"><strong>Stacja dyskietek</strong></span> reprezentuje przyk&#322;adowy punkt docelowy, dok&#261;d mog&#261; zosta&#263; wys&#322;ane pliki. Zauwa&#380;, &#380;e urz&#261;dzenia s&#261; montowane automatycznie przy wybieraniu ich z menu <span class="guilabel"><strong>Wy&#347;lij do</strong></span>, tak wi&#281;c nie musisz montowa&#263; ich r&#281;cznie.</p><p>Poza tym <strong class="application"><code>Thunar</code></strong> oferuje wtyczk&#281; <strong class="application"><code>thunar-sendto-email</code></strong>, która dodaje do menu pozycj&#281; <span class="guilabel"><strong>Odbiorca poczty elektronicznej</strong></span>, otwieraj&#261;c&#261; program pocztowy z zaznaczonymi plikami do&#322;&#261;czonymi do nowo utworzonego e-maila. Je&#347;li zaznaczenie zawiera co najmniej jeden folder, zaznaczone elementy s&#261; dodawane do archiwum ZIP przed za&#322;&#261;czaniem ich do wiadomo&#347;ci. W przeciwnym wypadku, je&#347;li zaznaczenie zawiera wiele plików (lub jeden wi&#281;kszy ni&#380; 200Kib), u&#380;ytkownik zostanie zapytany, czy pakowa&#263; pliki do archiwum ZIP i wys&#322;a&#263; jako archiwum.</p><p>Jak wi&#281;kszo&#347;&#263; innych opcji <strong class="application"><code>Thunara</code></strong>, menu <span class="guilabel"><strong>Wy&#347;lij do</strong></span> mo&#380;e by&#263; &#322;atwo rozszerzane przez u&#380;ytkowników i programistów o nowe miejsca docelowe, u&#380;ywaj&#261;c standardowych <a class="ulink" href="http://freedesktop.org/wiki/Standards_2fdesktop_2dentry_2dspec" target="_top">plików elementów pulpitu</a>. Pliki te musz&#261; zosta&#263; zainstalowane do jednego z folderów <code class="filename">$XDG_DATA_DIRS/Thunar/sendto/</code> (zobacz <a class="ulink" href="http://freedesktop.org/wiki/Standards_2fbasedir_2dspec" target="_top">XDG Base Directory Specification</a> - szczegó&#322;y na temat zmiennej <code class="literal">$XDG_DATA_DIRS</code>).</p><p><code class="literal">MimeType</code> w pliku <code class="filename">.desktop</code> okre&#347;la typy plików, dla których ta akcja powinna by&#263; dost&#281;pna w menu <span class="guilabel"><strong>Wy&#347;lij do</strong></span>. Przyk&#322;adowo: powiedzmy, &#380;e chcesz doda&#263; pozycj&#281; dla narz&#281;dzia uploadu <a class="ulink" href="http://flickr.com/" target="_top">Flickr</a>. W takim przypadku ten wpis powinien pojawi&#263; si&#281; tylko, je&#347;li zaznaczenie zawiera pliki JPEG (inne formaty nie s&#261; wspierane przez Flickr). Wobec tego powiniene&#347; doda&#263; lini&#281; <code class="literal">MimeType=image/jpeg;</code>. Je&#347;li nie okre&#347;lisz &#380;adnego <code class="literal">MimeType</code> twój wpis b&#281;dzie pojawia&#322; si&#281; dla plików wszystkich typów.</p><p>Kompletny przyk&#322;ad u&#380;ywania aplikacji <strong class="application"><code>postr</code></strong> pokazano poni&#380;ej:</p><pre class="programlisting">
# postr.desktop - Zintegruj postr
#                 w menu "Wy&#347;lij do".
[Desktop Entry]
Type=Application
Version=1.0
Encoding=UTF-8
TryExec=postr
Exec=postr %F
Icon=postr
Name=Flickr
MimeType=image/jpeg;</pre><p>Je&#347;li umie&#347;cisz ten plik w <code class="filename">~/.local/share/Thunar/sendto/</code> (je&#347;li ten katalog nie istnieje - utwórz go), menu <span class="guilabel"><strong>Wy&#347;lij do</strong></span> b&#281;dzie zawiera&#263; nowy wpis <span class="guilabel"><strong>Flickr</strong></span>, który b&#281;dzie móg&#322; by&#263; u&#380;ywany do wgrywania obrazów JPEG do Flickr.</p><p><a class="ulink" href="http://thunar.xfce.org/pwiki/documentation/sendto_menu" target="_top">Wiki Projektu Thunar</a> zawiera dodatkowe przyk&#322;ady u&#380;ytecznych celów dla menu <span class="guilabel"><strong>Wy&#347;lij do</strong></span>. Ty tak&#380;e mo&#380;esz uzupe&#322;nia&#263; strony Wiki o nowe przyk&#322;ady.</p></div><div class="sect2" lang="pl"><div class="titlepage"><div><div><h3 class="title"><a name="thumbnailers"></a>Generatory miniatur</h3></div></div></div><p>Thunar u&#380;ywa ma&#322;ych narz&#281;dzi do generowania miniatur plików pewnych typów i wy&#347;wietla miniatury jako podgl&#261;d zawarto&#347;ci pliku. Thunar jest dostarczany z generatorami miniatur dla obrazów i plików czcionek i automatycznie u&#380;ywa zainstalowanych generatorów GNOME, je&#347;li tylko zosta&#322; zainstalowany z obs&#322;ug&#261; <code class="literal">gconf</code>. U&#380;ytkownicy mog&#261; jednak dynamicznie rozszerza&#263; t&#261; podstawow&#261; funkcjonalno&#347;&#263; generatorami miniatur dla plików innych formatów.</p><p>Je&#347;li planujesz napisa&#263; w&#322;asny generator miniatur, musisz zacz&#261;&#263; od programu przyjmuj&#261;cego co najmniej dwa parametry linii polece&#324;: plik wej&#347;ciowy (odpowiedniego typu) i plik wyj&#347;ciowy (w formacie PNG, zgodnie ze <a class="ulink" href="http://jens.triq.net/thumbnail-spec/creation.html#AEN139" target="_top">Standardem Zarz&#261;dzania Miniaturami</a>). Poza tym twój program mo&#380;e tak&#380;e akceptowa&#263; po&#380;&#261;dan&#261; wielko&#347;&#263; miniatury (opcjonalne, ale bardzo zalecane). Je&#347;li twój program wygeneruje miniatur&#281; niestandardowego rozmiaru, Thunar przeskaluje j&#261; zgodnie ze swoimi potrzebami, co mo&#380;e pogorszy&#263; jako&#347;&#263; miniatury w stosunku do mo&#380;liwego efektu przy jej poprawnym generowaniu przez generator miniatur.</p><p>Kiedy twoje narz&#281;dzie do generowania minatur b&#281;dzie gotowe, b&#281;dziesz musia&#322; je zarejestrowa&#263;, aby Thunar móg&#322; je zlokalizowa&#263; i u&#380;ywa&#263;. Wszystko co musisz zrobi&#263;, to zainstalowa&#263; plik opisu generatora (plik <code class="filename">.desktop</code>) w jednej z &#347;cie&#380;ek <code class="filename">$XDG_DATA_DIRS/thumbnailers/</code>. Przyk&#322;adowo, je&#347;li chcesz zarejestrowa&#263; generator miniatur tylko dla twojego konta u&#380;ytkownika w systemie, mo&#380;esz zainstalowa&#263; plik do folderu <code class="filename">~/.local/share/thumbnailers/</code>. Format plików <code class="filename">.desktop</code> generatora miniatur zosta&#322; opisany poni&#380;ej.</p><div class="sect3" lang="pl"><div class="titlepage"><div><div><h4 class="title"><a name="thumbnailer-desktop-file-format"></a>Format pliku opisu generatorów miniatur</h4></div></div></div><p>Pliki opisu generatorów miniatur u&#380;ywaj&#261; <a class="ulink" href="http://standards.freedesktop.org/desktop-entry-spec/latest/" target="_top">formatu plików pulpitu</a> z polem <code class="literal">Type</code> jako <code class="literal">X-Thumbnailer</code> i polem <code class="literal">X-Thumbnailer-Exec</code> z nowym kodem pola. Podstawowy plik opisu ma poni&#380;szy format.</p><pre class="programlisting">
[Desktop Entry]
Version=1.0
Encoding=UTF-8
Type=X-Thumbnailer
Name=Twój generator miniatur
MimeType=twoj-obslugiwany/typ-mime;
X-Thumbnailer-Exec=your-thumbnailer %i %o %s</pre><p>Pola <code class="literal">Version</code> i <code class="literal">Encoding</code> s&#261; narzucone przez "Desktop Entry Specification", po prostu u&#380;yj warto&#347;ci podanych w przyk&#322;adzie powy&#380;ej. Pole <code class="literal">Type</code> musi posiada&#263; specjaln&#261; warto&#347;&#263; <code class="literal">X-Thumbnailer</code>. W przeciwnym wypadku twój generator nie b&#281;dzie rozpoznawany. Warto&#347;&#263; <code class="literal">Name</code> opisuje twój generator miniatur.</p><p>Pole <code class="literal">X-Thumbnailer-Exec</code> zawiera polecenie uruchamiaj&#261;ce twój generator i obs&#322;uguje pewne kody pól, pod które b&#281;d&#261; podstawiane ró&#380;ne warto&#347;ci podczas uruchamiania generatora. Poni&#380;sze kody s&#261; rozpoznawane:</p><div class="variablelist"><dl><dt><span class="term"><code class="varname">%i</code></span></dt><dd>&#346;cie&#380;ka do pliku, którego miniatur&#281; nale&#380;y utworzy&#263;. Mo&#380;e by&#263; &#347;cie&#380;k&#261; relatywn&#261; wzgl&#281;dem katalogu z którego generator zosta&#322; wywo&#322;any lub &#347;cie&#380;k&#261; bezwzgl&#281;dn&#261;.</dd><dt><span class="term"><code class="varname">%o</code></span></dt><dd>&#346;cie&#380;ka do pliku wyj&#347;ciowego, dok&#261;d nale&#380;y wygenerowa&#263; miniatur&#281;. Plik wyj&#347;ciowy musi by&#263; zgodny ze standardem PNG (patrz wy&#380;ej). Zauwa&#380;, &#380;e &#347;cie&#380;ka nie musi ko&#324;czy&#263; si&#281; na <code class="literal">.png</code>, co ma znaczenie je&#347;li wywo&#322;ujesz inne narz&#281;dzia.</dd><dt><span class="term"><code class="varname">%s</code></span></dt><dd>Po&#380;&#261;dany rozmiar generowanej miniatury w pikselach. Parametr opcjonalny.</dd><dt><span class="term"><code class="varname">%u</code></span></dt><dd>Podobne do <code class="literal">%i</code>, ale podstawiony przez URI pliku, a nie &#347;cie&#380;k&#281;. Dodane dla kompatybilno&#347;ci z GNOME.</dd><dt><span class="term"><code class="varname">%%</code></span></dt><dd>Zast&#261;pione przez pojedyncze <code class="literal">%</code>.</dd></dl></div><p>Musisz wzi&#261;&#263; pod uwag&#281; co najmniej <code class="literal">%o</code> i <code class="literal">%i</code> lub <code class="literal">%u</code>. W przeciwnym wypadku twój generator b&#281;dzie bezu&#380;yteczny.</p><p><code class="literal">MimeType</code> zawiera list&#281; typów MIME (oddzielonych przecinkiem) dla których twój generator potrafi generowa&#263; miniatury.</p></div><div class="sect3" lang="pl"><div class="titlepage"><div><div><h4 class="title"><a name="eps-thumbnailer-example"></a>Przyk&#322;adowy generator EPS</h4></div></div></div><p>Ten przyk&#322;ad ilustruje jak napisa&#263; i zainstalowa&#263; nowy generator miniatur dla plików <code class="filename">.eps</code>, u&#380;ywaj&#261;c narz&#281;dzia <span class="command"><strong>convert</strong></span> dostarczanego jako cz&#281;&#347;&#263; pakietu ImageMagick. Najpierw zaczniemy od prostego skryptu wywo&#322;uj&#261;cego <span class="command"><strong>convert</strong></span>, aby wygenerowa&#263; miniatur&#281; po&#380;&#261;danego rozmiaru.</p><pre class="programlisting">
#!/bin/sh
#
# eps-thumbnailer - przyk&#322;adowy generator miniatur plików EPS.
#
# U&#380;ycie: eps-thumbnailer eps-file png-file size
#

# parametry linii polece&#324;
ifile=$1
ofile=$2
size=$3

# wywo&#322;aj convert (ImageMagick)
exec convert "eps:$ifile" -scale "$sizex$size" "png:$ofile"</pre><p>Zapisz powy&#380;szy skrypt do pliku <code class="filename">eps-thumbnailer</code>, upewnij si&#281;, &#380;e plik jest wykonywalny i zainstaluj go do <code class="filename">/usr/local/bin</code>.</p><pre class="screen">
$ chmod +x eps-thumbnailer
$ sudo install eps-thumbnailer /usr/local/bin/eps-thumbnailer</pre><p>Teraz musimy utworzy&#263; plik opisu generatora miniatur <code class="filename">eps-thumbnailer.desktop</code>. B&#281;dzie on wygl&#261;da&#322; nast&#281;puj&#261;co:</p><pre class="programlisting">
[Desktop Entry]
Version=1.0
Encoding=UTF-8
Type=X-Thumbnailer
Name=EPS Thumbnailer
TryExec=convert
MimeType=image/x-eps;
X-Thumbnailer-Exec=/usr/local/bin/eps-thumbnailer %i %o %s</pre><p>Plik ten powinien zosta&#263; zainstalowany do <code class="filename">/usr/local/share/thumbnailers</code> (utwórz ten katalog, je&#347;li nie istnieje).</p><pre class="screen">
$ sudo install -d /usr/local/share/thumbnailers
$ sudo install eps-thumbnailer.desktop /usr/local/share/thumbnailers/eps-thumbnailer.desktop</pre><p>Plik <code class="filename">eps-thumbnailer.desktop</code> u&#380;ywa specjalnego klucza <code class="literal">TryExec</code>, okre&#347;laj&#261;cego polecenie, które musi by&#263; dost&#281;pne w systemie, aby generator móg&#322; dzia&#322;a&#263;. W tym przypadku nasz skrypt jest bezu&#380;yteczny je&#347;li narz&#281;dzie <span class="command"><strong>convert</strong></span> nie jest dost&#281;pne w systemie.</p><p>Ostatnim krokiem jest regeneracja cache'u generatorów, aby Thunar móg&#322; u&#380;ywa&#263; naszego generatora. Cache generatorów znajduje si&#281; w <code class="filename">$XDG_CACHE_HOME/Thunar/thumbnailers.cache</code> (<code class="varname">$XDG_CACHE_HOME</code> wskazuje na <code class="filename">~/.cache/</code>, chyba, &#380;e zosta&#322;o to zmienione przez administratora Twojego systemu). Cache generatorów miniatur jest odbudowywany co jaki&#347; czas przez Thunara, ale mo&#380;esz zrobi&#263; to samodzielnie, u&#380;ywaj&#261;c narz&#281;dzia <code class="filename">thunar-vfs-update-thumbnailers-cache-1</code>, które jest dostarczane jako cz&#281;&#347;&#263; Thunara. Narz&#281;dzie to jest zazwyczaj zainstalowane w podkatalogu <code class="filename">libexec</code> g&#322;ównego katalogu instalacji Thunara (<code class="filename">sbin</code> w Debianie i Ubuntu). Przyk&#322;adowo je&#347;li Thunar jest zainstalowany w <code class="filename">/usr</code>, wywo&#322;aj to narz&#281;dzie tak jak poni&#380;ej:</p><pre class="screen">$ /usr/libexec/thunar-vfs-update-thumbnailers-cache-1</pre><p>Upewnij si&#281;, &#380;e uruchamiasz ten program z konta twojego u&#380;ytkownika, nie administratora, gdy&#380; cache generatorów jest przechowywany w twoim katalogu domowym, a nie w ogólnosystemowym po&#322;o&#380;eniu.</p><p>Teraz, je&#347;li Thunar zosta&#322; skompilowany z obs&#322;ug&#261; narz&#281;dzi monitorowania zmian w plikach (us&#322;uga FAM lub Gamin), automatycznie u&#380;yje nowego cache'u generatorów i w ci&#261;gu paru sekund b&#281;dzie mo&#380;liwe generowanie miniatur za pomoc&#261; twojego generatora. W przeciwnym wypadku b&#281;dziesz musia&#322; zrestartowa&#263; Thunara, aby zmiany odnios&#322;y skutek. U&#380;yj:</p><pre class="screen">$ Thunar -q</pre><p>aby zako&#324;czy&#263; wszystkie uruchomione instancje Thunara, po czym uruchom go ponownie za pomoc&#261; aktywatora.</p></div><div class="sect3" lang="pl"><div class="titlepage"><div><div><h4 class="title"><a name="cleaning-up-thumbnails"></a>Usuwanie miniatur</h4></div></div></div><p>Wygenerowane miniatury s&#261; przechowywane w karalogu <code class="filename">~/.thumbnails/</code> zgodnie ze <a class="ulink" href="http://jens.triq.net/thumbnail-spec/index.html" target="_top">Standardem Zarz&#261;dzania Miniaturami</a>. Podczas testowania nowego generatora miniatur, pomocne mo&#380;e by&#263; wyczyszczynie cache'u miniatur u&#380;ywaj&#261;c:</p><pre class="screen">$ rm -rf ~/.thumbnails/</pre><p>Zwolni to tak&#380;e troch&#281; miejsca w twoim katalogu domowym. Poniewa&#380; wszelkie informacje przechowywane w tym katalogu zosta&#322;y automatycznie wygenerowane z plików znajduj&#261;cych si&#281; na twoim systemie plików, nie utracisz &#380;adnych istotnych danych.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="preferences.html">Poprzedni</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="advanced-topics.html">Nast&#281;pny</a></td></tr><tr><td width="40%" align="left" valign="top">Ustawienia mened&#380;era plików </td><td width="20%" align="center"><a accesskey="h" href="index.html">Spis tre&#347;ci</a></td><td width="40%" align="right" valign="top"> Zaawansowane zagadnienia</td></tr></table></div></body></html>
