<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>U&#380;ywanie no&#347;ników wymiennych</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Mened&#380;er Plików Thunar"><link rel="up" href="index.html" title="Mened&#380;er Plików Thunar"><link rel="prev" href="working-with-files-and-folders.html" title="Praca z plikami i folderami"><link rel="next" href="preferences.html" title="Ustawienia mened&#380;era plików"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">U&#380;ywanie no&#347;ników wymiennych</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="working-with-files-and-folders.html">Poprzedni</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="preferences.html">Nast&#281;pny</a></td></tr></table><hr></div><div class="sect1" lang="pl"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="using-removable-media"></a>U&#380;ywanie no&#347;ników wymiennych</h2></div></div></div><div class="sect2" lang="pl"><div class="titlepage"><div><div><h3 class="title"><a name="accessing-removable-media"></a>Dost&#281;p do no&#347;ników wymiennych</h3></div></div></div><p>Thunar wspiera no&#347;niki wymienne, je&#347;li zosta&#322; zbudowany z obs&#322;ug&#261; <a class="ulink" href="http://freedesktop.org/wiki/Software_2fhal" target="_top">HAL</a> lub je&#347;li u&#380;ywasz <a class="ulink" href="http://www.freebsd.org/" target="_top">FreeBSD</a>. Jednak&#380;e na FreeBSD 6.0 i nowszych lepiej jest u&#380;ywa&#263; HAL ni&#380; natywnego wsparcia oferowanego przez Thunara.</p><div class="sect3" lang="pl"><div class="titlepage"><div><div><h4 class="title"><a name="to-mount-media"></a>Montowanie no&#347;ników</h4></div></div></div><p><span class="emphasis"><em>Zamontowa&#263;</em></span> to znaczy uczyni&#263; system plików na no&#347;niku dost&#281;pnym. Kiedy montujesz no&#347;nik, system plików który si&#281; na nim znajduje jest pod&#322;&#261;czany jako podkatalog do twojego systemu plików.</p><p>Aby uzyska&#263; dost&#281;p do no&#347;nika, umie&#347;&#263; no&#347;nik w odpowiednim urz&#261;dzeniu lub pod&#322;&#261;cz urz&#261;dzenie do twojego komputera (tj. pod&#322;&#261;cz PenDrive do jednego z twoich portów USB). Element reprezentuj&#261;cy no&#347;nik zostanie dodany do bocznego panelu mened&#380;era plików. Je&#347;li <strong class="application"><code>xfdesktop</code></strong> jest uruchomiony i skonfigurowany tak, aby wy&#347;wietla&#263; <span class="guilabel"><strong>ikony plików i wyzwalaczy</strong></span>, to ten obiekt tak&#380;e zostanie dodany do twojego pulpitu.</p><p>Aby zamontowa&#263; no&#347;nik, kliknij na reprezentuj&#261;cy go obiekt. Na przyk&#322;ad aby zamontowa&#263; dyskietk&#281;, kliknij na obiekt <span class="guilabel"><strong>Stacja Dyskietek</strong></span> znajduj&#261;cy si&#281; w panelu bocznym. Mened&#380;er plików doda system plików na no&#347;niku do hierarchii twojego systemu plików i wy&#347;wietli zawarto&#347;&#263; dyskietki w obszarze g&#322;ównym.</p></div><div class="sect3" lang="pl"><div class="titlepage"><div><div><h4 class="title"><a name="to-eject-media"></a>Wysuwanie no&#347;ników</h4></div></div></div><p>Je&#347;li stacja (nap&#281;d) no&#347;nika jest motoryczny (np. nap&#281;d CD-ROM), kliknij prawym przyciskiem myszy na obiekcie no&#347;nika w bocznym panelu lub na pulpicie i wybierz <span class="guilabel"><strong>Wysu&#324;</strong></span>. No&#347;nik zostanie wysuni&#281;ty z nap&#281;du po kilku sekundach. Je&#347;li nap&#281;d no&#347;nika nie jest motoryczny (np. stacja dyskietek lub PenDrive), kliknij prawym przyciskiem myszy na obiekcie no&#347;nika i wybierz <span class="guilabel"><strong>Odmontuj</strong></span>. Po chwili pojawi si&#281; powiadomienie o mo&#380;liwo&#347;ci bzepiecznego od&#322;&#261;czenia nap&#281;du (lub wyci&#261;gni&#281;cia no&#347;nika).</p><div class="screenshot"><div class="mediaobject"><img src="images/removable-media-unmount.png" alt="Powiadomienie o odmontowaniu"></div></div><p>To powiadomienie pojawi si&#281; tylko wtedy, je&#347;li zosta&#322;a w&#322;&#261;czona obs&#322;uga <strong class="application"><code>libnotify</code></strong> i zosta&#322; zainstalowany demon powiadomie&#324;. Demon powiadomie&#324; dla Xfce jest dost&#281;pny z <a class="ulink" href="http://goodies.xfce.org/projects/applications/notification-daemon-xfce" target="_top">Projektu Xfce Goodies</a>. Je&#347;li nie ma obs&#322;ugi powiadomie&#324;, poczekaj a&#380; menu kontekstowe zniknie, zanim od&#322;&#261;czysz nap&#281;d lub wyci&#261;gniesz no&#347;nik.</p><p>Pami&#281;taj, &#380;e nie mo&#380;esz wysun&#261;&#263; lub odmontowa&#263; no&#347;nika je&#347;li jest on ci&#261;gle u&#380;ywany przez jedn&#261; lub wi&#281;cej aplikacji. Je&#347;li mened&#380;er plików odmówi odmontowania no&#347;nika, upewnij si&#281;, &#380;e zamkn&#261;&#322;e&#347; wszystkie aplikacje, które mog&#322;y go u&#380;ywa&#263;. Sprawd&#378; tak&#380;e programy linii polece&#324; uruchamiane w oknach <strong class="application"><code>Terminala</code></strong>.</p><p>Upewnij si&#281;, &#380;e odmontowa&#322;e&#347; wymienne no&#347;niki przed ich fizycznym usuni&#281;ciem z systemu. Nie wyci&#261;gaj dyskietki ze stacji dyskietek zanim jej nie odmontujesz. Nie wyci&#261;gaj pami&#281;ci USB (np. PenDrive'ów) przed ich odmontowaniem. Je&#347;li najpierw nie odmontujesz no&#347;nika mo&#380;esz straci&#263; dane lub uszkodzi&#263; system.</p></div></div><div class="sect2" lang="pl"><div class="titlepage"><div><div><h3 class="title"><a name="management-of-removable-drives-and-media"></a>Zarz&#261;dzanie wymiennymi no&#347;nikami i nap&#281;dami</h3></div></div></div><p>Thunar mo&#380;e automatycznie zarz&#261;dza&#263; wymiennymi nap&#281;dami i no&#347;nikami je&#347;li pakiet <a class="ulink" href="http://www.foo-projects.org/~benny/projects/thunar-volman/index.html" target="_top">thunar-volman</a> zosta&#322; zainstalowany w systemie. Trzeba przy tym zauwa&#380;y&#263;, &#380;e ta opcja wymaga wsparcia ze strony HAL.</p><p>Gdy wsparcie HAL jest ju&#380; dost&#281;pne, a <strong class="application"><code>thunar-volman</code></strong> zainstalowany, mo&#380;esz uaktywni&#263; opcj&#281; <span class="guilabel"><strong>Mened&#380;era woluminów</strong></span> w Thunarze. Aby to zrobi&#263; otwórz okno preferencji mened&#380;era plików, przejd&#378; do karty <span class="guilabel"><strong>Zaawansowane</strong></span> i zaznacz pole <span class="guilabel"><strong>W&#322;&#261;cz mened&#380;era woluminów</strong></span></p><p>Kolejnym krokiem jest dostosowanie sposobu zarz&#261;dzania nap&#281;dami i no&#347;nikami do twoich potrzeb. Kliknij &#322;&#261;cze <span class="guilabel"><strong>Konfiguruj</strong></span> w sekcji <span class="guilabel"><strong>Mened&#380;er Woluminów</strong></span>. Zostanie wy&#347;wietlone okno dialogowe <span class="guilabel"><strong>Wymienne nap&#281;dy i no&#347;niki</strong></span>.</p><div class="screenshot"><div class="mediaobject"><img src="images/removable-drives-and-media.png" alt="Wymienne nap&#281;dy i no&#347;niki"></div></div><p>Je&#347;li poprzednio u&#380;ywa&#322;e&#347; <strong class="application"><code>gnome-volume-manager</code></strong>, powniene&#347; poczu&#263; si&#281; jak w domu, poniewa&#380; mened&#380;er woluminów zosta&#322; zaprojektowany z my&#347;l&#261; o podobie&#324;stwie w wygl&#261;dzie i zachowaniu do <strong class="application"><code>gnome-volume-manager</code></strong>. Preferencje zosta&#322;y podzielone na kategorie, aby u&#322;atwi&#263; odnalezienie odpowiedniej opcji do konkretnego urz&#261;dzenia.</p><p>Karta <span class="guilabel"><strong>Pami&#281;&#263;</strong></span> zawiera najwa&#380;niejsze opcje. Jak sugeruje nazwa, opcje te odnosz&#261; si&#281; tylko do pami&#281;ci przeno&#347;nych, jak zewn&#281;trzne dyski twarde, PenDrive'y czy p&#322;yty CD-ROM. Opcje sekcji <span class="guilabel"><strong>Pami&#281;&#263; wymienna</strong></span> zosta&#322;y szczegó&#322;owo opisane poni&#380;ej.</p><div class="variablelist"><dl><dt><span class="term"><span class="guilabel"><strong>Montuj nap&#281;dy wymienne przy pod&#322;&#261;czaniu</strong></span></span></dt><dd><p>Uaktywnij t&#261; opcj&#281;, aby automatycznie zamontowa&#263; systemy plików na nap&#281;dach wymiennych (np. zewn&#281;trznych dyskach twardych lub PenDrive'ach) kiedy tylko zostan&#261; pod&#322;&#261;czone do komputera.</p><p>Ta opcja musi by&#263; w&#322;&#261;czona aby dzia&#322;a&#322;y inne funkcje operuj&#261;ce na no&#347;nikach wymiennych. Przyk&#322;adowo, je&#347;li wy&#322;&#261;czysz t&#261; opcj&#281;, pewne rodzaje przeno&#347;nych odtwarzaczy muzyki nie b&#281;d&#261; mog&#322;y by&#263; rozpoznane. Nawet gdy w&#322;&#261;czysz opcj&#281; <span class="guilabel"><strong>Odtwarzaj muzyk&#281; przy pod&#322;&#261;czaniu</strong></span> na karcie <span class="guilabel"><strong>Multimedia</strong></span>, okre&#347;lone polecenie nie zostanie uruchomione.</p></dd><dt><span class="term"><span class="guilabel"><strong>Montuj wymienne no&#347;niki przy wk&#322;adaniu</strong></span></span></dt><dd><p>Uaktywnij t&#261; opcj&#281;, aby automatycznie montowa&#263; systemy plików na wymiennych no&#347;nikach (np. p&#322;ytach CD-ROM lub DVD) kiedy w&#322;o&#380;ysz je do nap&#281;du.</p><p>Ta opcja musi by&#263; w&#322;&#261;czona aby dzia&#322;a&#322;y inne funkcje operuj&#261;ce na no&#347;nikach wymiennych. Przyk&#322;adowo, je&#347;li wy&#322;&#261;czysz t&#261; opcj&#281;, nie b&#281;dzie mo&#380;liwe sprawdzenie, czy no&#347;nik posiada mo&#380;liwo&#347;&#263; autouruchamiania. Tym samym opcja <span class="guilabel"><strong>Automatycznie uruchamiaj programy na nowych nap&#281;dach i no&#347;nikach</strong></span> nie b&#281;dzie dzia&#322;a&#263;.</p></dd><dt><span class="term"><span class="guilabel"><strong>Przegl&#261;daj wymienne no&#347;niki przy wk&#322;adaniu</strong></span></span></dt><dd><p>Uaktywnij t&#261; opcj&#281; aby automatycznie wy&#347;wietla&#263; zawarto&#347;&#263; nowo pod&#322;&#261;czonych no&#347;ników w mened&#380;erze plików. Zauwa&#380; jednak&#380;e, &#380;e stanie si&#281; tak tylko wtedy, gdy nie b&#281;dzie mo&#380;liwe wykonanie &#380;adnej innej akcji lub wybra&#322;e&#347; ignorowanie innych mo&#380;liwych akcji. Przyk&#322;adowo je&#347;li umie&#347;cisz p&#322;yt&#281; CD-ROM z autostartem, a opcja <span class="guilabel"><strong>Automatycznie otwieraj programy na nowych nap&#281;dach i no&#347;nikach</strong></span> jest aktywna, zostaniesz zapytany, czy umo&#380;liwi&#263; autostart. Je&#347;li odmówisz, zawarto&#347;&#263; no&#347;nika zostanie wy&#347;wietlona w mened&#380;erze plików.</p></dd><dt><span class="term"><span class="guilabel"><strong>Automatycznie otwieraj programy na nowych nap&#281;dach i no&#347;nikach</strong></span></span></dt><dd><p>Uaktywnij t&#261; opcj&#281; aby skorzysta&#263; z opcji autostartu niektórych wymiennych no&#347;ników i nap&#281;dów. Zobacz <a class="ulink" href="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html" target="_top">Desktop Application Autostart Specification</a>, aby dowiedzie&#263; si&#281; szczegó&#322;ów na temat mechanizmu autostartu. Aby zapewni&#263; bezpiecze&#324;stwo, zostaniesz za ka&#380;dym razem poproszony o potwierdzenie autostartu.</p><p>Je&#347;li emulator Windowsa, <a class="ulink" href="http://www.winehq.org/" target="_top">WINE</a>, zosta&#322; zainstalowany w twoim systemie, mechanizm autouruchamiania b&#281;dzie próbowa&#322; tak&#380;e uruchomia&#263; pliki  <code class="filename">autorun.exe</code> u&#380;ywaj&#261;c WINE.</p></dd><dt><span class="term"><span class="guilabel"><strong>Automatycznie otwieraj pliki na nowych nap&#281;dach i no&#347;nikach</strong></span></span></dt><dd><p>Uaktywnij t&#261; opcj&#281;, aby skorzysta&#263; z mo&#380;liwo&#347;ci automatycznego otwierania niektórych nap&#281;dów i no&#347;ników. Zobacz <a class="ulink" href="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html" target="_top">Desktop Application Autostart Specification</a>, aby dowiedzie&#263; si&#281; szczegó&#322;ów na temat mechanizmu autootwierania. W trosce o bezpiecze&#324;stwo zostaniesz za ka&#380;dym razem poproszony o potwierdzenie automatycznego otwierania.</p></dd></dl></div><p>Pozosta&#322;e opcje pozwol&#261; ci na okre&#347;lenie polece&#324; do uruchomienia przy pod&#322;&#261;czaniu pewnych zewn&#281;trznych urz&#261;dze&#324; czy wymiennych no&#347;ników. Polecenia mog&#261; u&#380;ywa&#263; trzech specjalnych zmiennych, które zostan&#261; zast&#261;pione podczas uruchamiania polecenia:</p><div class="variablelist"><dl><dt><span class="term"><code class="literal">%d</code></span></dt><dd><p>Ka&#380;de wyst&#261;pienie <code class="literal">%d</code> w poleceniu zostanie zast&#261;pione &#347;cie&#380;k&#261; do nowo dodanego urz&#261;dzenia. Przyk&#322;adowo, je&#347;li pod&#322;&#261;czy&#322;e&#347; PenDrive, &#347;cie&#380;ka do urz&#261;dzenia b&#281;dzie <code class="filename">/dev/da0s1</code> lub <code class="filename">/dev/sda1</code>.</p><p>Je&#347;li &#380;aden plik urz&#261;dzenia nie jest powi&#261;zany z urz&#261;dzeniem lub z pewnych wzgl&#281;dów plik urz&#261;dzenia nie mo&#380;e zosta&#263; odnaleziony, zmienna <code class="literal">%d</code> zostanie zast&#261;piona pustym napisem.</p></dd><dt><span class="term"><code class="literal">%h</code></span></dt><dd><p>Ka&#380;de wyst&#261;pienie <code class="literal">%h</code> w poleceniu zostanie zast&#261;pione przez UDI nowo dodanego urz&#261;dzenia w systemie HAL.</p></dd><dt><span class="term"><code class="literal">%m</code></span></dt><dd><p>Ka&#380;de wyst&#261;pienie <code class="literal">%m</code> w poleceniu zostanie zast&#261;pione punktem montowania nowo dodanego urz&#261;dzenia. Je&#347;li urz&#261;dzenie nie mo&#380;e by&#263; zamontowane (np. drukarki lub klawiatury) lub je&#347;li automatyczne montowanie zosta&#322;o wy&#322;&#261;czone, <code class="literal">%m</code> zostanie zast&#261;pione pustym napisem.</p></dd></dl></div><div class="sect3" lang="pl"><div class="titlepage"><div><div><h4 class="title"><a name="troubleshooting-the-volume-manager"></a>Rozwi&#261;zywanie problemów z Mened&#380;erem Woluminów</h4></div></div></div><p>Porady u&#380;yteczne przy rozwi&#261;zywaniu problemów z mened&#380;erem woluminów je&#347;li nie dzia&#322;a on tak, jak oczekiwano.</p><div class="orderedlist"><ol type="1"><li><p>Upewnij si&#281;, &#380;e <strong class="application"><code>Thunar</code></strong> jest uruchomiony jako demon. Mened&#380;er woluminów wymaga tego, jako &#380;e sam w sobie nie jest demonem. Domy&#347;lnie Xfce automatycznie uruchamia <strong class="application"><code>Thunara</code></strong> jako demon przy starcie. Je&#347;li z jakiego&#347; powodu jego proces zosta&#322; zako&#324;czony, otwórz <span class="guilabel"><strong>Uruchom program</strong></span> (u&#380;ywaj&#261;c skrótu <span class="keycap"><strong>Alt</strong></span>+<span class="keycap"><strong>F2</strong></span> lub klikaj&#261;c prawym przyciskiem myszy na pulpit i wybieraj&#261;c <span class="guilabel"><strong>Uruchom Program...</strong></span> z menu), wprowad&#378; <code class="literal">Thunar --daemon</code> i kliknij <span class="guibutton"><strong>Uruchom</strong></span>.</p></li><li><p>Spróbuj uruchomi&#263; <strong class="application"><code>thunar-volman</code></strong> z okna <strong class="application"><code>Terminala</code></strong> po pod&#322;&#261;czeniu nap&#281;du lub w&#322;o&#380;eniu no&#347;nika. Najpierw musisz pozna&#263; HALowe UDI nowego urz&#261;dzenia u&#380;ywaj&#261;c <strong class="application"><code>lshal</code></strong> lub <strong class="application"><code>hal-device</code></strong>. Je&#347;li ju&#380; znasz UDI, uruchom <code class="literal">thunar-volman --device-added &lt;udi-twojego-urz&#261;dzenia&gt;</code> w oknie <strong class="application"><code>Terminala</code></strong> i obserwuj komunikaty wyj&#347;ciowe szukaj&#261;c b&#322;&#281;dów i ostrze&#380;e&#324;.</p></li></ol></div><p>Je&#347;li problem nadal istnieje, popro&#347; o pomoc na <a class="ulink" href="http://forum.xfce.org/" target="_top">Forum Xfce</a> lub <a class="ulink" href="http://foo-projects.org/mailman/listinfo/thunar-dev" target="_top">li&#347;cie mailingowej thunar-dev</a>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="working-with-files-and-folders.html">Poprzedni</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="preferences.html">Nast&#281;pny</a></td></tr><tr><td width="40%" align="left" valign="top">Praca z plikami i folderami </td><td width="20%" align="center"><a accesskey="h" href="index.html">Spis tre&#347;ci</a></td><td width="40%" align="right" valign="top"> Ustawienia mened&#380;era plików</td></tr></table></div></body></html>
