<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Thunar'&#305; Özelle&#351;tirme</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Thunar Dosya Yöneticisi"><link rel="up" href="index.html" title="Thunar Dosya Yöneticisi"><link rel="prev" href="preferences.html" title="Dosya Yönetimi Seçenekleri"><link rel="next" href="advanced-topics.html" title="Geli&#351;mi&#351; Ba&#351;l&#305;klar"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Thunar'&#305; Özelle&#351;tirme</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="preferences.html">Önceki</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="advanced-topics.html">Sonraki</a></td></tr></table><hr></div><div class="sect1" lang="tr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="customizing-thunar"></a>Thunar'&#305; Özelle&#351;tirme</h2></div></div></div><p>Bu bölümde dosya yöneticisini kendi istekleriniz do&#287;rultusunda nas&#305;l özelle&#351;tirece&#287;iniz anlat&#305;lmaktad&#305;r.</p><div class="sect2" lang="tr"><div class="titlepage"><div><div><h3 class="title"><a name="sendto"></a>"Gönder" Menüsü</h3></div></div></div><p>Thunar dosya ve dizinleri belirli noktalara ta&#351;&#305;mak için <span class="guilabel"><strong>Gönder</strong></span> menüsünü bar&#305;nd&#305;rmaktad&#305;r. <span class="guilabel"><strong>Gönder</strong></span> menüsüne eri&#351;mek için <span class="guimenu"><strong>Dosya</strong></span> &#8594; <span class="guimenuitem"><strong>Gönder</strong></span> seçene&#287;ini kullanabilece&#287;iniz gibi, göndermek istedi&#287;iniz dizin veya dosyaya sa&#287; t&#305;klayarak <span class="guimenuitem"><strong>Gönder</strong></span> seçene&#287;ini kullanman&#305;z&#305; sa&#287;lamaktad&#305;r.</p><div class="screenshot"><div class="mediaobject"><img src="images/sendto-menu.png" alt='"Gönder" Menüsü'></div></div><p>Öntan&#305;ml&#305; olarak <span class="guilabel"><strong>Gönder</strong></span> menüsü <span class="guilabel"><strong>Masaüstü (Ba&#287;lant&#305; Olu&#351;tur)</strong></span> seçene&#287;i ile belirtilen dosya veya dizin için masaüstünde k&#305;sayol olu&#351;turmaktad&#305;r. Ayr&#305;ca, e&#287;er <span class="guilabel"><strong>K&#305;sayol bölümü</strong></span> etkin ise, o dizin için k&#305;sayol bölümünde k&#305;sayol olu&#351;turmak için <span class="guilabel"><strong>Yan pencere gözü (K&#305;sa yol yarat)</strong></span> seçene&#287;ini sunmaktad&#305;r. Öte yandan, ayr&#305;labilir ortamlara da dosya gönderme i&#351;lemi bu menü yard&#305;m&#305;yla yap&#305;labilir. Thunar otomatik olarak ayr&#305;labilir ortam&#305; da gönderilebilir hedefler aras&#305;na almaktad&#305;r. </p><p><strong class="application"><code>Thunar</code></strong> ayr&#305;ca <strong class="application"><code>E-posta eklentisi</code></strong> ile menüye eklenen <strong class="application"><code>E-posta alan</code></strong> seçene&#287;i ile e-posta program&#305;nda al&#305;c&#305;s&#305; tan&#305;mlanm&#305;&#351; olmakla birlikte dosyay&#305; eklenmi&#351; olarak tan&#305;mlayan bir özellik sunmaktad&#305;r. E&#287;er seçim en az bir dizin içeriyorsa bunu ZIP ar&#351;ivine koyup o &#351;ekilde haz&#305;rlamaktad&#305;r. E&#287;er birden çok dosya gönderilecekse ve bunlar&#305;n toplam boyutu 200Kib üzerinde ise, kullan&#305;c&#305;ya dosyalar&#305;n ZIP ar&#351;ivine koymas&#305; için onay istemekte ve bu dosyalar&#305; ZIP ar&#351;ivine koyup göndermektedir.</p><p><strong class="application"><code>Thunar</code></strong> uygulamas&#305;n&#305;n di&#287;er özellikleri gibi <span class="guilabel"><strong>Gönder</strong></span> menüsü <a class="ulink" href="http://freedesktop.org/wiki/Standards_2fdesktop_2dentry_2dspec" target="_top">desktop entry files</a> standard&#305;na uygun olmak kayd&#305;yla geni&#351;letilebilir. Bu dosyalar <code class="filename">$XDG_DATA_DIRS/Thunar/sendto/</code> dizinine kopyalanmal&#305;d&#305;r. (<code class="literal">$XDG_DATA_DIRS</code> de&#287;i&#351;keni hakk&#305;nda bilgi almak için <a class="ulink" href="http://freedesktop.org/wiki/Standards_2fbasedir_2dspec" target="_top">XDG Base Directory Specification</a> sayfas&#305;n&#305; inceleyebilirsiniz)</p><p><code class="literal">MimeType</code> ile hedef <code class="filename">.desktop</code> dosyas&#305; tan&#305;mlanmaktad&#305;r ve bu tan&#305;mlama sonucunda gerçekle&#351;tirilecek i&#351;lem <span class="guilabel"><strong>Gönder</strong></span> menüsünde yer alacakt&#305;r. Mesela, <a class="ulink" href="http://flickr.com/" target="_top">Flickr</a> sitesine JPEG biçimindeki resimleri yüklemek için,  <code class="literal">MimeType=image/jpeg;</code> de&#287;eri kullan&#305;lmal&#305;d&#305;r. E&#287;er <code class="literal">MimeType</code> belirlemezseniz yapmak istedi&#287;iniz i&#351;lem bütün dosyalar için geçerli olacakt&#305;r. </p><p>Örnek bir <strong class="application"><code>postr</code></strong> uygulamas&#305; a&#351;a&#287;&#305;daki örnekte gösterilmektedir.</p><pre class="programlisting">
# postr.desktop - Integrate postr into
#                 the "Send To" menu.
[Desktop Entry]
Type=Application
Version=1.0
Encoding=UTF-8
TryExec=postr
Exec=postr %F
Icon=postr
Name=Flickr
MimeType=image/jpeg;</pre><p>Bu dosyay&#305; <code class="filename">~/.local/share/Thunar/sendto/</code> alt&#305;na kopyalarsan&#305;z (dizin yok ise olu&#351;turmal&#305;s&#305;n&#305;z), JPEG dosyalar&#305; için <span class="guilabel"><strong>Gönder</strong></span> menüsünde <span class="guilabel"><strong>Flickr</strong></span> seçene&#287;ini görebilirsiniz.</p><p><a class="ulink" href="http://thunar.xfce.org/pwiki/documentation/sendto_menu" target="_top">Thunar Project Wikisi</a>  <span class="guilabel"><strong>Gönder</strong></span> menüsü için birçok örnek bar&#305;nd&#305;rmaktad&#305;r. Kendi olu&#351;turdu&#287;unuz örnekleri de bu wiki sayfas&#305;nda payla&#351;abilirsiniz.</p></div><div class="sect2" lang="tr"><div class="titlepage"><div><div><h3 class="title"><a name="thumbnailers"></a>Önizleme Olu&#351;turucular</h3></div></div></div><p>Thunar küçük uygulamalar yard&#305;m&#305;yla belirli dosyalar için önizlemeler olu&#351;turmakta ve dosya içeri&#287;inin önizlemesini göstermektedir. Bu küçük araçlar önizleme olu&#351;turucusu olarak isimlendirilmektedir. Thunar öntan&#305;ml&#305; olarak resimler ve yaz&#305;tipleri için  önizleme deste&#287;i sunmaktad&#305;r. Ayr&#305;ca <code class="literal">gconf</code> deste&#287;i ile kurulmu&#351;sa GNOME için kullan&#305;lan önizleme olu&#351;turucular da kullan&#305;labilir. Kullan&#305;c&#305;lar bu önizleme olu&#351;turucular&#305;n fonksiyonunu geni&#351;letmek isteyebilir.</p><p>Önizleme olu&#351;turucu yazmak istiyorsan&#305;z, bir girdi ve <a class="ulink" href="http://jens.triq.net/thumbnail-spec/creation.html#AEN139" target="_top">Thumbnail Management Standard</a> adresinde belirtilen standartlara uygun bir PNG ç&#305;kt&#305; dosyas&#305; veren bir uygulama çal&#305;&#351;t&#305;rmal&#305;s&#305;n&#305;z. Ayr&#305;ca program&#305;n&#305;z önizleme boyutunu ayarlaman&#305;z&#305; da sa&#287;lamal&#305;d&#305;r. Büyük bir önizleme dosyas&#305; dosya listeleme i&#351;lemini yava&#351;latabilir.</p><p>Önizleme dosyalar&#305; olu&#351;turma i&#351;lemi bittikten sonra, önizleme olu&#351;turu dosyan&#305;z&#305; kay&#305;t etmelisiniz böylece Thunar onu bulup kullanabilecektir. Yapman&#305;z gereken tek &#351;ey, önizleme olu&#351;turucusu için bir aç&#305;klama dosyas&#305;n&#305;  (yani <code class="filename">.desktop</code> dosyas&#305;) <code class="filename">$XDG_DATA_DIRS/thumbnailers/</code> alt&#305;na koymakt&#305;r. </p><div class="sect3" lang="tr"><div class="titlepage"><div><div><h4 class="title"><a name="thumbnailer-desktop-file-format"></a>Önizleme Olu&#351;turucu Dosya Biçimi</h4></div></div></div><p>Önizleme olu&#351;turucu aç&#305;klamas&#305; <a class="ulink" href="http://standards.freedesktop.org/desktop-entry-spec/latest/" target="_top">Desktop Entry Format</a> standard&#305;n&#305; kullanmaktad&#305;r. </p><pre class="programlisting">
[Desktop Entry]
Version=1.0
Encoding=UTF-8
Type=X-Thumbnailer
Name=Your Thumbnailer
MimeType=your-supported/mime-type;
X-Thumbnailer-Exec=your-thumbnailer %i %o %s</pre><p><code class="literal">Version</code> ve <code class="literal">Encoding</code> Desktop Entry Specification standartlar&#305; taraf&#305;ndan himaye edilmektedir. Yukar&#305;daki örnekteki de&#287;erleri kullanman&#305;z yeterlidir. <code class="literal">Type</code> k&#305;sm&#305; mutlaka <code class="literal">X-Thumbnailer</code> de&#287;erini içermelidir, aksi takdirde önizleme olu&#351;turucunuz tan&#305;nmayacakt&#305;r. <code class="literal">Name</code> de&#287;eri önizleme olu&#351;turucunuzu tan&#305;mlamaktad&#305;r.</p><p><code class="literal">X-Thumbnailer-Exec</code> k&#305;sm&#305; çal&#305;&#351;t&#305;r&#305;lacak önizleme olu&#351;turucusunu tan&#305;mlamak için kullan&#305;lmaktad&#305;r. Tan&#305;nan alan kodlar&#305; &#351;unlard&#305;r:</p><div class="variablelist"><dl><dt><span class="term"><code class="varname">%i</code></span></dt><dd>Önizleme olu&#351;turacak girdi dosyas&#305;n&#305;n yolu. Önizleme olu&#351;turucusunun çal&#305;&#351;t&#305;r&#305;laca&#287;&#305; bir dizine ba&#287;l&#305; olabilece&#287;i gibi mutlak yol da kullan&#305;labilir.</dd><dt><span class="term"><code class="varname">%o</code></span></dt><dd>Olu&#351;turulacak önizlemelerin saklanaca&#287;&#305; ç&#305;kt&#305; dosyas&#305;n&#305;n yolu. Ç&#305;kt&#305; dosyas&#305;, önizleme standartlar&#305;na göre geçerli bir PNG dosyas&#305; olarak yaz&#305;lmal&#305;d&#305;r. Ç&#305;kt&#305; yolu üçüncü parti yaz&#305;l&#305;mlar&#305; çal&#305;&#351;t&#305;r&#305;rken sorunla kar&#351;&#305;la&#351;mamak için <code class="literal">.png</code> ile bitmemelidir.</dd><dt><span class="term"><code class="varname">%s</code></span></dt><dd>Olu&#351;turulacak önizleme dosyas&#305;n&#305;n piksel boyutu. Bu parametre iste&#287;e ba&#287;l&#305;d&#305;r.</dd><dt><span class="term"><code class="varname">%u</code></span></dt><dd><code class="literal">%i</code> ile benzerdir fakat dosyan&#305;n URI de&#287;eri ile de&#287;i&#351;tirilmektedir. Bu özellik GNOME ile uyum sa&#287;lamak için eklenmi&#351;tir.</dd><dt><span class="term"><code class="varname">%%</code></span></dt><dd>Tek <code class="literal">%</code> ile de&#287;i&#351;tirilecektir.</dd></dl></div><p><code class="literal">%o</code>, <code class="literal">%i</code> ve <code class="literal">%u</code> de&#287;i&#351;kenlerini bar&#305;nd&#305;rmal&#305;d&#305;r, aksi takdirde önizleme olu&#351;turucusu bir i&#351;e yaramayacakt&#305;r.</p><p>Önizleme için <code class="literal">MimeType</code> - noktal&#305; virgül ile ayr&#305;lan - MIME türlerini listelemektedir.</p></div><div class="sect3" lang="tr"><div class="titlepage"><div><div><h4 class="title"><a name="eps-thumbnailer-example"></a>Örnek EPS Önizleyicisi</h4></div></div></div><p>Bu örnek <code class="filename">.eps</code> dosyalar&#305; için önizleme dosyas&#305;n&#305;n nas&#305;l olu&#351;turulaca&#287;&#305;n&#305; göstermektedir. &#304;&#351;lem için ImageMagick paketi ile birlikte gelen <span class="command"><strong>convert</strong></span> komutu kullan&#305;lmaktad&#305;r. Öncelikle <span class="command"><strong>convert</strong></span> ile istenilen boyutta bir önizleme olu&#351;turulacakt&#305;r.</p><pre class="programlisting">
#!/bin/sh
#
# eps-thumbnailer - Example thumbnailer script for EPS files.
#
# Usage: esp-thumbnailer eps-file png-file size
#

# command line parameters
ifile=$1
ofile=$2
size=$3

# invoke convert (ImageMagick)
exec convert "eps:$ifile" -scale "$sizex$size" "png:$ofile"</pre><p>Bu beti&#287;i <code class="filename">eps-thumbnailer</code> ismi ile kaydedip, çal&#305;&#351;t&#305;r&#305;labilir yapt&#305;ktan sonra <code class="filename">/usr/local/bin</code> alt&#305;na kopyalamal&#305;s&#305;n&#305;z.</p><pre class="screen">
$ chmod +x eps-thumbnailer
$ sudo install eps-thumbnailer /usr/local/bin/eps-thumbnailer</pre><p>Daha sonra,  <code class="filename">eps-thumbnailer.desktop</code> isminde bir aç&#305;klama dosyas&#305; olu&#351;turup &#351;u &#351;ekilde görünmesini sa&#287;lamal&#305;s&#305;n&#305;z:</p><pre class="programlisting">
[Desktop Entry]
Version=1.0
Encoding=UTF-8
Type=X-Thumbnailer
Name=EPS Thumbnailer
TryExec=convert
MimeType=image/x-eps;
X-Thumbnailer-Exec=/usr/local/bin/eps-thumbnailer %i %o %s</pre><p>Bu dosya <code class="filename">/usr/local/share/thumbnailers</code> alt&#305;na kopyalanmal&#305;d&#305;r (e&#287;er bu dizin yoksa olu&#351;turmal&#305;s&#305;n&#305;z)</p><pre class="screen">
$ sudo install -d /usr/local/share/thumbnailers
$ sudo install eps-thumbnailer.desktop /usr/local/share/thumbnailers/eps-thumbnailer.desktop</pre><p><code class="filename">eps-thumbnailer.desktop</code> dosyas&#305; özel anahtar olan ve yararl&#305; bir önizleme olu&#351;turman&#305;z&#305; sa&#287;layacak <code class="literal">TryExec</code> özelli&#287;ini kullanmaktad&#305;r. E&#287;er <span class="command"><strong>convert</strong></span> belirtilmezse betik bir i&#351;e yaramayacakt&#305;r.</p><p>Son a&#351;ama ise, önizleme önbelle&#287;ini tekrar olu&#351;turmak içindir, böylece Thunar önizlemeyi alacakt&#305;r. Önizleme önbelle&#287;i <code class="filename">$XDG_CACHE_HOME/Thunar/thumbnailers.cache</code> alt&#305;nda bulunmaktad&#305;r. Önizleme önbelle&#287;i Thunar taraf&#305;ndan otomatik olarak tekrar olu&#351;turulmaktad&#305;r ancak isterseniz  <code class="filename">thunar-vfs-update-thumbnailers-cache-1</code> arac&#305; ile tekrar olu&#351;turulmas&#305;n&#305; sa&#287;layabilirsiniz. Bu araç <code class="filename">libexec</code> içerisinde yer al&#305;r.  E&#287;er Thunar <code class="filename">/usr</code> alt&#305;nda kurulu ise, bu &#351;u &#351;ekilde çal&#305;&#351;t&#305;rabilirsiniz:</p><pre class="screen">$ /usr/libexec/thunar-vfs-update-thumbnailers-cache-1</pre><p>Bu komutu mutlaka kendi kullan&#305;c&#305;n&#305;zdan çal&#305;&#351;t&#305;rmal&#305;s&#305;n&#305;z, e&#287;er root olarak çal&#305;&#351;t&#305;r&#305;rsan&#305;z, önizleme dosyalar&#305; sistem geneline yay&#305;lacakt&#305;r.</p><p>E&#287;er Thunar FAM veya Gamin servislerinden herhangi birisinin deste&#287;i ile derlenmi&#351;se otomatik olarak önizlemeleri gösterecektir. Göstermez ise Thunar'&#305; tekrar ba&#351;latmak için &#351;u komutu verebilirsiniz:</p><pre class="screen">$ Thunar -q</pre><p>komutunu vererek çal&#305;&#351;an uygulamay&#305; kapat&#305;p, tekrar çal&#305;&#351;t&#305;rabilirsiniz.</p></div><div class="sect3" lang="tr"><div class="titlepage"><div><div><h4 class="title"><a name="cleaning-up-thumbnails"></a>Önizlemeyi Temizleme</h4></div></div></div><p><a class="ulink" href="http://jens.triq.net/thumbnail-spec/index.html" target="_top">Thumbnail Management Standard</a> ilkelerine uyarak olu&#351;turulan önizlemeler <code class="filename">~/.thumbnails/</code> dizininde bar&#305;nd&#305;r&#305;lmaktad&#305;r. Olu&#351;turulan önizlemeleri test etmek için, önizleme belle&#287;ini temizlemek için &#351;u komutu verebilirsiniz:</p><pre class="screen">$ rm -rf ~/.thumbnails/</pre><p>böylece ev dizininizde yer açm&#305;&#351; olursunuz. Bütün bilgiler sisteminizde bulunan dosyalar taraf&#305;ndan olu&#351;turuldu&#287;u için herhangi bir veri kayb&#305; ya&#351;amazs&#305;n&#305;z.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="preferences.html">Önceki</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="advanced-topics.html">Sonraki</a></td></tr><tr><td width="40%" align="left" valign="top">Dosya Yönetimi Seçenekleri </td><td width="20%" align="center"><a accesskey="h" href="index.html">Ba&#351;lang&#305;ç</a></td><td width="40%" align="right" valign="top"> Geli&#351;mi&#351; Ba&#351;l&#305;klar</td></tr></table></div></body></html>
