<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Kald&#305;r&#305;labilir Ortam Kullan&#305;m&#305;</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Thunar Dosya Yöneticisi"><link rel="up" href="index.html" title="Thunar Dosya Yöneticisi"><link rel="prev" href="working-with-files-and-folders.html" title="Dizin ve Dosya &#304;&#351;lemleri"><link rel="next" href="preferences.html" title="Dosya Yönetimi Seçenekleri"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Kald&#305;r&#305;labilir Ortam Kullan&#305;m&#305;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="working-with-files-and-folders.html">Önceki</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="preferences.html">Sonraki</a></td></tr></table><hr></div><div class="sect1" lang="tr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="using-removable-media"></a>Kald&#305;r&#305;labilir Ortam Kullan&#305;m&#305;</h2></div></div></div><div class="sect2" lang="tr"><div class="titlepage"><div><div><h3 class="title"><a name="accessing-removable-media"></a>Kald&#305;r&#305;labilir Ortama Eri&#351;im</h3></div></div></div><p>Thunar e&#287;er <a class="ulink" href="http://freedesktop.org/wiki/Software_2fhal" target="_top">HAL</a> deste&#287;i ile derlenmi&#351;se veya <a class="ulink" href="http://www.freebsd.org/" target="_top">FreeBSD</a> kullan&#305;yorsan&#305;z kald&#305;r&#305;labilir ortam&#305; desteklemektedir. Buna ra&#287;men FreeBSD 6.0 veya daha yeni sürümünü kullan&#305;yorsan&#305;z, HAL kullanman&#305;z tavsiye edilmektedir.</p><div class="sect3" lang="tr"><div class="titlepage"><div><div><h4 class="title"><a name="to-mount-media"></a>Ortam Ba&#287;lama &#304;&#351;lemi</h4></div></div></div><p>Ortam <span class="emphasis"><em>ba&#287;lamak</em></span> dosya sistemini ortama eri&#351;ime uygun k&#305;lmak içindir. Ortam ba&#287;lad&#305;&#287;&#305;n&#305;z zaman, ba&#287;lad&#305;&#287;&#305;n&#305;z ortam dosya sisteminizin alt dizini olarak sisteminize eklenecektir.</p><p>Ortama eri&#351;mek için, ortam&#305; uygun cihaza yerle&#351;tirmelisiniz ya da ba&#287;lamal&#305;s&#305;n&#305;z (mesela USB stick). Sol bölümde ortam&#305;n yer ald&#305;&#287;&#305;n&#305; göreceksiniz. E&#287;er <strong class="application"><code>xfdesktop</code></strong> çal&#305;&#351;&#305;yorsa ve <span class="guilabel"><strong>Dosya/çal&#305;&#351;t&#305;r&#305;c&#305; simgelerini</strong></span> çal&#305;&#351;t&#305;rmak için ayarlanm&#305;&#351;sa bu ortam ö&#287;esi masaüstünüzde de yer alacakt&#305;r.</p><p>Ortam&#305; ba&#287;lamak için, ortama ili&#351;kin nesneye t&#305;klamal&#305;s&#305;n&#305;z. Mesela, bir disketi ba&#287;lamak için, <span class="guilabel"><strong>Disket Sürücü</strong></span> nesnesine t&#305;klamal&#305;s&#305;n&#305;z. Dosya yöneticisi ortam&#305;n dosya sistemini, dosya sisteminizin hiyerar&#351;isine ekleyecektir ve ana bölümde diskette bulunan içeri&#287;i gösterecektir.</p></div><div class="sect3" lang="tr"><div class="titlepage"><div><div><h4 class="title"><a name="to-eject-media"></a>Ortam&#305; Ç&#305;karmak</h4></div></div></div><p>E&#287;er ortam sürücüsü motorlu ise (mesela CD-ROM), sol k&#305;s&#305;mda sa&#287; t&#305;klay&#305;p,  <span class="guilabel"><strong>Ç&#305;kar</strong></span> seçene&#287;i ile ay&#305;rabilirsiniz. E&#287;er sürücü motorlu de&#287;il ise (mesela disket veya USB stick ise), sa&#287; t&#305;klay&#305;p <span class="guilabel"><strong>Ay&#305;r</strong></span> seçene&#287;i ile ay&#305;rabilirsiniz. Bu seçene&#287;i seçtikten sonra güvenle kald&#305;rabilece&#287;inize dair bir uyar&#305; alacaks&#305;n&#305;z.</p><div class="screenshot"><div class="mediaobject"><img src="images/removable-media-unmount.png" alt="Ay&#305;rma uyar&#305;s&#305;"></div></div><p>Buna kar&#351;&#305;n bu bilgilendirme sadece <strong class="application"><code>libnotify</code></strong> deste&#287;i var ise ve notification daemon kurulu ise gösterilecektir. Xfce için bir notification daemon'a <a class="ulink" href="http://goodies.xfce.org/projects/applications/notification-daemon-xfce" target="_top">Xfce Goodies Project</a> sayfas&#305;ndan ula&#351;abilirsiniz. E&#287;er bilgilendirme deste&#287;i yok ise, aç&#305;l&#305;r menü kaybolana kadar bekleyin ve ortam&#305; bilgisayar&#305;n&#305;zdan ç&#305;kar&#305;n.</p><p>E&#287;er bir uygulama ortamdaki bir dosyaya eri&#351;im halinde ise ortam&#305; ay&#305;ramayaca&#287;&#305;n&#305;z&#305;n bilincinde olmal&#305;s&#305;n&#305;z. Ayr&#305;ca dosya yöneticisi ortam&#305; ç&#305;karmak istemiyorsa, ortama eri&#351;en bütün uygulamalar&#305; kapatt&#305;&#287;&#305;n&#305;zdan emin olmal&#305;s&#305;n&#305;z. Ayr&#305;ca <strong class="application"><code>Terminal</code></strong> uygulamas&#305;n&#305; kullanarak da ortama eri&#351;medi&#287;inizden emin olmal&#305;s&#305;n&#305;z.</p><p>Ortam&#305; ç&#305;karmadan önce ay&#305;rd&#305;&#287;&#305;n&#305;zdan emin olmal&#305;s&#305;n&#305;z. Disketi ay&#305;rmadan disket sürücünüzden ç&#305;karmamal&#305;s&#305;n&#305;z. Ayn&#305; durum USB stick için de söz konusudur. E&#287;er ortam&#305; güvenli bir &#351;ekilde ay&#305;rmadan ç&#305;kar&#305;rsan&#305;z veri kayb&#305;na u&#287;rayabilece&#287;iniz gibi sisteminizde hasara da yol açabilirsiniz.</p></div></div><div class="sect2" lang="tr"><div class="titlepage"><div><div><h3 class="title"><a name="management-of-removable-drives-and-media"></a>Ay&#305;r&#305;labilir Sürücü ve Ortam Yönetimi</h3></div></div></div><p>Thunar <a class="ulink" href="http://www.foo-projects.org/~benny/projects/thunar-volman/index.html" target="_top">thunar-volman</a> kullanarak da otomatik olarak ayr&#305;labilir sürücü ve ortam yönetimini sa&#287;lamaktad&#305;r. Ancak bu özellik HAL deste&#287;i gerektirmektedir.</p><p>E&#287;er HAL deste&#287;i mevcut ise ve <strong class="application"><code>thunar-volman</code></strong> sisteminizde kurulu ise, Thunar'&#305;n <span class="guilabel"><strong>Bölüm Yönetimi</strong></span> özelli&#287;inden faydalanabilirsiniz. Öte yandan, dosya yöneticisi özelliklerini aç&#305;p, <span class="guilabel"><strong>Geli&#351;mi&#351;</strong></span> sayfas&#305;na gidip, <span class="guilabel"><strong>Birim Yönetimini Etkinle&#351;tir</strong></span> seçene&#287;ini kontrol edebilirsiniz.</p><p>Sonraki a&#351;ama ise, ayr&#305;labilir sürücü ve ortam&#305;n yönetimini isteklerinize göre özelle&#351;tirmek olacakt&#305;r. <span class="guilabel"><strong>Bölüm Yönetimi</strong></span> bölümünde <span class="guilabel"><strong>Yap&#305;land&#305;r dKald yap</strong></span></p><div class="screenshot"><div class="mediaobject"><img src="images/removable-drives-and-media.png" alt="Ayr&#305;labilir Sürücü ve Ortam"></div></div><p>E&#287;er daha önce <strong class="application"><code>gnome-volume-manager</code></strong> kullanm&#305;&#351; iseniz, ayn&#305; kullan&#305;m rahatl&#305;&#287;&#305;n&#305; <strong class="application"><code>gnome-volume-manager</code></strong> benzeri arabirim ile de ya&#351;abilirsiniz. Seçenekler kolay eri&#351;im sa&#287;lanmas&#305; bak&#305;m&#305;ndan ayr&#305; ayg&#305;t kategorilerine ayr&#305;lm&#305;&#351;t&#305;r.</p><p><span class="guilabel"><strong>Storage</strong></span> sayfas&#305; en önemli seçenekleri bar&#305;nd&#305;r&#305;r. Bu seçenek isminden belli oldu&#287;u gibi sadece depolama ayg&#305;tlar&#305;na eri&#351;im için kullan&#305;l&#305;r. <span class="guilabel"><strong>Removable Storage</strong></span> seçenekleri a&#351;a&#287;&#305;da aç&#305;klanacakt&#305;r.</p><div class="variablelist"><dl><dt><span class="term"><span class="guilabel"><strong>Ayr&#305;labilir sürücüleri tak&#305;ld&#305;&#287;&#305; zaman ba&#287;la</strong></span></span></dt><dd><p>Bu seçene&#287;i ayr&#305;labilir sürücüleri (harici diskler veya USB stick) otomatik olarak ba&#287;lamak istiyorsan&#305;z seçmelisiniz.</p><p>Bu seçenek ayr&#305;labilir sürücü kullanmak istiyorsan&#305;z muhakkak seçili olmal&#305;d&#305;r. Mesela, bu özelli&#287;i kald&#305;r&#305;rsan&#305;z, ta&#351;&#305;nabilir müzikçalarlar otomatik olarak tan&#305;nmayacakt&#305;r. <span class="guilabel"><strong>Multimedia</strong></span> sekmesinde <span class="guilabel"><strong>Play music files when connected</strong></span> seçene&#287;i i&#351;aretli ise tan&#305;mlanan komut çal&#305;&#351;mayacakt&#305;r.</p></dd><dt><span class="term"><span class="guilabel"><strong>Ayr&#305;labilir sürücü yerle&#351;tirildi&#287;inde ba&#287;la</strong></span></span></dt><dd><p>Bu seçene&#287;i optik sürücülerin (CDROM veya DVD) otomatik olarak ba&#287;lanmas&#305;n&#305; istiyorsan&#305;z seçiniz.</p><p>Bu seçenek optik sürücü yönetimi için gereklidir. Mesela, bu özelli&#287;i devred&#305;&#351;&#305; b&#305;rak&#305;rsan&#305;z, optik sürücüye ili&#351;kin otomatik çal&#305;&#351;t&#305;rma özelli&#287;i kullan&#305;lmaz olacakt&#305;r ve <span class="guilabel"><strong>Auto-run programs on new drives and media</strong></span> özelli&#287;i i&#351; görmeyecektir.</p></dd><dt><span class="term"><span class="guilabel"><strong>Ayr&#305;labilir ortam yerle&#351;tirildi&#287;inde dosyalar&#305; görüntüle</strong></span></span></dt><dd><p>Bu seçene&#287;i ortam&#305; bilgisayar&#305;n&#305;za yerle&#351;tirdi&#287;inizde otomatik olarak ortam&#305;n bar&#305;nd&#305;rd&#305;&#287;&#305; dosyalar&#305; görüntülemek için kullanabilirsiniz. E&#287;er ba&#351;ka bir i&#351;lem atanmam&#305;&#351;sa veya atanm&#305;&#351; bir i&#351;lemi göz ard&#305; ederseniz sadece içerik gösterilecektir. Mesela bir otomatik çal&#305;&#351;t&#305;r&#305;labilir betik içeren bir CD-ROM yerle&#351;tirdi&#287;inizde  <span class="guilabel"><strong>Auto-run programs on new drives and media</strong></span> seçene&#287;i i&#351;aretli ise, önce bunu çal&#305;&#351;t&#305;rmak isteyip istemedi&#287;iniz sorulacakt&#305;r. E&#287;er göz ard&#305; et seçene&#287;ini kullan&#305;rsan&#305;z, CD-ROM içeri&#287;i görüntülenecektir.</p></dd><dt><span class="term"><span class="guilabel"><strong>Yeni sürücülerde ve ortamdaki uygulamalar&#305; otomatik çal&#305;&#351;t&#305;rma</strong></span></span></dt><dd><p>Bu seçene&#287;i ayr&#305;labilir sürücü ve ortamlarda otomatik çal&#305;&#351;t&#305;rma deste&#287;i için kullanabilirsiniz. Otomatik çal&#305;&#351;t&#305;rma mekanizmas&#305;n&#305;n nas&#305;l i&#351;ledi&#287;ini gösteren belge için <a class="ulink" href="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html" target="_top">Desktop Application Autostart Specification</a> adresini ziyaret etmelisiniz. Güvenlik aç&#305;s&#305;ndan sizden daima otomatik çal&#305;&#351;t&#305;rma öncesi onay istenecektir.</p><p>E&#287;er sisteminizde <a class="ulink" href="http://www.winehq.org/" target="_top">WINE</a> kurulu ise, otomatik çal&#305;&#351;t&#305;rma mekanizmas&#305; <code class="filename">autorun.exe</code> dosyas&#305;n&#305; WINE kullanarak çal&#305;&#351;t&#305;rmay&#305; deneyecektir. </p></dd><dt><span class="term"><span class="guilabel"><strong>Yeni sürücülerde ve ortamdaki dosyalar&#305; otomatik açma</strong></span></span></dt><dd><p>Bu seçene&#287;i ayr&#305;labilir sürücü ve ortamlar&#305; otomatik açmak için kullanabilirsiniz. Bu mekanizma hakk&#305;nda daha detayl&#305; bilgiye <a class="ulink" href="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html" target="_top">Desktop Application Autostart Specification</a> sayfas&#305;ndan ula&#351;abilirsiniz. Güvenlik aç&#305;s&#305;ndan, otomatik açma öncesi sizden onay&#305;n&#305;z istenecektir.</p></dd></dl></div><p>Kalan seçenekler bilgisayar&#305;n&#305;za bir sürücü ba&#287;lad&#305;&#287;&#305;n&#305;zda ya da bir ortam takt&#305;&#287;&#305;n&#305;zda çal&#305;&#351;t&#305;r&#305;lacak komutlar&#305; belirlemenizi sa&#287;lar. Çal&#305;&#351;t&#305;raca&#287;&#305;n&#305;z komut için üç özel de&#287;i&#351;ken belirleyebilirsiniz. Bunlar:</p><div class="variablelist"><dl><dt><span class="term"><code class="literal">%d</code></span></dt><dd><p>Çal&#305;&#351;t&#305;r&#305;lacak komut içerisinde <code class="literal">%d</code> yer al&#305;yorsa, bu de&#287;er ayg&#305;t&#305;n dosya yolu ile de&#287;i&#351;tirilecektir. Mesela, bilgisayar&#305;n&#305;za USB stick ba&#287;lad&#305;&#287;&#305;n&#305;zda yol <code class="filename">/dev/da0s1</code> veya <code class="filename">/dev/sda1</code>. </p><p>E&#287;er ayg&#305;t dosyas&#305; ile ilintili bir ayg&#305;t yoksa veya ayg&#305;t dosyas&#305; herhangi bir sebepten dolay&#305; bulunam&#305;yorsa, <code class="literal">%d</code> de&#287;eri bo&#351; bir dizge ile de&#287;i&#351;tirilecektir.</p></dd><dt><span class="term"><code class="literal">%h</code></span></dt><dd><p>Çal&#305;&#351;t&#305;r&#305;lacak komut içerisinde <code class="literal">%h</code> de&#287;i&#351;keni yer al&#305;yorsa bu de&#287;er HAL UDI ile yer de&#287;i&#351;tirecektir.</p></dd><dt><span class="term"><code class="literal">%m</code></span></dt><dd><p>Çal&#305;&#351;t&#305;r&#305;lacak komut içerisinde <code class="literal">%m</code> de&#287;i&#351;keni yer al&#305;yorsa bu de&#287;er ba&#287;lama noktas&#305; ile de&#287;i&#351;tirilecektir. E&#287;er ayg&#305;t ba&#287;lanabilen bir ayg&#305;t de&#287;ilse (mesela klavye veya yaz&#305;c&#305; ise) veya otomatik ba&#287;lama devred&#305;&#351;&#305; ise, <code class="literal">%m</code> de&#287;eri bo&#351; dizge ile de&#287;i&#351;tirilecektir.</p></dd></dl></div><div class="sect3" lang="tr"><div class="titlepage"><div><div><h4 class="title"><a name="troubleshooting-the-volume-manager"></a>Bölüm Yöneticisi &#304;çin Sorun Giderme &#304;puçlar&#305;</h4></div></div></div><p>Bölüm yöneticisi hakk&#305;nda sorun giderme konusunda faydal&#305; ipuçlar&#305; sunmaktad&#305;r.</p><div class="orderedlist"><ol type="1"><li><p><strong class="application"><code>Thunar</code></strong> uygulamas&#305;n&#305;n sistem servisi olarak çal&#305;&#351;t&#305;&#287;&#305;ndan emin olun. Bölüm yöneticisi servis olmad&#305;&#287;&#305;ndan buna ihtiyaç duymaktad&#305;r. Xfce, öntan&#305;ml&#305; olarak <strong class="application"><code>Thunar</code></strong> uygulamas&#305;n&#305; aç&#305;l&#305;&#351;ta sistem servisi olarak çal&#305;&#351;t&#305;r&#305;r. E&#287;er sistem servisi herhangi bir sebepten dolay&#305; kapat&#305;lm&#305;&#351; ise, menüdeki <span class="guilabel"><strong>Çal&#305;&#351;t&#305;r</strong></span> seçene&#287;ini (klavye k&#305;sayolu <span class="keycap"><strong>Alt</strong></span>+<span class="keycap"><strong>F2</strong></span> veya masaüstüne sa&#287; t&#305;klay&#305;p <span class="guilabel"><strong>Çal&#305;&#351;t&#305;r</strong></span> seçene&#287;i) kullanarak <code class="literal">Thunar --daemon</code> yaz&#305;p <span class="guibutton"><strong>Çal&#305;&#351;t&#305;r</strong></span> seçene&#287;ine t&#305;klamal&#305;s&#305;n&#305;z.</p></li><li><p>Ayg&#305;t&#305; takt&#305;ktan sonra ya da ortam&#305; yerle&#351;tirdikten sonra <strong class="application"><code>thunar-volman</code></strong>  uygulamas&#305;n&#305; <strong class="application"><code>Terminal</code></strong> uygulamas&#305;n&#305; kullanarak konsoldan çal&#305;&#351;t&#305;rmay&#305; deneyebilirsiniz. Öncelikle, <strong class="application"><code>lshal</code></strong> veya <strong class="application"><code>hal-device</code></strong> kullanarak ayg&#305;t&#305;n HAL UDI de&#287;erini ö&#287;renmelisiniz. UDI de&#287;erini ö&#287;rendikten sonra, <strong class="application"><code>Terminal</code></strong> uygulamas&#305; içerisinde <code class="literal">thunar-volman --device-added &lt;ayg&#305;t&#305;n-udi-de&#287;eri&gt;</code> komutunu vermelisiniz ve ç&#305;kt&#305;y&#305; takip ederek hatay&#305; anlamaya çal&#305;&#351;mal&#305;s&#305;n&#305;z.</p></li></ol></div><p>E&#287;er hala çal&#305;&#351;m&#305;yorsa, <a class="ulink" href="http://forum.xfce.org/" target="_top">Xfce Forumu</a> veya <a class="ulink" href="http://foo-projects.org/mailman/listinfo/thunar-dev" target="_top">Thunar geli&#351;tirici listesini</a> kullanarak yard&#305;m isteyebilirsiniz.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="working-with-files-and-folders.html">Önceki</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="preferences.html">Sonraki</a></td></tr><tr><td width="40%" align="left" valign="top">Dizin ve Dosya &#304;&#351;lemleri </td><td width="20%" align="center"><a accesskey="h" href="index.html">Ba&#351;lang&#305;ç</a></td><td width="40%" align="right" valign="top"> Dosya Yönetimi Seçenekleri</td></tr></table></div></body></html>
