<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Advanced Topics</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="&#1060;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1081; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; Thunar"><link rel="up" href="index.html" title="&#1060;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1081; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; Thunar"><link rel="prev" href="customizing-thunar.html" title="Customizing Thunar"><link rel="next" href="faq.html" title="&#1063;&#1072;&#1089;&#1090;&#1086; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Advanced Topics</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="customizing-thunar.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="faq.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="advanced-topics"></a>Advanced Topics</h2></div></div></div><div class="sect2" lang="ru"><div class="titlepage"><div><div><h3 class="title"><a name="to-bulk-rename-files"></a>To Bulk Rename Files</h3></div></div></div><p>
        To <span class="emphasis"><em>bulk rename</em></span> files means to rename multiple files at once using some criterion, that applies to atleast
        one of the files. <strong class="application"><code>Thunar</code></strong> includes a bulk renamer, which can be run separately using the command
        <span class="command"><strong>Thunar -B</strong></span> or from within <strong class="application"><code>Thunar</code></strong> by selecting two or more files in the main area
        and pressing <span class="keycap"><strong>F2</strong></span> or choosing
        <span class="guimenu"><strong>Edit</strong></span> &#8594; <span class="guimenuitem"><strong>Rename...</strong></span> from the main menu.
      </p><div class="screenshot"><div class="mediaobject"><img src="images/bulk-rename.png" alt="Bulk Rename Files"></div></div><p>
        The <span class="emphasis"><em>Bulk Renamers</em></span> can be applied to the name of the files, the suffix of the files or both to the
        name and the suffix of the files. <strong class="application"><code>Thunar</code></strong> currently supports the following <span class="emphasis"><em>Bulk
        Renamers</em></span>:
      </p><div class="itemizedlist"><ul type="disc"><li><p>Remove characters.</p></li><li><p>Numbering files.</p></li><li><p>Insert Date or Time.</p></li><li><p>Insert or overwrite characters.</p></li><li><p>Search and replace characters.</p></li><li><p>Convert to uppercase, lowercase or camlcase.</p></li></ul></div><p>
        Additional <span class="emphasis"><em>Bulk Renamers</em></span> may be installed as plugins for <strong class="application"><code>Thunar</code></strong>. Check
        the <a class="ulink" href="http://thunar.xfce.org/plugins.html" target="_top">Thunar Plugins</a> website for currently available
        extensions. The <a class="ulink" href="http://thunar.xfce.org/pwiki/documentation/bulk_renamer" target="_top">Thunar Project Wiki</a>
        contains further details about this feature. Feel free to add more information to the Wiki.
      </p></div><div class="sect2" lang="ru"><div class="titlepage"><div><div><h3 class="title"><a name="the-unix-file-system"></a>&#1060;&#1072;&#1081;&#1083;&#1086;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; UNIX</h3></div></div></div><p>&#1053;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1081; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; Thunar &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;, &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1079;&#1085;&#1072;&#1090;&#1100; &#1086;&#1089;&#1085;&#1086;&#1074;&#1099;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1091;&#1102; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1091;. &#1069;&#1090;&#1086;&#1090; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1088;&#1072;&#1090;&#1082;&#1080;&#1084; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1102; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; UNIX, &#1085;&#1072; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1101;&#1090;&#1072; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1080;&#1085;&#1082;&#1072;&#1088;&#1085;&#1072;&#1094;&#1080;&#1103;&#1093; UNIX, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; Linux.</p><div class="sect3" lang="ru"><div class="titlepage"><div><div><h4 class="title"><a name="folders-and-paths"></a>&#1055;&#1072;&#1087;&#1082;&#1080; &#1080; &#1087;&#1091;&#1090;&#1080;</h4></div></div></div><p>&#1042; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; UNIX &#1074;&#1089;&#1077; &#1087;&#1072;&#1087;&#1082;&#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1086;&#1081; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1072;&#1087;&#1082;&#1072;, &#1080;&#1084;&#1077;&#1085;&#1091;&#1077;&#1084;&#1072;&#1103; <span class="emphasis"><em>&#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;</em></span> (&#1090;&#1077;&#1088;&#1084;&#1080;&#1085; <span class="emphasis"><em>&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;</em></span> &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072; <span class="emphasis"><em>&#1087;&#1072;&#1087;&#1082;&#1072;</em></span>) &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; Thunar &#1082;&#1072;&#1082; <span class="guilabel"><strong>&#1060;&#1072;&#1081;&#1083;&#1086;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;</strong></span>. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1087;&#1072;&#1089;&#1090;&#1100; &#1080;&#1079; &#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1103;&#1089;&#1100; &#1087;&#1086; &#1076;&#1077;&#1088;&#1077;&#1074;&#1091; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;.</p><p>&#1052;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1083;&#1102;&#1073;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1080; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1086;&#1084; <span class="emphasis"><em>&#1087;&#1091;&#1090;&#1100;</em></span>. &#1055;&#1091;&#1090;&#1100; - &#1101;&#1090;&#1086; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1072;&#1087;&#1086;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1082;&#1086;&#1088;&#1085;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1082; &#1087;&#1072;&#1087;&#1082;&#1077; &#1080;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083;&#1091;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1091;&#1090;&#1100; <code class="filename">/home/luke</code> &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1087;&#1086;&#1076;&#1087;&#1072;&#1087;&#1082;&#1080; <code class="filename">luke</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1087;&#1072;&#1087;&#1082;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1080; <code class="filename">home</code>;&#1072; &#1087;&#1091;&#1090;&#1100; <code class="filename">/home/luke/myfile.txt</code> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1092;&#1072;&#1081;&#1083; <code class="filename">myfile.txt</code>, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1087;&#1086;&#1076;&#1087;&#1072;&#1087;&#1082;&#1077; <code class="filename">/home/luke</code>. &#1054;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1083;&#1101;&#1096; <code class="filename">/</code> &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1091;&#1102; &#1087;&#1072;&#1087;&#1082;&#1091; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;.</p><p>&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1074;&#1086;&#1102; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1091;&#1102; &#1087;&#1072;&#1087;&#1082;&#1091; &#1076;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;. &#1069;&#1090;&#1072; &#1087;&#1072;&#1087;&#1082;&#1072; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <span class="emphasis"><em>&#1076;&#1086;&#1084;&#1072;&#1096;&#1085;&#1077;&#1081; &#1087;&#1072;&#1087;&#1082;&#1086;&#1081;</em></span> &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; Thunar &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1084; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;. &#1069;&#1090;&#1072; &#1087;&#1072;&#1087;&#1082;&#1072; &#1087;&#1086;&#1093;&#1086;&#1078;&#1072; &#1085;&#1072; &#1087;&#1072;&#1087;&#1082;&#1091; <span class="guilabel"><strong>&#1052;&#1086;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;</strong></span> &#1080;&#1079; Windows. &#1044;&#1086;&#1084;&#1072;&#1096;&#1085;&#1080;&#1077; &#1087;&#1072;&#1087;&#1082;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1087;&#1072;&#1087;&#1082;&#1077; <code class="filename">/home</code>.&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1072;&#1087;&#1082;&#1072; <code class="filename">/home/luke</code> &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1084;&#1072;&#1096;&#1085;&#1077;&#1081; &#1087;&#1072;&#1087;&#1082;&#1086;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <code class="filename">luke</code>, &#1072; &#1087;&#1072;&#1087;&#1082;&#1072; <code class="filename">/home/jane</code> &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1084;&#1072;&#1096;&#1085;&#1077;&#1081; &#1087;&#1072;&#1087;&#1082;&#1086;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <code class="filename">jane</code>.</p></div><div class="sect3" lang="ru"><div class="titlepage"><div><div><h4 class="title"><a name="file-types"></a>&#1058;&#1080;&#1087;&#1099; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h4></div></div></div><p>
          You may have already heard that everything is a file in UNIX. This is true for most objects present in UNIX systems
          today. In fact even devices are represented as a special files. While this may not make sense at first sight, it is
          one of the strengths of UNIX and its derivates, and has helped it to maintain a simple core over the years where other
          operating systems had to introduce new concepts for every new technology.
        </p><p>&#1042; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; UNIX &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.</p><div class="sect4" lang="ru"><div class="titlepage"><div><div><h5 class="title"><a name="file-types-ordinary-files"></a>&#1054;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;</h5></div></div></div><p>
            An ordinary file may contain text, a program or other data. This includes image files, audio files, office documents
            and video files. The term <span class="emphasis"><em>file</em></span> is often used to refer to an ordinary file.
          </p></div><div class="sect4" lang="ru"><div class="titlepage"><div><div><h5 class="title"><a name="file-types-folder-files"></a>&#1055;&#1072;&#1087;&#1082;&#1080;</h5></div></div></div><p>
            Folders are also files in the UNIX file system. To be exact a folder is a special file, which contains a
            mapping of file names to file references for every file contained within this folder.
          </p></div><div class="sect4" lang="ru"><div class="titlepage"><div><div><h5 class="title"><a name="file-types-symbolic-link-files"></a>&#1057;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;</h5></div></div></div><p>
            A Symbolic link (often called a <span class="emphasis"><em>symlink</em></span>) is a special file that contains a path to
            another file in the file system. Symbolic link files therefore do not contain any useful information
            themselves, but just refer to other files.
          </p></div><div class="sect4" lang="ru"><div class="titlepage"><div><div><h5 class="title"><a name="file-types-device-files"></a>&#1059;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</h5></div></div></div><p>
            As mentioned earlier (most) devices are also accessed through the file system. These special device files are
            usually located in the <code class="filename">/dev</code> folder. For example the special file
            <code class="filename">/dev/hda</code> represents the first IDE disk on Linux.
          </p></div></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="customizing-thunar.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="faq.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">Customizing Thunar </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1063;&#1072;&#1089;&#1090;&#1086; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;</td></tr></table></div></body></html>
