<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#39640;&#24230;&#12394;&#35441;&#38988;</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="up" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="prev" href="customizing-thunar.html" title="Thunar &#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;"><link rel="next" href="faq.html" title="&#12424;&#12367;&#12354;&#12427;&#36074;&#21839;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#39640;&#24230;&#12394;&#35441;&#38988;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="customizing-thunar.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="faq.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="advanced-topics"></a>&#39640;&#24230;&#12394;&#35441;&#38988;</h2></div></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="to-bulk-rename-files"></a>&#35079;&#25968;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#19968;&#25324;&#22793;&#26356;</h3></div></div></div><p><span class="emphasis"><em>&#12496;&#12523;&#12463;&#12522;&#12493;&#12540;&#12512;</em></span> &#12391;&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#22522;&#28310;&#12434;&#20351;&#29992;&#12375;&#12390;&#35079;&#25968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;&#19968;&#24230;&#12395;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;<strong class="application"><code>Thunar</code></strong> &#12395;&#12399;&#12496;&#12523;&#12463;&#12522;&#12493;&#12540;&#12512;&#12364;&#21516;&#26801;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12467;&#12510;&#12531;&#12489; <span class="command"><strong>Thunar -B</strong></span> &#12434;&#20837;&#21147;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399; <strong class="application"><code>Thunar</code></strong> &#12398;&#12513;&#12452;&#12531;&#12456;&#12522;&#12450;&#19978;&#12391;&#35079;&#25968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375; <span class="keycap"><strong>F2</strong></span> &#12461;&#12540;&#12434;&#25276;&#12377;&#12363;&#12289;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#32232;&#38598;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#21517;&#21069;&#12398;&#22793;&#26356;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#36215;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/bulk-rename.png" alt="&#35079;&#25968;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#19968;&#25324;&#22793;&#26356;"></div></div><p><span class="emphasis"><em>&#12496;&#12523;&#12463;&#12522;&#12493;&#12540;&#12512;</em></span> &#12399;&#12501;&#12449;&#12452;&#12523;&#21517;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#25313;&#24373;&#23376;&#12289;&#12414;&#12383;&#12399;&#12381;&#12398;&#20001;&#26041;&#12434;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;<strong class="application"><code>Thunar</code></strong> &#12399;&#29694;&#22312;&#20197;&#19979;&#12398; <span class="emphasis"><em>&#19968;&#25324;&#22793;&#26356;</em></span> &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;:</p><div class="itemizedlist"><ul type="disc"><li><p>&#25991;&#23383;&#12398;&#38500;&#21435;</p></li><li><p>&#12501;&#12449;&#12452;&#12523;&#12398;&#30058;&#21495;&#20184;&#12369;</p></li><li><p>&#26085;&#20184;&#12414;&#12383;&#12399;&#26178;&#21051;&#12398;&#25407;&#20837;</p></li><li><p>&#25991;&#23383;&#12398;&#25407;&#20837;&#12414;&#12383;&#12399;&#19978;&#26360;&#12365;</p></li><li><p>&#25991;&#23383;&#12398;&#26908;&#32034;&#12392;&#32622;&#12365;&#25563;&#12360;</p></li><li><p>&#22823;&#25991;&#23383;&#12289;&#23567;&#25991;&#23383;&#12289;&#12414;&#12383;&#12399;&#20808;&#38957;&#12398;&#12415;&#22823;&#25991;&#23383;&#12408;&#12398;&#22793;&#25563;</p></li></ul></div><p><strong class="application"><code>Thunar</code></strong> &#12503;&#12521;&#12464;&#12452;&#12531;&#12395;&#12399;&#12289;<span class="emphasis"><em>&#12496;&#12523;&#12463;&#12522;&#12493;&#12540;&#12512;</em></span> &#12398;&#27231;&#33021;&#12434;&#25313;&#24373;&#12377;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;<a class="ulink" href="http://thunar.xfce.org/plugins.html" target="_top">Thunar Plugins</a> &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#35370;&#12428;&#12390;&#12289;&#29694;&#22312;&#21033;&#29992;&#21487;&#33021;&#12394;&#12456;&#12463;&#12473;&#12486;&#12531;&#12471;&#12519;&#12531;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="the-unix-file-system"></a>UNIX &#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;</h3></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515; Thunar &#12399;&#12289;&#22522;&#26412;&#30340;&#12394;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#25277;&#35937;&#30340;&#12394;&#20123;&#20107;&#12434;&#20309;&#12398;&#21839;&#38988;&#12418;&#28961;&#12367;&#12371;&#12394;&#12375;&#12414;&#12377;&#12398;&#12391;&#12289;&#21033;&#29992;&#32773;&#12399;&#12371;&#12428;&#12425;&#12434;&#27671;&#12395;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12392;&#12399;&#35328;&#12356;&#12394;&#12364;&#12425;&#12289;&#20840;&#20307;&#20687;&#12434;&#25524;&#12416;&#12383;&#12417;&#12395;&#22522;&#26412;&#27010;&#24565;&#12434;&#29702;&#35299;&#12375;&#12390;&#12362;&#12367;&#12392;&#24460;&#12293;&#24441;&#31435;&#12388;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#31456;&#12391;&#12399;&#12289;UNIX &#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#27010;&#24565;&#12434;&#25163;&#30701;&#12395;&#32057;&#20171;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#20170;&#26085;&#12395;&#12362;&#12369;&#12427; Linux &#12434;&#21547;&#12416;&#12354;&#12425;&#12422;&#12427; UNIX &#12398;&#27966;&#29983; OS &#12391;&#29992;&#12356;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="folders-and-paths"></a>&#12501;&#12457;&#12523;&#12480;&#12392;&#12497;&#12473;</h4></div></div></div><p>UNIX &#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12523;&#12480;&#12399;&#19968;&#12388;&#12398;&#26368;&#19978;&#20301;&#12501;&#12457;&#12523;&#12480;&#12363;&#12425;&#19979;&#12408;&#21521;&#12363;&#12387;&#12390;&#26525;&#20998;&#12363;&#12428;&#12375;&#12394;&#12364;&#12425;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;&#36870;&#12373;&#12395;&#12394;&#12387;&#12383;&#27193;&#26408;&#12398;&#27083;&#36896;&#12434;&#24819;&#20687;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12398;&#26368;&#19978;&#20301;&#12395;&#12354;&#12427;&#12501;&#12457;&#12523;&#12480;&#12399;<span class="emphasis"><em>&#12523;&#12540;&#12488;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</em></span> (<span class="emphasis"><em>&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</em></span> &#12392;&#12356;&#12358;&#29992;&#35486;&#12399; <span class="emphasis"><em>&#12501;&#12457;&#12523;&#12480;</em></span> &#12398;&#20195;&#12431;&#12426;&#12395;&#12424;&#12367;&#20351;&#12431;&#12428;&#12414;&#12377;) &#12392;&#21628;&#12400;&#12428;&#12289;Thunar &#12391;&#12399; <span class="guilabel"><strong>&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;</strong></span> &#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12354;&#12427;&#22320;&#28857;&#12395;&#21040;&#36948;&#12377;&#12427;&#12414;&#12391;&#12501;&#12457;&#12523;&#12480;&#12363;&#12425;&#12501;&#12457;&#12523;&#12480;&#12408;&#12392;&#12371;&#12398;&#26408;&#27083;&#36896;&#12434;&#30331;&#12387;&#12390;&#34892;&#12365;&#12289;&#12381;&#12398;&#24460;&#12395;&#30446;&#27161;&#12392;&#12377;&#12427;&#22580;&#25152;&#12395;&#30528;&#12367;&#12414;&#12391;&#12469;&#12502;&#12501;&#12457;&#12523;&#12480;&#12434;&#19979;&#12387;&#12390;&#34892;&#12367;&#12398;&#12391;&#12377;&#12290;</p><p>&#12371;&#12398;&#26408;&#27083;&#36896;&#12391;&#12398;&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#20301;&#32622;&#12399;&#12381;&#12398; <span class="emphasis"><em>&#12497;&#12473;</em></span> &#12391;&#35352;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12497;&#12473;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#30446;&#27161;&#12392;&#12377;&#12427;&#12501;&#12457;&#12523;&#12480;&#12420;&#12501;&#12449;&#12452;&#12523;&#12395;&#12383;&#12393;&#12426;&#30528;&#12367;&#12383;&#12417;&#12395;&#36890;&#36942;&#12375;&#12390;&#12356;&#12363;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12394;&#12356;&#12501;&#12457;&#12523;&#12480;&#12398;&#12522;&#12473;&#12488;&#12391;&#12289;&#26368;&#19978;&#37096;&#12398;&#12501;&#12457;&#12523;&#12480;&#12363;&#12425;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code class="filename">/home/luke</code> &#12399;&#26368;&#19978;&#37096;&#12501;&#12457;&#12523;&#12480;&#12398;&#12469;&#12502;&#12501;&#12457;&#12523;&#12480; <code class="filename">home</code> &#12398;&#12469;&#12502;&#12501;&#12457;&#12523;&#12480; <code class="filename">luke</code> &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;<code class="filename">/home/luke/myfile.txt</code> &#12399;&#12381;&#12398;&#12469;&#12502;&#12501;&#12457;&#12523;&#12480;&#12395;&#12354;&#12427; <code class="filename">myfile.txt</code> &#12392;&#12356;&#12358;&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12497;&#12473;&#12398;&#20808;&#38957;&#12395;&#12354;&#12427; <code class="filename">/</code> &#12399;&#26368;&#19978;&#37096;&#12501;&#12457;&#12523;&#12480;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;</p><p>&#12377;&#12409;&#12390;&#12398;&#21033;&#29992;&#32773;&#12364;&#20491;&#20154;&#29992;&#12398;&#12501;&#12449;&#12452;&#12523;&#12420;&#35373;&#23450;&#12434;&#20445;&#31649;&#12377;&#12427;&#12383;&#12417;&#12398;&#20491;&#21029;&#12398;&#12501;&#12457;&#12523;&#12480;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12457;&#12523;&#12480;&#12399; <span class="emphasis"><em>&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</em></span> &#12392;&#21628;&#12400;&#12428;&#12289;Thunar &#12391;&#12399;&#21033;&#29992;&#32773;&#12398;&#12525;&#12464;&#12452;&#12531;&#21517;&#12392;&#20849;&#12395;&#29305;&#21029;&#12394;&#12450;&#12452;&#12467;&#12531;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;Windows &#12391;&#30693;&#12425;&#12428;&#12427; <span class="guilabel"><strong>&#65423;&#65394;&#65420;&#65383;&#65394;&#65433;</strong></span> &#12392;&#20284;&#12390;&#12356;&#12414;&#12377;&#12290;&#12381;&#12428;&#12382;&#12428;&#12398;&#21033;&#29992;&#32773;&#12398; <span class="emphasis"><em>&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</em></span> &#12399;&#36890;&#24120; <code class="filename">/home</code> &#12398;&#19979;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12392;&#12375;&#12390;&#19978;&#12370;&#12427;&#12392;&#12289;&#12525;&#12464;&#12452;&#12531;&#21517; <code class="filename">luke</code> &#12398;&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12399; <code class="filename">/home/luke</code> &#12395;&#12394;&#12426;&#12289;<code class="filename">/home/jane</code> &#12399;&#12525;&#12464;&#12452;&#12531;&#21517;&#12364; <code class="filename">jane</code> &#12398;&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="file-types"></a>&#12501;&#12449;&#12452;&#12523;&#12398;&#31278;&#39006;</h4></div></div></div><p>&#12418;&#12358;&#24481;&#23384;&#30693;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;UNIX &#12391;&#12399;&#12354;&#12425;&#12422;&#12427;&#12418;&#12398;&#12364;&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#21462;&#12426;&#25201;&#12431;&#12428;&#12414;&#12377;&#12290;UNIX &#12471;&#12473;&#12486;&#12512;&#12434;&#27083;&#25104;&#12377;&#12427;&#12411;&#12412;&#12377;&#12409;&#12390;&#12398;&#29289;&#20307;&#12364;&#12381;&#12358;&#12356;&#12358;&#39080;&#12395;&#21462;&#12426;&#25201;&#12431;&#12428;&#12427;&#12392;&#32771;&#12360;&#12390;&#24046;&#12375;&#25903;&#12360;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#20107;&#23455;&#12289;&#21508;&#31278;&#35013;&#32622;&#12420;&#21608;&#36794;&#27231;&#22120;&#12418;&#29305;&#27530;&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#34920;&#12373;&#12428;&#12414;&#12377;&#12290;&#19968;&#35211;&#24847;&#21619;&#12398;&#28961;&#12356;&#12424;&#12358;&#12395;&#24605;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;&#12371;&#12428;&#12399; UNIX &#12420;&#12381;&#12398;&#27966;&#29983; OS &#12398;&#24375;&#21619;&#12398;&#19968;&#12388;&#12391;&#12377;&#12290;UNIX &#12399;&#12471;&#12531;&#12503;&#12523;&#12394;&#12467;&#12450;&#12434;&#20309;&#24180;&#12395;&#12418;&#12431;&#12383;&#12387;&#12390;&#20445;&#23432;&#12377;&#12427;&#12384;&#12369;&#12391;&#12424;&#12356;&#12398;&#12395;&#23550;&#12375;&#12390;&#12289;&#20182;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12399;&#26032;&#12375;&#12356;&#12486;&#12463;&#12494;&#12525;&#12472;&#12540;&#12364;&#32057;&#20171;&#12373;&#12428;&#12427;&#24230;&#12395;&#12289;&#26032;&#12375;&#12356;&#27010;&#24565;&#12434;&#23566;&#20837;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;</p><p>UNIX &#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12395;&#12362;&#12369;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#31278;&#39006;&#12395;&#12399;&#12289;4 &#12388;&#12398;&#37325;&#35201;&#12394;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p><div class="sect4" lang="ja"><div class="titlepage"><div><div><h5 class="title"><a name="file-types-ordinary-files"></a>&#26222;&#36890;&#12398;&#12501;&#12449;&#12452;&#12523;</h5></div></div></div><p>&#26222;&#36890;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#25991;&#23383;&#12487;&#12540;&#12479;&#12434;&#21547;&#12435;&#12391;&#12356;&#12383;&#12426;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12414;&#12383;&#12399;&#20182;&#12398;&#12487;&#12540;&#12479;&#12391;&#12354;&#12387;&#12383;&#12426;&#12375;&#12414;&#12377;&#12290;&#12371;&#12371;&#12395;&#12399;&#30011;&#20687;&#12501;&#12449;&#12452;&#12523;&#12289;&#12458;&#12540;&#12487;&#12451;&#12458;&#12501;&#12449;&#12452;&#12523;&#12289;&#12458;&#12501;&#12451;&#12473;&#25991;&#26360;&#12362;&#12424;&#12403;&#21205;&#30011;&#12501;&#12449;&#12452;&#12523;&#12418;&#20837;&#12426;&#12414;&#12377;&#12290;<span class="emphasis"><em>&#12501;&#12449;&#12452;&#12523;</em></span> &#12392;&#12356;&#12358;&#29992;&#35486;&#12364;&#12371;&#12428;&#12425;&#26222;&#36890;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#25351;&#12377;&#12398;&#12395;&#12424;&#12367;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p></div><div class="sect4" lang="ja"><div class="titlepage"><div><div><h5 class="title"><a name="file-types-folder-files"></a>&#12501;&#12457;&#12523;&#12480;&#12501;&#12449;&#12452;&#12523;</h5></div></div></div><p>UNIX &#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12501;&#12457;&#12523;&#12480;&#12418;&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;&#27491;&#30906;&#12395;&#35328;&#12360;&#12400;&#12501;&#12457;&#12523;&#12480;&#12399;&#29305;&#27530;&#12501;&#12449;&#12452;&#12523;&#12395;&#12394;&#12426;&#12414;&#12377;&#12289;&#12371;&#12398;&#12501;&#12457;&#12523;&#12480;&#20869;&#12395;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#21442;&#29031;&#12377;&#12427;&#12383;&#12417;&#12398;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#12510;&#12483;&#12503;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p></div><div class="sect4" lang="ja"><div class="titlepage"><div><div><h5 class="title"><a name="file-types-symbolic-link-files"></a>&#12471;&#12531;&#12508;&#12522;&#12483;&#12463;&#12522;&#12531;&#12463;&#12501;&#12449;&#12452;&#12523;</h5></div></div></div><p>&#12471;&#12531;&#12508;&#12522;&#12483;&#12463;&#12522;&#12531;&#12463; (&#12424;&#12367; <span class="emphasis"><em>&#12522;&#12531;&#12463;</em></span> &#12392;&#21628;&#12400;&#12428;&#12414;&#12377;) &#12399;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;&#20182;&#12398;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12497;&#12473;&#12434;&#21547;&#12416;&#29305;&#27530;&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;&#24467;&#12387;&#12390;&#12471;&#12531;&#12508;&#12522;&#12483;&#12463;&#12501;&#12449;&#12452;&#12523;&#33258;&#36523;&#12399;&#29305;&#12395;&#24847;&#21619;&#12398;&#12354;&#12427;&#24773;&#22577;&#12434;&#25345;&#12385;&#12414;&#12379;&#12435;&#12289;&#21336;&#12395;&#20182;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#21442;&#29031;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;</p></div><div class="sect4" lang="ja"><div class="titlepage"><div><div><h5 class="title"><a name="file-types-device-files"></a>&#12487;&#12496;&#12452;&#12473;&#12501;&#12449;&#12452;&#12523;</h5></div></div></div><p>&#22987;&#12417;&#12398;&#26041;&#12391;&#36848;&#12409;&#12383;&#12424;&#12358;&#12395; (&#12411;&#12392;&#12435;&#12393;&#12398;) &#12487;&#12496;&#12452;&#12473;&#12418;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#32076;&#30001;&#12391;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#29305;&#27530;&#12487;&#12496;&#12452;&#12473;&#12501;&#12449;&#12452;&#12523;&#12399;&#36890;&#24120; <code class="filename">/dev</code> &#12501;&#12457;&#12523;&#12480;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#29305;&#27530;&#12501;&#12449;&#12452;&#12523; <code class="filename">/dev/hda</code> &#12399; Linux &#19978;&#12391;&#12398;&#19968;&#30058;&#30446;&#12398; IDE &#12487;&#12451;&#12473;&#12463;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;</p></div></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="customizing-thunar.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="faq.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">Thunar &#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12424;&#12367;&#12354;&#12427;&#36074;&#21839;</td></tr></table></div></body></html>
