<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Thunar &#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="up" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="prev" href="preferences.html" title="&#12501;&#12449;&#12452;&#12523;&#31649;&#29702;&#12398;&#35373;&#23450;"><link rel="next" href="advanced-topics.html" title="&#39640;&#24230;&#12394;&#35441;&#38988;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Thunar &#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="preferences.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="advanced-topics.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="customizing-thunar"></a>Thunar &#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;</h2></div></div></div><p>&#12371;&#12398;&#31456;&#12391;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#19968;&#37096;&#12434;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;</p><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="sendto"></a>&#12300;&#36865;&#12427;&#12301;&#12513;&#12491;&#12517;&#12540;</h3></div></div></div><p>Thunar &#12395;&#12399; <span class="guilabel"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span> &#12513;&#12491;&#12517;&#12540;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#36865;&#12426;&#20808;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;<span class="guilabel"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span> &#12513;&#12491;&#12517;&#12540;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12399;&#12289;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenuitem"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/sendto-menu.png" alt="&#12300;&#36865;&#12427;&#12301;&#12513;&#12491;&#12517;&#12540;"></div></div><p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;<span class="guilabel"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span> &#12513;&#12491;&#12517;&#12540;&#12395;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12452;&#12523;&#12362;&#12424;&#12403;&#12501;&#12457;&#12523;&#12480;&#12398;&#36984;&#25246;&#26178;&#12395; <span class="guilabel"><strong>&#12300;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503; (&#12522;&#12531;&#12463;&#12434;&#20316;&#25104;)&#12301;</strong></span> &#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12456;&#12531;&#12488;&#12522;&#12364;&#34920;&#31034;&#12373;&#12428;&#12289;&#12371;&#12428;&#12434;&#36984;&#12406;&#12392;&#36984;&#25246;&#12373;&#12428;&#12383;&#21508;&#12450;&#12452;&#12486;&#12512;&#12398;&#12522;&#12531;&#12463;&#12434;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12395;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<span class="guilabel"><strong>&#12300;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12506;&#12452;&#12531;&#12301;</strong></span> &#12364;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12428;&#12400;&#12289;&#12501;&#12457;&#12523;&#12480;&#36984;&#25246;&#26178;&#12398;&#12513;&#12491;&#12517;&#12540;&#12395;&#12399; <span class="guilabel"><strong>&#12300;&#12469;&#12452;&#12489;&#12506;&#12452;&#12531; (&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#20316;&#25104;)&#12301;</strong></span> &#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12456;&#12531;&#12488;&#12522;&#12364;&#34920;&#31034;&#12373;&#12428;&#12289;&#12371;&#12428;&#12434;&#36984;&#12406;&#12392;&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12395;&#26032;&#12375;&#12367;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12456;&#12531;&#12488;&#12522;&#12398;&#27425;&#12395;&#12289;<strong class="application"><code>Thunar</code></strong> &#12399;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12395;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12364;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12381;&#12428;&#12425;&#12398;&#12456;&#12531;&#12488;&#12522;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#19978;&#12398;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;&#12391;&#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#36865;&#12426;&#20808;&#12392;&#12375;&#12390; <span class="guilabel"><strong>&#12300;&#12501;&#12525;&#12483;&#12500;&#12540;&#12489;&#12521;&#12452;&#12502;&#12301;</strong></span> &#12364;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;<span class="guilabel"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span> &#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12487;&#12496;&#12452;&#12473;&#12434;&#19968;&#24230;&#36984;&#25246;&#12377;&#12428;&#12400;&#12289;&#12381;&#12398;&#12487;&#12496;&#12452;&#12473;&#12399;&#33258;&#21205;&#30340;&#12395;&#12510;&#12454;&#12531;&#12488;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;&#25163;&#21205;&#12391;&#12510;&#12454;&#12531;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12356;&#12371;&#12392;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#12373;&#12425;&#12395;&#12289;<strong class="application"><code>Thunar</code></strong> &#12399; <strong class="application"><code>thunar-sendto-email</code></strong> &#12503;&#12521;&#12464;&#12452;&#12531;&#12434;&#21516;&#26801;&#12375;&#12390;&#12362;&#12426;&#12289;<span class="guilabel"><strong>&#12300;&#12513;&#12540;&#12523; (&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;)&#12301;</strong></span> &#12456;&#12531;&#12488;&#12522;&#12418;&#36861;&#21152;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#36984;&#25246;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12434;&#28155;&#20184;&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#12513;&#12540;&#12523;&#36865;&#20449;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#36984;&#25246;&#12373;&#12428;&#12383;&#12450;&#12452;&#12486;&#12512;&#12398;&#20013;&#12395;&#12501;&#12457;&#12523;&#12480;&#12364;&#19968;&#12388;&#12391;&#12418;&#21547;&#12414;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;&#36984;&#25246;&#12373;&#12428;&#12383;&#12450;&#12452;&#12486;&#12512;&#12399;&#12513;&#12540;&#12523;&#12395;&#28155;&#20184;&#12373;&#12428;&#12427;&#21069;&#12395; ZIP &#24418;&#24335;&#12391;&#12450;&#12540;&#12459;&#12452;&#12502;&#12373;&#12428;&#12414;&#12377;&#12290;&#20182;&#12395;&#12289;&#35079;&#25968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12289;&#12354;&#12427;&#12356;&#12399; 200KiB &#12434;&#36229;&#12360;&#12427;&#12469;&#12452;&#12474;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434; ZIP &#24418;&#24335;&#12391;&#12450;&#12540;&#12459;&#12452;&#12502;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12398;&#30906;&#35469;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;</p><p><strong class="application"><code>Thunar</code></strong> &#12398; <span class="guilabel"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span> &#12513;&#12491;&#12517;&#12540;&#12434;&#25313;&#24373;&#12375;&#12289;&#26032;&#12375;&#12356;&#12479;&#12540;&#12466;&#12483;&#12488;&#29992;&#12398;&#12456;&#12531;&#12488;&#12522;&#12434;&#21033;&#29992;&#32773;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#32773;&#12364;&#36861;&#21152;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#27161;&#28310;<a class="ulink" href="http://freedesktop.org/wiki/Standards_2fdesktop_2dentry_2dspec" target="_top">&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12456;&#12531;&#12488;&#12522;&#12501;&#12449;&#12452;&#12523;</a> &#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#23481;&#26131;&#12395;&#34892;&#12360;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399; <code class="filename">$XDG_DATA_DIRS/Thunar/sendto/</code> &#12501;&#12457;&#12523;&#12480;&#12395;&#26684;&#32013;&#12373;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435; (&#29872;&#22659;&#22793;&#25968; <code class="literal">$XDG_DATA_DIRS</code> &#12395;&#38306;&#12377;&#12427;&#35443;&#32048;&#12399;&#12289;<a class="ulink" href="http://freedesktop.org/wiki/Standards_2fbasedir_2dspec" target="_top">XDG Base Directory Specification</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;</p><p>&#12479;&#12540;&#12466;&#12483;&#12488;&#12398; <code class="filename">.desktop</code> &#12501;&#12449;&#12452;&#12523;&#12398; <code class="literal">MimeType</code> &#12395;&#12399;&#12289;<span class="guilabel"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span> &#12513;&#12491;&#12517;&#12540;&#12395;&#12381;&#12398;&#12456;&#12531;&#12488;&#12522;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<a class="ulink" href="http://flickr.com/" target="_top">Flickr</a> &#12398;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12484;&#12540;&#12523;&#12398;&#12456;&#12531;&#12488;&#12522;&#12434;&#36861;&#21152;&#12377;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12456;&#12531;&#12488;&#12522;&#12399; JPEG (&#12414;&#12383;&#12399; Frickr &#12364;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;&#24418;&#24335;&#12398;) &#12501;&#12449;&#12452;&#12523;&#12364;&#36984;&#25246;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12427;&#12409;&#12365;&#12391;&#12354;&#12426;&#12289;<code class="literal">MimeType=image/jpeg;</code> &#12398;&#25351;&#23450;&#12434;&#36861;&#21152;&#12377;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;<code class="literal">MimeType</code> &#12434;&#25351;&#23450;&#12375;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12395;&#12399;&#12456;&#12531;&#12488;&#12522;&#12399;&#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; <strong class="application"><code>postr</code></strong> &#12434;&#20351;&#29992;&#12375;&#12383;&#23436;&#20840;&#12394;&#20363;&#12434;&#20197;&#19979;&#12395;&#31034;&#12375;&#12414;&#12377;:</p><pre class="programlisting">
# postr.desktop - Integrate postr into
#                 the "Send To" menu.
[Desktop Entry]
Type=Application
Version=1.0
Encoding=UTF-8
TryExec=postr
Exec=postr %F
Icon=postr
Name=Flickr
MimeType=image/jpeg;</pre><p>&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434; <code class="filename">~/.local/share/Thunar/sendto/</code> (&#12394;&#12363;&#12387;&#12383;&#12425;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;) &#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12392;&#12289;JPEG &#12501;&#12449;&#12452;&#12523;&#12398;<span class="guilabel"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span>&#12513;&#12491;&#12517;&#12540;&#12395;&#26032;&#12375;&#12356;&#12456;&#12531;&#12488;&#12522; <span class="guilabel"><strong>&#12300;Flickr&#12301;</strong></span> &#12364;&#34920;&#31034;&#12373;&#12428;&#12289;&#12371;&#12428;&#12434;&#20351;&#12387;&#12390; JPEG &#30011;&#20687;&#12434; Frickr &#12408;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;</p><p><a class="ulink" href="http://thunar.xfce.org/pwiki/documentation/sendto_menu" target="_top">Thunar Project Wiki</a> &#12395;&#12399;&#12289;<span class="guilabel"><strong>&#12300;&#36865;&#12427;&#12301;</strong></span>&#12513;&#12491;&#12517;&#12540;&#12391;&#20351;&#12360;&#12427;&#12456;&#12531;&#12488;&#12522;&#12398;&#23455;&#29992;&#20363;&#12364;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;Wiki &#12506;&#12540;&#12472;&#12395;&#12354;&#12394;&#12383;&#12398;&#26032;&#12375;&#12356;&#20363;&#12434;&#12362;&#27671;&#36605;&#12395;&#36861;&#21152;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="thumbnailers"></a>&#12469;&#12512;&#12493;&#12452;&#12521;</h3></div></div></div><p>Thunar &#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#23481;&#12398;&#12503;&#12524;&#12499;&#12517;&#12540;&#12392;&#12375;&#12390;&#12469;&#12512;&#12493;&#12452;&#12523;&#34920;&#31034;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12469;&#12512;&#12493;&#12452;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#23567;&#12373;&#12394;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#23567;&#12373;&#12394;&#12484;&#12540;&#12523;&#12399;&#12469;&#12512;&#12493;&#12452;&#12521;&#12392;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290;Thunar &#12399;&#12452;&#12513;&#12540;&#12472;&#12392;&#12501;&#12457;&#12531;&#12488;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12512;&#12493;&#12452;&#12521;&#12434;&#21516;&#26801;&#12375;&#12390;&#12362;&#12426;&#12289;<code class="literal">gconf</code> &#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427; GNOME &#12398;&#12469;&#12512;&#12493;&#12452;&#12521;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;&#12381;&#12428;&#12434;&#33258;&#21205;&#30340;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#12469;&#12512;&#12493;&#12452;&#12521;&#12398;&#22522;&#26412;&#27231;&#33021;&#12395;&#21152;&#12360;&#12289;&#20182;&#12398;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12398;&#12469;&#12512;&#12493;&#12452;&#12521;&#12434;&#21205;&#30340;&#12395;&#25313;&#24373;&#12375;&#12383;&#12356;&#12392;&#12365;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;</p><p>&#12354;&#12394;&#12383;&#12364;&#12459;&#12473;&#12479;&#12512;&#12469;&#12512;&#12493;&#12452;&#12521;&#12434;&#20316;&#25104;&#12377;&#12427;&#22580;&#21512;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;2&#12388;&#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12497;&#12521;&#12513;&#12540;&#12479;&#12395;&#23550;&#24540;&#12375;&#12383;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#19968;&#12388;&#12399;&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395;&#12469;&#12509;&#12540;&#12488;&#12375;&#12383;&#12356;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12289;&#12418;&#12358;&#19968;&#12388;&#12399;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12395; <a class="ulink" href="http://jens.triq.net/thumbnail-spec/creation.html#AEN139" target="_top">Thumbnail Management Standard</a> &#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#28310;&#25312;&#12375;&#12383; PNG &#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12414;&#12383;&#12289;&#24517;&#38920;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12469;&#12512;&#12493;&#12452;&#12523;&#12398;&#12469;&#12452;&#12474;&#35201;&#27714;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#24375;&#12367;&#25512;&#22888;&#12373;&#12428;&#12414;&#12377;&#12290;&#12354;&#12394;&#12383;&#12398;&#20316;&#25104;&#12375;&#12383;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#21213;&#25163;&#12394;&#30011;&#20687;&#12469;&#12452;&#12474;&#12391;&#12501;&#12449;&#12452;&#12523;&#12434;&#20986;&#21147;&#12375;&#12383;&#22580;&#21512;&#12289;Thunar &#12399;&#24460;&#12391;&#12381;&#12428;&#12434;&#35201;&#27714;&#12373;&#12428;&#12427;&#12469;&#12452;&#12474;&#12395;&#22793;&#26356;&#12375;&#12414;&#12377;&#12364;&#12289;&#12381;&#12428;&#12399;&#26368;&#36969;&#12394;&#12469;&#12452;&#12474;&#12391;&#12469;&#12512;&#12493;&#12452;&#12523;&#12434;&#29983;&#25104;&#12375;&#12383;&#22580;&#21512;&#12395;&#27604;&#12409;&#36969;&#20999;&#12394;&#32080;&#26524;&#12434;&#29983;&#12415;&#20986;&#12377;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;</p><p>&#12354;&#12394;&#12383;&#12398;&#12469;&#12512;&#12493;&#12452;&#12523;&#12434;&#29983;&#25104;&#12377;&#12427;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12364;&#12391;&#12365;&#12354;&#12364;&#12387;&#12383;&#12425;&#12289;Thunar &#12364;&#12381;&#12428;&#12434;&#35469;&#35672;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#30331;&#37682;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12395;&#12399;&#12289;&#12354;&#12394;&#12383;&#12399; <code class="filename">$XDG_DATA_DIRS/thumbnailers/</code> &#12497;&#12473;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12469;&#12512;&#12493;&#12452;&#12521;&#12398;&#35500;&#26126;&#12501;&#12449;&#12452;&#12523; (<code class="filename">.desktop</code> &#12501;&#12449;&#12452;&#12523;) &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#20363;&#12360;&#12400;&#12289;&#12381;&#12398;&#12469;&#12512;&#12493;&#12452;&#12521;&#12434;&#12354;&#12394;&#12383;&#12398;&#12518;&#12540;&#12470;&#12450;&#12459;&#12454;&#12531;&#12488;&#12384;&#12369;&#12391;&#20351;&#29992;&#12375;&#12383;&#12356;&#22580;&#21512;&#12395;&#12399;&#12289;<code class="filename">.desktop</code> &#12501;&#12449;&#12452;&#12523;&#12434; <code class="filename">~/.local/share/thumbnailers/</code> &#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;&#12469;&#12512;&#12493;&#12452;&#12521;&#12398; <code class="filename">.desktop</code> &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#20197;&#19979;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="thumbnailer-desktop-file-format"></a>&#12469;&#12512;&#12493;&#12452;&#12521;&#35500;&#26126;&#12501;&#12449;&#12452;&#12523;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</h4></div></div></div><p>&#12469;&#12512;&#12493;&#12452;&#12521;&#35500;&#26126;&#12501;&#12449;&#12452;&#12523;&#12399; <a class="ulink" href="http://standards.freedesktop.org/desktop-entry-spec/latest/" target="_top">Desktop Entry Format</a> &#12391;&#35215;&#23450;&#12373;&#12428;&#12383;&#24418;&#24335;&#12391;&#12289;<code class="literal">Type</code> &#12395;&#29305;&#27530;&#12394;&#12479;&#12452;&#12503; <code class="literal">X-Thumbnailer</code> &#12434;&#25351;&#23450;&#12375;&#12289;&#29305;&#27530;&#12394;&#12501;&#12451;&#12540;&#12523;&#12489; <code class="literal">X-Thumbnailer-Exec</code> &#12395;&#26032;&#12375;&#12356;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p><pre class="programlisting">
[Desktop Entry]
Version=1.0
Encoding=UTF-8
Type=X-Thumbnailer
Name=Your Thumbnailer
MimeType=your-supported/mime-type;
X-Thumbnailer-Exec=your-thumbnailer %i %o %s</pre><p> <code class="literal">Version</code> &#12362;&#12424;&#12403; <code class="literal">Encoding</code> &#12399;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12456;&#12531;&#12488;&#12522;&#20181;&#27096;&#12395;&#12424;&#12387;&#12390;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;&#19978;&#12398;&#20363;&#12398;&#20516;&#12434;&#12381;&#12398;&#12414;&#12414;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<code class="literal">Type</code> &#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#29305;&#27530;&#12394;&#20516; <code class="literal">X-Thumbnailer</code> &#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12378;&#12289;&#20182;&#12398;&#20516;&#12391;&#12399;&#12392;&#12469;&#12512;&#12493;&#12452;&#12521;&#12392;&#12375;&#12390;&#35469;&#35672;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;<code class="literal">Name</code> &#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12399;&#12354;&#12394;&#12383;&#12398;&#12469;&#12512;&#12493;&#12452;&#12521;&#12398;&#35500;&#26126;&#12434;&#35352;&#36848;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p><code class="literal">X-Thumbnailer-Exec</code> &#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12399;&#12354;&#12394;&#12383;&#12398;&#12469;&#12512;&#12493;&#12452;&#12521;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;&#12399;&#12469;&#12512;&#12493;&#12452;&#12521;&#23455;&#34892;&#26178;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12427;&#12356;&#12367;&#12388;&#12363;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12467;&#12540;&#12489;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#35469;&#35672;&#12377;&#12427;&#12501;&#12451;&#12540;&#12523;&#12489;&#12467;&#12540;&#12489;&#12434;&#20197;&#19979;&#12395;&#31034;&#12375;&#12414;&#12377;:</p><div class="variablelist"><dl><dt><span class="term"><code class="varname">%i</code></span></dt><dd>&#12469;&#12512;&#12493;&#12452;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#20837;&#21147;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12459;&#12523;&#12497;&#12473;&#12391;&#12377;&#12290;&#12469;&#12512;&#12493;&#12452;&#12521;&#12434;&#36215;&#21205;&#12375;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12363;&#12425;&#12398;&#30456;&#23550;&#12497;&#12473;&#12363;&#12289;&#32118;&#23550;&#12497;&#12473;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</dd><dt><span class="term"><code class="varname">%o</code></span></dt><dd>&#29983;&#25104;&#12373;&#12428;&#12383;&#12469;&#12512;&#12493;&#12452;&#12523;&#12364;&#20986;&#21147;&#12373;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12459;&#12523;&#12497;&#12473;&#12391;&#12377;&#12290;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12399;&#12469;&#12512;&#12493;&#12452;&#12523;&#27161;&#28310; (&#19978;&#35352;&#21442;&#29031;) &#12395;&#28310;&#25312;&#12375;&#12383;&#26377;&#21177;&#12394; PNG &#12501;&#12449;&#12452;&#12523;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#19968;&#37096;&#12398;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12484;&#12540;&#12523;&#12434;&#21628;&#12403;&#20986;&#12377;&#22580;&#21512;&#12289;&#12497;&#12473;&#12399; <code class="literal">.png</code> &#12391;&#32066;&#12431;&#12425;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</dd><dt><span class="term"><code class="varname">%s</code></span></dt><dd>&#35201;&#27714;&#12373;&#12428;&#12427;&#29983;&#25104;&#12377;&#12427;&#12469;&#12512;&#12493;&#12452;&#12523;&#12398;&#12469;&#12452;&#12474; (&#12500;&#12463;&#12475;&#12523;) &#12391;&#12377;&#12290;&#12371;&#12398;&#12497;&#12521;&#12513;&#12479;&#12399;&#20219;&#24847;&#12391;&#12377;&#12290;</dd><dt><span class="term"><code class="varname">%u</code></span></dt><dd><code class="literal">%i</code> &#12392;&#20284;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#12497;&#12473;&#12391;&#12399;&#12394;&#12367;&#12289;URI &#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399; GNOME &#12392;&#12398;&#20114;&#25563;&#24615;&#12398;&#12383;&#12417;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;</dd><dt><span class="term"><code class="varname">%%</code></span></dt><dd>&#19968;&#25991;&#23383;&#12398; <code class="literal">%</code> &#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;</dd></dl></div><p>&#12497;&#12521;&#12513;&#12540;&#12479;&#12395;&#12399;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418; <code class="literal">%o</code> &#12392;&#12289;<code class="literal">%i</code> &#12414;&#12383;&#12399; <code class="literal">%u</code> &#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12469;&#12512;&#12493;&#12452;&#12521;&#12399;&#27491;&#12375;&#12367;&#21205;&#20316;&#12375;&#12414;&#12379;&#12435;&#12290;</p><p><code class="literal">MimeType</code> &#12395;&#12399;&#12469;&#12512;&#12493;&#12452;&#12521;&#12364;&#12503;&#12524;&#12499;&#12517;&#12540;&#12434;&#29983;&#25104;&#12391;&#12365;&#12427; MIME &#12479;&#12452;&#12503;&#12434;&#12289;&#12475;&#12511;&#12467;&#12525;&#12531;&#12391;&#21306;&#20999;&#12387;&#12390;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="eps-thumbnailer-example"></a>EPS &#12469;&#12512;&#12493;&#12452;&#12521;&#12398;&#20363;</h4></div></div></div><p>&#12371;&#12371;&#12391;&#12399;&#12289;ImageMagick &#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#25552;&#20379;&#12373;&#12428;&#12427; <span class="command"><strong>convert</strong></span> &#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12383;&#12289;<code class="filename">.eps</code> &#12501;&#12449;&#12452;&#12523;&#29992;&#12469;&#12512;&#12493;&#12452;&#12521;&#12398;&#20316;&#25104;&#12363;&#12425;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12414;&#12391;&#12398;&#20363;&#12434;&#32057;&#20171;&#12375;&#12414;&#12377;&#12290;&#26368;&#21021;&#12395;&#12289;&#12469;&#12512;&#12493;&#12452;&#12523;&#12434;&#35201;&#27714;&#12373;&#12428;&#12383;&#12469;&#12452;&#12474;&#12391;&#29983;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#12289;<span class="command"><strong>convert</strong></span> &#12434;&#21628;&#12403;&#20986;&#12377;&#31777;&#21336;&#12394;&#12473;&#12463;&#12522;&#12503;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p><pre class="programlisting">
#!/bin/sh
#
# eps-thumbnailer - Example thumbnailer script for EPS files.
#
# Usage: esp-thumbnailer eps-file png-file size
#

# command line parameters
ifile=$1
ofile=$2
size=$3

# invoke convert (ImageMagick)
exec convert "eps:$ifile" -scale "$sizex$size" "png:$ofile"</pre><p>&#12371;&#12398;&#12473;&#12463;&#12522;&#12503;&#12488;&#12434; <code class="filename">eps-thumbnailer</code> &#12392;&#12356;&#12358;&#21517;&#21069;&#12391;&#20445;&#23384;&#12375;&#12289;&#23455;&#34892;&#35377;&#21487;&#12434;&#35373;&#23450;&#12375;&#12390;&#12289;<code class="filename">/usr/local/bin</code> &#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;</p><pre class="screen">
$ chmod +x eps-thumbnailer
$ sudo install eps-thumbnailer /usr/local/bin/eps-thumbnailer</pre><p>&#27425;&#12395;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12469;&#12512;&#12493;&#12452;&#12523;&#35500;&#26126;&#12501;&#12449;&#12452;&#12523; <code class="filename">eps-thumbnailer.desktop</code> &#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p><pre class="programlisting">
[Desktop Entry]
Version=1.0
Encoding=UTF-8
Type=X-Thumbnailer
Name=EPS Thumbnailer
TryExec=convert
MimeType=image/x-eps;
X-Thumbnailer-Exec=/usr/local/bin/eps-thumbnailer %i %o %s</pre><p>&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399; <code class="filename">/usr/local/share/thumbnailers</code> &#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435; (&#12394;&#12363;&#12387;&#12383;&#12425;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;</p><pre class="screen">
$ sudo install -d /usr/local/share/thumbnailers
$ sudo install eps-thumbnailer.desktop /usr/local/share/thumbnailers/eps-thumbnailer.desktop</pre><p><code class="filename">eps-thumbnailer.desktop</code> &#12501;&#12449;&#12452;&#12523;&#12395;&#29305;&#27530;&#12461;&#12540; <code class="literal">TryExec</code> &#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12381;&#12428;&#12434;&#21442;&#29031;&#12375;&#12414;&#12377;&#12290;<code class="literal">TryExec</code> &#12395;&#12399;&#12289;&#12469;&#12512;&#12493;&#12452;&#12521;&#12364;&#21205;&#20316;&#12377;&#12427;&#12383;&#12417;&#12395;&#12471;&#12473;&#12486;&#12512;&#19978;&#12395;&#23384;&#22312;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12467;&#12510;&#12531;&#12489;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20363;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#12473;&#12463;&#12522;&#12503;&#12488;&#12399; <span class="command"><strong>convert</strong></span> &#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#12392;&#36215;&#21205;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p><p>&#26368;&#24460;&#12395;&#12289;&#12469;&#12512;&#12493;&#12452;&#12521;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20877;&#29983;&#25104;&#12375;&#12289;Thunar &#12395;&#12371;&#12398;&#12469;&#12512;&#12493;&#12452;&#12521;&#12434;&#35469;&#35672;&#12373;&#12379;&#12414;&#12377;&#12290;&#12469;&#12512;&#12493;&#12452;&#12521;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399; <code class="filename">$XDG_CACHE_HOME/Thunar/thumbnailers.cache</code> &#12395;&#12354;&#12426;&#12414;&#12377; (&#12354;&#12394;&#12383;&#12289;&#12414;&#12383;&#12399;&#12354;&#12394;&#12383;&#12398;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#12364;&#22793;&#26356;&#12375;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;<code class="varname">$XDG_CACHE_HOME</code> &#12399; <code class="filename">~/.cache/</code> &#12501;&#12457;&#12523;&#12480;&#12434;&#25351;&#12375;&#12390;&#12356;&#12414;&#12377;)&#12290;&#12469;&#12512;&#12493;&#12452;&#12521;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399; Thunar &#12395;&#12424;&#12387;&#12390;&#23450;&#26399;&#30340;&#12395;&#20877;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;Thunar &#12395;&#21516;&#26801;&#12373;&#12428;&#12390;&#12356;&#12427; <code class="filename">thunar-vfs-update-thumbnailers-cache-1</code> &#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#24375;&#21046;&#30340;&#12395;&#20877;&#20316;&#25104;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12399;&#36890;&#24120;&#12354;&#12394;&#12383;&#12398;&#12452;&#12531;&#12473;&#12488;&#12524;&#12540;&#12471;&#12519;&#12531;&#12503;&#12524;&#12501;&#12451;&#12483;&#12463;&#12473;&#12398;&#12469;&#12502;&#12501;&#12457;&#12523;&#12480; <code class="filename">libexec</code> &#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377; (Debian/Ubuntu &#12398;&#22580;&#21512;&#12399; <code class="filename">/usr/lib/thunar</code>) &#12290;&#24467;&#12387;&#12390;&#12289;&#20363;&#12360;&#12400; Thunar &#12364;&#12503;&#12524;&#12501;&#12451;&#12483;&#12463;&#12473;&#25351;&#23450; <code class="filename">/usr</code> &#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12383;&#22580;&#21512;&#12398;&#12371;&#12398;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12398;&#36215;&#21205;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;:</p><pre class="screen">$ /usr/libexec/thunar-vfs-update-thumbnailers-cache-1</pre><p>&#12383;&#12384;&#12375;&#12289;&#12469;&#12512;&#12493;&#12452;&#12521;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399;&#12471;&#12473;&#12486;&#12512;&#20840;&#20307;&#12391;&#12398;&#22580;&#25152;&#12391;&#12399;&#12394;&#12367;&#12289;&#12354;&#12394;&#12383;&#12398;&#12507;&#12540;&#12512;&#12501;&#12457;&#12523;&#12480;&#12395;&#26684;&#32013;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;&#12371;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#12473;&#12540;&#12497;&#12540;&#12518;&#12540;&#12470;&#12391;&#12399;&#12394;&#12367;&#12289;&#12354;&#12394;&#12383;&#12398;&#12518;&#12540;&#12470;&#12450;&#12459;&#12454;&#12531;&#12488;&#12391;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12434;&#24536;&#12428;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#12371;&#12428;&#12391; Thunar &#12399;&#22793;&#26356;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;&#12469;&#12509;&#12540;&#12488; (FAM &#12414;&#12383;&#12399; Gamin &#12434;&#20351;&#29992;&#12375;&#12414;&#12377;) &#20184;&#12365;&#12391;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12289;&#25968;&#31186;&#24460;&#12395;&#12399;&#26032;&#12375;&#12356;&#12469;&#12512;&#12493;&#12452;&#12521;&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;&#33258;&#21205;&#30340;&#12395;&#12500;&#12483;&#12463;&#12450;&#12483;&#12503;&#12373;&#12428;&#12289;&#12381;&#12398;&#24460;&#12399;&#12354;&#12394;&#12383;&#12398;&#12459;&#12473;&#12479;&#12512;&#12469;&#12512;&#12493;&#12452;&#12521;&#12434;&#20351;&#29992;&#12375;&#12390;&#12469;&#12512;&#12493;&#12452;&#12523;&#12398;&#29983;&#25104;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12418;&#12375;&#12381;&#12428;&#12364;&#34892;&#12431;&#12428;&#12394;&#12369;&#12428;&#12400;&#12289;&#36215;&#21205;&#20013;&#12398;&#12377;&#12409;&#12390;&#12398; Thunar &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20197;&#19979;&#12398;&#12467;&#12510;&#12531;&#12489;&#12391;&#32066;&#20102;&#12373;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><pre class="screen">$ Thunar -q</pre><p>&#12381;&#12398;&#24460; Thunar &#12434;&#36215;&#21205;&#12375;&#30452;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="cleaning-up-thumbnails"></a>&#12469;&#12512;&#12493;&#12452;&#12523;&#12398;&#12463;&#12522;&#12540;&#12531;&#12450;&#12483;&#12503;</h4></div></div></div><p>&#29983;&#25104;&#12373;&#12428;&#12383;&#12469;&#12512;&#12493;&#12452;&#12523;&#12399; <a class="ulink" href="http://jens.triq.net/thumbnail-spec/index.html" target="_top">Thumbnail Management Standard</a> &#12395;&#28310;&#25312;&#12375;&#12390; <code class="filename">~/.thumbnails/</code> &#12501;&#12457;&#12523;&#12480;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#26032;&#12375;&#12356;&#12469;&#12512;&#12493;&#12452;&#12521;&#12434;&#12486;&#12473;&#12488;&#12375;&#12390;&#12356;&#12427;&#12358;&#12385;&#12395;&#12469;&#12512;&#12493;&#12452;&#12521;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#25475;&#38500;&#12375;&#12383;&#12367;&#12394;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12461;&#12515;&#12483;&#12471;&#12517;&#12501;&#12457;&#12523;&#12480;&#12434;&#21066;&#38500;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><pre class="screen">$ rm -rf ~/.thumbnails/</pre><p>&#12371;&#12428;&#12391;&#12354;&#12394;&#12383;&#12398;&#12507;&#12540;&#12512;&#12501;&#12457;&#12523;&#12480;&#12395;&#22810;&#23569;&#12398;&#31354;&#12365;&#12473;&#12506;&#12540;&#12473;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12457;&#12523;&#12480;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12383;&#12377;&#12409;&#12390;&#12398;&#24773;&#22577;&#12399;&#12354;&#12394;&#12383;&#12398;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12395;&#12354;&#12427;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#33258;&#21205;&#30340;&#12395;&#20877;&#20316;&#25104;&#12373;&#12428;&#12289;&#24517;&#35201;&#12394;&#12487;&#12540;&#12479;&#12364;&#22833;&#12431;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="preferences.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="advanced-topics.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12501;&#12449;&#12452;&#12523;&#31649;&#29702;&#12398;&#35373;&#23450; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#39640;&#24230;&#12394;&#35441;&#38988;</td></tr></table></div></body></html>
