<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12424;&#12367;&#12354;&#12427;&#36074;&#21839;</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="up" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="prev" href="advanced-topics.html" title="&#39640;&#24230;&#12394;&#35441;&#38988;"><link rel="next" href="support.html" title="&#12469;&#12509;&#12540;&#12488;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12424;&#12367;&#12354;&#12427;&#36074;&#21839;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="advanced-topics.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="support.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="faq"></a>&#12424;&#12367;&#12354;&#12427;&#36074;&#21839;</h2></div></div></div><p>&#12371;&#12398;&#31456;&#12391;&#12399; Thunar &#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#12289;&#12363;&#12394;&#12426;&#12398;&#38971;&#24230;&#12391;&#23563;&#12397;&#12425;&#12428;&#12427;&#36074;&#21839;&#12395;&#22238;&#31572;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12506;&#12540;&#12472;&#12395;&#12394;&#12356;&#36074;&#21839;&#12364;&#12354;&#12427;&#12398;&#12391;&#12375;&#12383;&#12425;&#12289;<a class="ulink" href="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided" target="_top">&#35201;&#26395;</a> &#12434;&#20986;&#12375;&#12390;&#19979;&#12373;&#12427;&#12424;&#12358;&#12362;&#39000;&#12356;&#12375;&#12414;&#12377;&#12290;</p><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="faq-executables"></a>&#23455;&#34892;&#21487;&#33021;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12501;&#12449;&#12452;&#12523;&#12434;&#23455;&#34892;&#12375;&#12394;&#12356;&#12398;&#12399;&#12394;&#12380;&#12391;&#12377;&#12363;?</h4></div></div></div><p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#29702;&#30001;&#12363;&#12425;&#12289;Thunar &#12399;&#31278;&#39006;&#12364; <code class="literal">application/x-desktop</code>, <code class="literal">application/x-executable</code> &#12362;&#12424;&#12403; <code class="literal">application/x-shellscript</code> &#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#12415;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#31278;&#39006;&#12364; <code class="literal">Application</code> &#12363;&#12388;&#36969;&#27491;&#12394; <code class="literal">Exec</code> &#34892;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;&#31278;&#39006;&#12364; <code class="literal">Link</code> &#12363;&#12388;&#36969;&#27491;&#12394; <code class="literal">URL</code> &#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#38480;&#12387;&#12390;&#23455;&#34892;&#27231;&#33021;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12381;&#12398;&#20182;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#24403;&#35442;&#12501;&#12449;&#12452;&#12523;&#12364;&#29694;&#22312;&#12398;&#21033;&#29992;&#32773;&#12395;&#12392;&#12387;&#12390;&#23455;&#34892;&#21487;&#33021;&#12394;&#12424;&#12358;&#12395;&#12510;&#12540;&#12463;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p><p><code class="literal">application/x-executable</code> &#12362;&#12424;&#12403; <code class="literal">application/x-shellscript</code> &#12395;&#38306;&#12375;&#12390;&#12399;&#27425;&#12398;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12289;&#12371;&#12398;&#31278;&#39006;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#23455;&#38555;&#12395;&#12399;&#12371;&#12398;&#31278;&#39006;&#12395;&#27491;&#30906;&#12395;&#19968;&#33268;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12289;&#12375;&#12363;&#12375;&#12289;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12383;&#31278;&#39006;&#12395;&#19978;&#35352;&#20108;&#12388;&#12398;&#31278;&#39006;&#12395;&#35442;&#24403;&#12377;&#12427;&#35242;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289;&#12354;&#12427;&#12356;&#12399; MIME &#12479;&#12452;&#12503;&#12364;&#19978;&#12395;&#12354;&#12427;&#12418;&#12398;&#12398;&#20869;&#12398;&#19968;&#12388;&#12408;&#12398;&#21029;&#21517;&#12394;&#12425;&#12400;&#12289;&#12381;&#12428;&#12391;&#20107;&#36275;&#12426;&#12414;&#12377;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="faq-metadata"></a>&#12501;&#12449;&#12452;&#12523;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12513;&#12479;&#12487;&#12540;&#12479;&#12399;&#20309;&#20966;&#12395;&#20445;&#23384;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12363;?</h4></div></div></div><p>Thunar &#12399;&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12395;&#27096;&#12293;&#12394;&#35373;&#23450;&#20107;&#38917;&#12434;&#38306;&#36899;&#20184;&#12369;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12399;&#12513;&#12479;&#12487;&#12540;&#12479;&#12392;&#21628;&#12400;&#12428;&#12289;&#20840;&#12501;&#12449;&#12452;&#12523;&#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12399; (&#12513;&#12479;&#12501;&#12449;&#12452;&#12523;&#12392;&#21628;&#12400;&#12428;&#12427;) tdb &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#20445;&#31649;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12399; <code class="filename">$XDG_CACHE_HOME/Thunar/metafile.tdb</code> &#12395;&#20445;&#23384;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;<span class="command"><strong>tdbtool</strong></span> &#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12484;&#12540;&#12523;&#12399;&#37197;&#24067;&#12373;&#12428;&#12427; Thunar &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#12289;&#12469;&#12502;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522; <code class="filename">tdb/</code> &#12395;&#12354;&#12426;&#12414;&#12377;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="faq-thunarrc"></a>Thunar &#12398;&#29872;&#22659;&#35373;&#23450;&#12364;&#20445;&#23384;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12399;&#20309;&#20966;&#12391;&#12377;&#12363;?</h4></div></div></div><p>Thunar &#12399; <code class="filename">.ini</code> &#12501;&#12449;&#12452;&#12523;&#12395;&#21033;&#29992;&#32773;&#12364;&#22793;&#26356;&#21487;&#33021;&#12394;&#29872;&#22659;&#35373;&#23450; (&#12362;&#12424;&#12403;&#38560;&#12375;&#35373;&#23450;) &#12434;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399; <code class="filename">$XDG_CONFIG_HOME/Thunar/thunarrc</code> &#12395;&#12354;&#12426;&#12289;&#12486;&#12461;&#12473;&#12488;&#12456;&#12487;&#12451;&#12479;&#12434;&#20351;&#12387;&#12390;&#33394;&#12293;&#12394;&#35373;&#23450;&#12434;&#23455;&#39443;&#12375;&#12390;&#12415;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#21508;&#29872;&#22659;&#35373;&#23450;&#12398;&#27010;&#35201;&#12399; <code class="filename">docs/README.thunarrc</code> &#12395;&#12354;&#12426;&#12414;&#12377;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="faq-mouse-gestures"></a>Thunar &#12391;&#12510;&#12454;&#12473;&#12472;&#12455;&#12473;&#12481;&#12515;&#12434;&#20351;&#12358;&#12395;&#12399;?</h4></div></div></div><p>&#29694;&#22312;&#12398;&#12392;&#12371;&#12429;&#12289;Thunar &#12399;&#12450;&#12452;&#12467;&#12531;&#34920;&#31034;&#12391;&#12289;&#12356;&#12431;&#12422;&#12427; <span class="emphasis"><em>&#12510;&#12454;&#12473;&#12472;&#12455;&#12473;&#12481;&#12515;</em></span> &#12392;&#21628;&#12400;&#12428;&#12427;&#12418;&#12398;&#12434;&#26368;&#20302;&#38480;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#27231;&#33021;&#12364;&#20633;&#12431;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12510;&#12454;&#12473;&#12509;&#12452;&#12531;&#12479;&#12364;&#12450;&#12452;&#12467;&#12531;&#34920;&#31034;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#32972;&#26223;&#12392;&#12394;&#12427;&#22580;&#25152; (&#12450;&#12452;&#12467;&#12531;&#12420;&#25991;&#23383;&#12364;&#28961;&#12356;&#25152;&#12394;&#12425;&#12393;&#12371;&#12391;&#12418;&#35442;&#24403;&#12375;&#12414;&#12377;) &#12395;&#12354;&#12427;&#38291;&#12399;&#12289;&#12510;&#12454;&#12473;&#12398;&#20013;&#22830;&#12508;&#12479;&#12531; (&#36890;&#24120;&#12399;&#12510;&#12454;&#12473;&#12507;&#12452;&#12540;&#12523;) &#12434;&#25276;&#12375;&#12387;&#25918;&#12375;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12371;&#12428;&#12425; <span class="emphasis"><em>&#12510;&#12454;&#12473;&#12472;&#12455;&#12473;&#12481;&#12515;&#12540;</em></span> &#12398;&#27231;&#33021;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12391;&#12354;&#12427;&#27770;&#12414;&#12387;&#12383;&#21205;&#20316;&#12434;&#23455;&#34892;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12459;&#12540;&#12477;&#12523;&#12434;&#22235;&#26041;&#12395;&#31227;&#21205;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20197;&#19979;&#12391;&#12371;&#12428;&#12425;&#12398;&#21205;&#20316;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;</p><table class="simplelist" border="0" summary="Simple list"><tr><td><span class="guilabel"><strong>&#24038;</strong></span> - &#21069;&#12398;&#12501;&#12457;&#12523;&#12480;&#12434;&#38283;&#12365;&#12414;&#12377;</td></tr><tr><td><span class="guilabel"><strong>&#19978;</strong></span> - &#19978;&#20301;&#12398;&#12501;&#12457;&#12523;&#12480;&#12434;&#38283;&#12365;&#12414;&#12377;</td></tr><tr><td><span class="guilabel"><strong>&#21491;</strong></span> - &#27425;&#12398;&#12501;&#12457;&#12523;&#12480;&#12434;&#38283;&#12365;&#12414;&#12377;</td></tr><tr><td><span class="guilabel"><strong>&#19979;</strong></span> - &#29694;&#22312;&#12398;&#12501;&#12457;&#12523;&#12480;&#12434;&#12522;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;</td></tr></table></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="faq-assign-keyboard-shortcuts"></a>&#12393;&#12398;&#12424;&#12358;&#12395;&#12377;&#12428;&#12400;&#30064;&#12394;&#12427;&#12461;&#12540;&#12508;&#12540;&#12489;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12363;?</h4></div></div></div><p>Thunar &#12399; GTK+ &#27161;&#28310;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#22793;&#26356;&#12398;&#12420;&#12426;&#26041;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12398;&#12391;&#12289;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#21106;&#12426;&#24403;&#12390;&#30452;&#12375;&#12383;&#12356;&#12398;&#12391;&#12375;&#12383;&#12425;&#12289;&#12510;&#12454;&#12473;&#12434;&#35442;&#24403;&#12377;&#12427;&#12513;&#12491;&#12517;&#12540;&#12398;&#19978;&#12414;&#12391;&#25345;&#12387;&#12390;&#12356;&#12387;&#12390;&#12289;&#12381;&#12371;&#12391;&#21106;&#12426;&#24403;&#12390;&#12383;&#12356;&#12461;&#12540;&#12508;&#12540;&#12489;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#25276;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12390;&#12356;&#12427;&#12461;&#12540;&#12508;&#12540;&#12489;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#35442;&#24403;&#12377;&#12427;&#12513;&#12491;&#12517;&#12540;&#38917;&#30446;&#19978;&#12391; <span class="keycap"><strong>&#12496;&#12483;&#12463;&#12473;&#12506;&#12540;&#12473;</strong></span> &#12434;&#25276;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12364;&#22793;&#26356;&#12373;&#12428;&#12394;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;GTK+ &#12391;&#12371;&#12398;&#27231;&#33021;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12399; 3 &#12388;&#12398;&#12420;&#12426;&#26041;&#12364;&#12354;&#12426;&#12414;&#12377;:</p><div class="itemizedlist"><ul type="disc"><li><p>Xfce 4.3 &#12363;&#12381;&#12428;&#12424;&#12426;&#26032;&#12375;&#12356;&#12418;&#12398;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12375;&#12383;&#12425;&#12289;<span class="guilabel"><strong>&#12300;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#35373;&#23450;&#12301;</strong></span> &#12480;&#12452;&#12450;&#12525;&#12464;&#12391; <span class="guilabel"><strong>&#12300;&#12513;&#12491;&#12517;&#12540;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#22793;&#26356;&#21487;&#33021;&#12395;&#12377;&#12427;&#12301;</strong></span> &#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></li><li><p>GNOME &#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12375;&#12383;&#12425;&#12289;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12539;&#12475;&#12531;&#12479;&#12540;&#12398; <span class="guilabel"><strong>&#12300;&#12513;&#12491;&#12517;&#12540;&#12392;&#12484;&#12540;&#12523;&#12496;&#12540;&#12301;</strong></span> &#12480;&#12452;&#12450;&#12525;&#12464;&#12391; <span class="guilabel"><strong>&#12300;&#12513;&#12491;&#12517;&#12540;&#12398;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12479;&#12434;&#32232;&#38598;&#21487;&#33021;&#12395;&#12377;&#12427;&#12301;</strong></span> &#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></li><li><p>&#12381;&#12428;&#20197;&#22806;&#12391;&#12354;&#12428;&#12400;&#12289;&#12501;&#12449;&#12452;&#12523; <code class="filename">~/.gtkrc-2.0</code> (&#12394;&#12363;&#12387;&#12383;&#12425;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;) &#12395; </p><pre class="screen">gtk-can-change-accels=1</pre><p> &#12392;&#12356;&#12358;&#19968;&#34892;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;</p></li></ul></div></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="faq-store-keyboard-shortcuts"></a>&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12399;&#20309;&#20966;&#12395;&#20445;&#23384;&#12373;&#12428;&#12427;&#12398;&#12391;&#12377;&#12363;?</h4></div></div></div><p>&#20491;&#20154;&#12391;&#22793;&#26356;&#12375;&#12383;&#12461;&#12540;&#12508;&#12540;&#12489;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12399; GTK+ &#27161;&#28310;&#12398;&#12450;&#12463;&#12475;&#12521;&#12524;&#12540;&#12479;&#12510;&#12483;&#12503;&#24418;&#24335;&#12391;&#20445;&#23384;&#12373;&#12428;&#12289;<code class="filename">$XDG_CONFIG_HOME/Thunar/accels.scm</code> &#12395;&#32622;&#12363;&#12428;&#12414;&#12377;&#12290;<code class="literal">;</code> &#12391;&#22987;&#12414;&#12427;&#34892;&#12399;&#12467;&#12513;&#12531;&#12488;&#12391;&#12377;&#12290;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#24418;&#24335;&#12395;&#12388;&#12356;&#12390;&#12398;&#35443;&#32048;&#12399; GTK+ &#12398;&#25991;&#26360;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#12354;&#12394;&#12383;&#12364;&#12497;&#12483;&#12465;&#12540;&#12472;&#20316;&#25104;&#32773;&#12363;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#12391;&#12289;Thunar &#12398;&#27161;&#28310;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12392;&#12399;&#30064;&#12394;&#12427;&#12289;&#12471;&#12473;&#12486;&#12512;&#20840;&#20307;&#12398;&#27161;&#28310;&#12461;&#12540;&#12508;&#12540;&#12489;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#35373;&#23450;&#12375;&#12383;&#12356;&#12398;&#12391;&#12375;&#12383;&#12425;&#12289;<code class="envar">$XDG_CONFIG_DIRS</code> &#12398;&#12393;&#12428;&#12363;&#19968;&#12388;&#12395; <code class="filename">Thunar/accels.scm</code> &#12434;&#20316;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;<code class="filename">/etc/xdg</code> (&#22823;&#25269;&#12398; Linux &#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#27161;&#28310;) &#12364; <code class="envar">$XDG_CONFIG_DIRS</code> &#12398;&#19968;&#12388;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12392;&#12377;&#12427;&#12392;&#12289;<code class="filename">/etc/xdg/Thunar/accels.scm</code> &#12395;&#12471;&#12473;&#12486;&#12512;&#20840;&#20307;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#27161;&#28310;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;Thunar &#12399;&#21021;&#22238;&#36215;&#21205;&#26178;&#12395;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="advanced-topics.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="support.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#39640;&#24230;&#12394;&#35441;&#38988; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12469;&#12509;&#12540;&#12488;</td></tr></table></div></body></html>
