<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12501;&#12449;&#12452;&#12523;&#31649;&#29702;&#12398;&#35373;&#23450;</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="up" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="prev" href="using-removable-media.html" title="&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#20351;&#29992;"><link rel="next" href="customizing-thunar.html" title="Thunar &#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12501;&#12449;&#12452;&#12523;&#31649;&#29702;&#12398;&#35373;&#23450;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="using-removable-media.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="customizing-thunar.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="preferences"></a>&#12501;&#12449;&#12452;&#12523;&#31649;&#29702;&#12398;&#35373;&#23450;</h2></div></div></div><p><strong class="application"><code>Thunar</code></strong> &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#21021;&#26399;&#35373;&#23450;&#12399; <span class="guilabel"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#35373;&#23450;&#12301;</strong></span> &#12480;&#12452;&#12450;&#12525;&#12464;&#12391;&#34892;&#12356;&#12414;&#12377;&#12290;&#35373;&#23450;&#12480;&#12452;&#12450;&#12525;&#12464;&#12399;&#12289;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#32232;&#38598;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#35373;&#23450;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;Xfce &#35373;&#23450;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398; <span class="guibutton"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12301;</strong></span> &#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p><span class="guilabel"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#35373;&#23450;&#12301;</strong></span> &#12480;&#12452;&#12450;&#12525;&#12464;&#12399;&#21508;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#20197;&#19979;&#12398; 4 &#12388;&#12398;&#12459;&#12486;&#12468;&#12522;&#12372;&#12392;&#12398;&#12506;&#12540;&#12472;&#12395;&#20998;&#21106;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><div class="itemizedlist"><ul type="disc"><li><p>&#34920;&#31034;&#12395;&#38306;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;</p></li><li><p>&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12395;&#38306;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;</p></li><li><p>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12454;&#12451;&#12531;&#12489;&#12454;&#12398;&#25391;&#12427;&#33310;&#12356;</p></li><li><p>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#35443;&#32048;&#27231;&#33021;</p></li></ul></div><p>Thunar &#12395;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#12373;&#12414;&#12374;&#12414;&#12394;&#25313;&#24373;&#27231;&#33021;&#12434;&#21046;&#24481;&#12377;&#12427;&#12289;&#12356;&#12431;&#12422;&#12427; <span class="emphasis"><em>&#38560;&#12375;&#12458;&#12503;&#12471;&#12519;&#12531;</em></span> &#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#35373;&#23450;&#12480;&#12452;&#12450;&#12525;&#12464;&#12434;&#12471;&#12531;&#12503;&#12523;&#12395;&#12375;&#12390;&#12362;&#12367;&#12383;&#12417;&#12395;&#36984;&#25246;&#38917;&#30446;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;Thunar &#12395;&#21516;&#26801;&#12373;&#12428;&#12427; <a class="ulink" href="http://svn.xfce.org/svn/xfce/thunar/trunk/docs/README.thunarrc" target="_top"><code class="filename">README.thunarrc</code></a> &#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#21033;&#29992;&#21487;&#33021;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#35443;&#32048;&#12394;&#35500;&#26126;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="preferences-views"></a>&#34920;&#31034;&#26041;&#27861;&#12398;&#35373;&#23450;</h3></div></div></div><p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#34920;&#31034;&#12289;&#20006;&#12403;&#26367;&#12360;&#12458;&#12503;&#12471;&#12519;&#12531;&#12289;&#12362;&#12424;&#12403;&#34920;&#31034;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12469;&#12512;&#12493;&#12452;&#12523;&#34920;&#31034;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12395;&#12388;&#12356;&#12390;&#12289;&#12381;&#12428;&#12434;&#34920;&#31034;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12398;&#35373;&#23450;&#12418;&#34892;&#12360;&#12414;&#12377;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/preferences-views.png" alt="&#34920;&#31034;&#26041;&#27861;&#12398;&#35373;&#23450;"></div></div><div class="variablelist"><dl><dt><span class="term"><span class="guilabel"><strong>&#26032;&#35215;&#12501;&#12457;&#12523;&#12480;&#12398;&#34920;&#31034;&#26041;&#27861;</strong></span></span></dt><dd><p>&#12501;&#12457;&#12523;&#12480;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#34920;&#31034;&#26041;&#27861;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#26032;&#12375;&#12356;&#12454;&#12451;&#12531;&#12489;&#12454;&#12364;&#38283;&#12363;&#12428;&#12383;&#12392;&#12365;&#12289;&#12371;&#12371;&#12391;&#35373;&#23450;&#12373;&#12428;&#12383;&#26041;&#27861;&#12391;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;&#12399;&#12289;&#12450;&#12452;&#12467;&#12531;&#34920;&#31034;&#12289;&#12467;&#12531;&#12497;&#12463;&#12488;&#34920;&#31034;&#12289;&#12414;&#12383;&#12399;&#35443;&#32048;&#12522;&#12473;&#12488;&#34920;&#31034;&#12398;&#20013;&#12363;&#12425;&#36984;&#12409;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<span class="guilabel"><strong>&#12300;&#26368;&#24460;&#12395;&#20351;&#29992;&#12375;&#12383;&#34920;&#31034;&#26041;&#27861;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#26368;&#24460;&#12395;&#12450;&#12463;&#12486;&#12451;&#12502;&#12454;&#12451;&#12531;&#12489;&#12454;&#12391;&#20351;&#29992;&#12375;&#12390;&#12356;&#12383;&#26041;&#27861;&#12364;&#25505;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#12501;&#12457;&#12523;&#12480;&#12434;&#12501;&#12449;&#12452;&#12523;&#12424;&#12426;&#20808;&#12395;&#20006;&#12409;&#12427;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12501;&#12457;&#12523;&#12480;&#12398;&#20869;&#23481;&#12434;&#34920;&#31034;&#12377;&#12427;&#38555;&#12395;&#12501;&#12457;&#12523;&#12480;&#12434;&#12501;&#12449;&#12452;&#12523;&#12424;&#12426;&#20808;&#12395;&#20006;&#12409;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#12469;&#12512;&#12493;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#30011;&#20687;&#12420;&#12381;&#12398;&#20182;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12512;&#12493;&#12452;&#12523;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12469;&#12512;&#12493;&#12452;&#12523;&#12501;&#12449;&#12452;&#12523;&#12399;&#12518;&#12540;&#12470;&#12398;&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#20316;&#25104;&#12373;&#12428;&#12427;&#38560;&#12375;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522; <code class="filename">.thumbnails</code> &#12395;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p><strong class="application"><code>Thunar</code></strong> &#12364;&#25552;&#20379;&#12377;&#12427;&#22522;&#26412;&#12469;&#12512;&#12493;&#12452;&#12523;&#27231;&#33021;&#12434;&#25313;&#24373;&#12375;&#12289;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12434;&#36861;&#21152;&#12375;&#12383;&#12356;&#22580;&#21512;&#12399; <a class="xref" href="customizing-thunar.html#thumbnailers" title="&#12469;&#12512;&#12493;&#12452;&#12521;">&#12469;&#12512;&#12493;&#12452;&#12521;&#38917;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#25991;&#23383;&#12434;&#12450;&#12452;&#12467;&#12531;&#12398;&#38563;&#12395;&#32622;&#12367;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12450;&#12452;&#12467;&#12531;&#34920;&#31034;&#26178;&#12395;&#12450;&#12452;&#12486;&#12512;&#12398;&#12450;&#12452;&#12467;&#12531;&#12398;&#12461;&#12515;&#12503;&#12471;&#12519;&#12531;&#12364;&#12450;&#12452;&#12467;&#12531;&#12398;&#19979;&#12391;&#12399;&#12394;&#12367;&#12289;&#38563;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p></dd></dl></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="preferences-side-pane"></a>&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12398;&#35373;&#23450;</h3></div></div></div><p>&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12506;&#12452;&#12531;&#12362;&#12424;&#12403;&#12484;&#12522;&#12540;&#12506;&#12452;&#12531;&#12398;&#34920;&#31034;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/preferences-side-pane.png" alt="&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12398;&#35373;&#23450;"></div></div><p>&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12395;&#12399;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12501;&#12457;&#12523;&#12480;&#12408;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12398;&#12522;&#12473;&#12488;&#12398;&#34920;&#31034; (&#12487;&#12501;&#12457;&#12523;&#12488;) &#12363;&#12289;&#12414;&#12383;&#12399;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12434;&#12484;&#12522;&#12540;&#34920;&#31034;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12506;&#12540;&#12472;&#12391;&#12399;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12362;&#12424;&#12403;&#12484;&#12522;&#12540;&#12506;&#12452;&#12531;&#12398;&#12450;&#12452;&#12467;&#12531;&#12398;&#12469;&#12452;&#12474;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12450;&#12452;&#12467;&#12531;&#12395;&#12471;&#12531;&#12508;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12418;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;</p><div class="variablelist"><dl><dt><span class="term"><span class="guilabel"><strong>&#12450;&#12452;&#12467;&#12531;&#12398;&#12469;&#12452;&#12474;</strong></span></span></dt><dd><p>&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12395;&#34920;&#31034;&#12377;&#12427;&#12450;&#12452;&#12467;&#12531;&#12398;&#12469;&#12452;&#12474;&#12434;&#12289;<span class="guilabel"><strong>&#12300;&#12392;&#12390;&#12418;&#23567;&#12373;&#12356;&#12301;</strong></span> (16×16&#12500;&#12463;&#12475;&#12523;) &#12363;&#12425; <span class="guilabel"><strong>&#12300;&#12392;&#12390;&#12418;&#22823;&#12365;&#12356;&#12301;</strong></span> (128×128&#12500;&#12463;&#12475;&#12523;) &#12398;&#38291;&#12391;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#12450;&#12452;&#12467;&#12531;&#12398;&#12471;&#12531;&#12508;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12398;&#12501;&#12457;&#12523;&#12480;&#12395;&#12471;&#12531;&#12508;&#12523;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12501;&#12457;&#12523;&#12480;&#12398;&#12471;&#12531;&#12508;&#12523;&#12399;&#12501;&#12457;&#12523;&#12480;&#12398; <span class="guilabel"><strong>&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;</strong></span> &#12480;&#12452;&#12450;&#12525;&#12464;&#12391;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12513;&#12452;&#12531;&#12456;&#12522;&#12450;&#12391;&#12501;&#12457;&#12523;&#12480;&#12434;&#36984;&#25246;&#12375;&#12289;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12501;&#12457;&#12523;&#12480;&#12398;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenuitem"><strong>&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></dd></dl></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="preferences-behavior"></a>&#25391;&#12427;&#33310;&#12356;&#12398;&#35373;&#23450;</h3></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/preferences-behavior.png" alt="&#25391;&#12427;&#33310;&#12356;&#12398;&#35373;&#23450;"></div></div><div class="variablelist"><dl><dt><span class="term"><span class="guilabel"><strong>&#12471;&#12531;&#12464;&#12523;&#12463;&#12522;&#12483;&#12463;&#12391;&#12450;&#12452;&#12486;&#12512;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12377;&#12427;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12450;&#12452;&#12486;&#12512;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#12384;&#12369;&#12391;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#19978;&#12395;&#12510;&#12454;&#12473;&#12509;&#12452;&#12531;&#12479;&#12434;&#31227;&#21205;&#12373;&#12379;&#12427;&#12392;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#12479;&#12452;&#12488;&#12523;&#12395;&#19979;&#32218;&#12364;&#34920;&#31034;&#12373;&#12428;&#12289;&#23569;&#12375;&#36933;&#12428;&#12390;&#33258;&#21205;&#30340;&#12395;&#36984;&#25246;&#29366;&#24907;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p><p>&#12371;&#12398;&#36984;&#25246;&#29366;&#24907;&#12395;&#12394;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;&#12399;&#12381;&#12398;&#19979;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#35373;&#23450;&#12391;&#12365;&#12289;&#12475;&#12524;&#12463;&#12479;&#12434;&#19968;&#30058;&#24038;&#12395;&#20301;&#32622;&#12377;&#12427;&#12392;&#12450;&#12452;&#12486;&#12512;&#12398;&#33258;&#21205;&#36984;&#25246;&#12399;&#34892;&#12431;&#12428;&#12414;&#12379;&#12435;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12391;&#12450;&#12452;&#12486;&#12512;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12377;&#12427;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12450;&#12452;&#12486;&#12512;&#12434;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#12392;&#12365;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#23455;&#34892;&#12373;&#12428;&#12289;&#12471;&#12531;&#12464;&#12523;&#12463;&#12522;&#12483;&#12463;&#12391;&#36984;&#25246;&#29366;&#24907;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p></dd></dl></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="preferences-advanced"></a>&#35443;&#32048;&#12398;&#35373;&#23450;</h3></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#35443;&#32048;&#12394;&#27231;&#33021;&#12398;&#35373;&#23450;&#12434;&#34892;&#12360;&#12414;&#12377;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/preferences-advanced.png" alt="&#35443;&#32048;&#12398;&#35373;&#23450;"></div></div><div class="variablelist"><dl><dt><span class="term"><span class="guilabel"><strong>&#12501;&#12457;&#12523;&#12480;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;</strong></span></span></dt><dd><p>&#12501;&#12457;&#12523;&#12480;&#12398; <span class="guilabel"><strong>&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;</strong></span> &#12480;&#12452;&#12450;&#12525;&#12464;&#12391;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#22793;&#26356;&#12375;&#12383;&#12392;&#12365;&#12398;&#21205;&#20316;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12501;&#12457;&#12523;&#12480;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395; <strong class="application"><code>Thunar</code></strong> &#12364;&#27598;&#22238;&#21839;&#12356;&#21512;&#12431;&#12379;&#12427;&#12363;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26032;&#12375;&#12356;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#12501;&#12457;&#12523;&#12480;&#12398;&#12415;&#12395;&#36969;&#29992;&#12377;&#12427;&#12363;&#12289;&#12373;&#12425;&#12395;&#12501;&#12457;&#12523;&#12480;&#20869;&#12398;&#12450;&#12452;&#12486;&#12512;&#12395;&#12414;&#12391;&#20877;&#24112;&#30340;&#12395;&#36969;&#29992;&#12377;&#12427;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#12508;&#12522;&#12517;&#12540;&#12512;&#31649;&#29702;</strong></span></span></dt><dd><p><strong class="application"><code>Thunar</code></strong> &#12434; HAL &#12469;&#12509;&#12540;&#12488;&#20184;&#12365;&#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12289;&#12363;&#12388; <strong class="application"><code>thunar-volman</code></strong> &#12497;&#12483;&#12465;&#12540;&#12472;&#12418;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#32113;&#21512;&#12508;&#12522;&#12517;&#12540;&#12512;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#26377;&#21177;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#27231;&#33021;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="xref" href="using-removable-media.html#management-of-removable-drives-and-media" title="&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12392;&#12513;&#12487;&#12451;&#12450;&#12398;&#31649;&#29702;">&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12392;&#12513;&#12487;&#12451;&#12450;&#12398;&#31649;&#29702;&#38917;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></dd></dl></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="using-removable-media.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="customizing-thunar.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#20351;&#29992; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> Thunar &#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;</td></tr></table></div></body></html>
