<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12454;&#12451;&#12531;&#12489;&#12454;</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="up" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="prev" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="next" href="working-with-files-and-folders.html" title="&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#25805;&#20316;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12454;&#12451;&#12531;&#12489;&#12454;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="working-with-files-and-folders.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="the-file-manager-window"></a>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12454;&#12451;&#12531;&#12489;&#12454;</h2></div></div></div><p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12454;&#12451;&#12531;&#12489;&#12454;&#12395;&#12399;&#24038;&#12395;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12506;&#12452;&#12531;&#12289;&#21491;&#12395;&#12513;&#12452;&#12531;&#12456;&#12522;&#12450;&#12289;&#12381;&#12375;&#12390;&#12513;&#12452;&#12531;&#12456;&#12522;&#12450;&#12398;&#19978;&#12395;&#12497;&#12473;&#12508;&#12479;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/file-manager-window.png" alt="&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12454;&#12451;&#12531;&#12489;&#12454;"></div></div><p><span class="guilabel"><strong>&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12506;&#12452;&#12531;</strong></span> &#12395;&#12399;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12356;&#12429;&#12356;&#12429;&#12394;&#12501;&#12457;&#12523;&#12480;&#12408;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#20808;&#38957;&#12395;&#12354;&#12427;&#12398;&#12399;&#12354;&#12394;&#12383;&#12398; <span class="emphasis"><em>&#12507;&#12540;&#12512;&#12501;&#12457;&#12523;&#12480;</em></span> &#12408;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12391;&#12289;&#12371;&#12398;&#12501;&#12457;&#12523;&#12480;&#12395;&#12399;&#12354;&#12394;&#12383;&#12398;&#20491;&#20154;&#12487;&#12540;&#12479;&#12398;&#12377;&#12409;&#12390;&#12364;&#26684;&#32013;&#12373;&#12428;&#12289;&#12518;&#12540;&#12470;&#12398;&#21517;&#21069;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;2 &#30058;&#30446;&#12399;&#12399;&#12468;&#12511;&#31665;&#12408;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12391;&#12289;&#21066;&#38500;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12364;&#26684;&#32013;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12354;&#12392;&#12391;&#24489;&#20803;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;3 &#30058;&#30446;&#12399; <span class="emphasis"><em>&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12501;&#12457;&#12523;&#12480;</em></span> &#12408;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12391;&#12289;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12364;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;4 &#30058;&#30446;&#12399;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#12523;&#12540;&#12488;&#12408;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12391;&#12377; &#8722; &#12354;&#12394;&#12383;&#12364; Linux/Unix &#12395;&#12414;&#12384;&#24931;&#12428;&#12390;&#12356;&#12394;&#12356;&#12394;&#12425;&#12354;&#12394;&#12383;&#12434;&#23569;&#12293;&#28151;&#20081;&#12373;&#12379;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;&#12381;&#12428;&#12391;&#12418;&#12371;&#12398;&#20013;&#12434;&#23569;&#12375;&#25506;&#26908;&#12375;&#12390;&#12415;&#12383;&#12367;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12385;&#12423;&#12387;&#12392;&#12384;&#12369;&#12356;&#12429;&#12356;&#12429;&#12394;&#12501;&#12457;&#12523;&#12480;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#20013;&#12395;&#20309;&#12364;&#20837;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#35211;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p><span class="emphasis"><em>&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;</em></span> &#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12398;&#19979;&#12395;&#12399;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12420;&#12513;&#12487;&#12451;&#12450;&#12364;&#12354;&#12428;&#12400;&#12381;&#12428;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#19978;&#12398;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;&#12391;&#12399; <span class="guilabel"><strong>CD-ROM</strong></span> &#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12362;&#12424;&#12403;&#12513;&#12487;&#12451;&#12450;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12487;&#12540;&#12479;&#12408;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#22580;&#21512;&#12399;&#12371;&#12428;&#12425;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12424;&#12426;&#35443;&#12375;&#12356;&#24773;&#22577;&#12395;&#12388;&#12356;&#12390;&#12399; <a class="xref" href="using-removable-media.html" title="&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#20351;&#29992;">&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#20351;&#29992;&#38917;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#12381;&#12398;&#20182;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12399;&#12518;&#12540;&#12470;&#23450;&#32681;&#12373;&#12428;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12398;&#36861;&#21152;&#12399;&#12501;&#12457;&#12523;&#12480;&#12434; <span class="guilabel"><strong>&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12506;&#12452;&#12531;</strong></span> &#12408;&#12489;&#12521;&#12483;&#12464;&#12377;&#12427;&#12384;&#12369;&#12391;&#34892;&#12360;&#12414;&#12377;&#12290;&#12371;&#12428;&#12391;&#12354;&#12394;&#12383;&#12364;&#22823;&#20107;&#12394;&#12501;&#12457;&#12523;&#12480;&#12408;&#21363;&#24231;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12377;&#12391;&#12395;&#36861;&#21152;&#12373;&#12428;&#12390;&#12356;&#12427;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;<span class="guimenuitem"><strong>&#12300;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12398;&#21066;&#38500;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12377;&#12391;&#12395;&#36861;&#21152;&#12373;&#12428;&#12390;&#12356;&#12427;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12398;&#21517;&#21069;&#12398;&#22793;&#26356;&#12399;&#12289;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;<span class="guimenuitem"><strong>&#12300;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#21517;&#12398;&#22793;&#26356;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12428;&#12425;&#12398;&#25805;&#20316;&#12399;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12289;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12364;&#21442;&#29031;&#12375;&#12390;&#12356;&#12427;&#23455;&#38555;&#12398;&#12501;&#12457;&#12523;&#12480;&#12395;&#12399;&#24433;&#38911;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p><span class="emphasis"><em>&#12513;&#12452;&#12531;&#12456;&#12522;&#12450;</em></span> &#12395;&#12399;&#24120;&#12395;&#12459;&#12524;&#12531;&#12488;&#12501;&#12457;&#12523;&#12480;&#12398;&#20869;&#23481;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12501;&#12457;&#12523;&#12480;&#12434;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12381;&#12398;&#20013;&#12408;&#31227;&#21205;&#12375;&#12289;&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12381;&#12398;&#12450;&#12452;&#12486;&#12512;&#12395;&#23550;&#12375;&#12390;&#34892;&#12360;&#12427;&#25805;&#20316;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12377;&#12427;&#22580;&#21512;&#12399;&#12510;&#12454;&#12473;&#12391;&#12381;&#12428;&#12425;&#12434;&#12489;&#12521;&#12483;&#12464;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12414;&#12383;&#12289;&#19968;&#12388;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12289;<span class="keycap"><strong>Shift</strong></span> &#12461;&#12540;&#12434;&#25276;&#12375;&#12394;&#12364;&#12425;&#30690;&#21360;&#12461;&#12540;&#12434;&#25276;&#12377;&#12392;&#36984;&#25246;&#31684;&#22258;&#12434;&#35519;&#25972;&#12391;&#12365;&#12414;&#12377;&#12290;</p><p><span class="emphasis"><em>&#12497;&#12473;&#12508;&#12479;&#12531;</em></span> &#12395;&#12399;&#24120;&#12395;&#29694;&#22312;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12457;&#12523;&#12480;&#12408;&#12398;&#12497;&#12473;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12497;&#12473;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12391;&#12381;&#12398;&#12501;&#12457;&#12523;&#12480;&#12408;&#31227;&#21205;&#12391;&#12365;&#12414;&#12377;&#12290;&#12497;&#12473;&#12508;&#12479;&#12531;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12356;&#12367;&#12388;&#12363;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="customizing-the-appearance"></a>&#22806;&#35251;&#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;</h3></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#22806;&#35251;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#26041;&#27861;&#12399;&#12383;&#12367;&#12373;&#12435;&#12354;&#12426;&#12414;&#12377;&#12290;&#12450;&#12452;&#12467;&#12531;&#34920;&#31034;&#12364;&#12362;&#27671;&#12395;&#21484;&#12373;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#12289;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#34920;&#31034;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#35443;&#32048;&#12522;&#12473;&#12488;&#34920;&#31034;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12459;&#12524;&#12531;&#12488;&#12501;&#12457;&#12523;&#12480;&#12398;&#20869;&#23481;&#12364;&#12522;&#12473;&#12488;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12454;&#12451;&#12531;&#12489;&#12454;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12497;&#12473;&#12508;&#12479;&#12531;&#12398;&#20195;&#12431;&#12426;&#12395;&#12525;&#12465;&#12540;&#12471;&#12519;&#12531;&#12496;&#12540;&#12434;&#34920;&#31034;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#34920;&#31034;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#20301;&#32622;&#12475;&#12524;&#12463;&#12479;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#12484;&#12540;&#12523;&#12496;&#12540;&#26041;&#24335;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#24038;&#12398;&#12506;&#12452;&#12531;&#12399;&#12484;&#12522;&#12540;&#34920;&#31034;&#12364;&#12362;&#22909;&#12415;&#12394;&#12425;&#12289;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#34920;&#31034;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#12484;&#12522;&#12540;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="visible-columns-in-the-detailed-list-view"></a>&#35443;&#32048;&#12522;&#12473;&#12488;&#34920;&#31034;&#12391;&#12398;&#34920;&#31034;&#12459;&#12521;&#12512;</h4></div></div></div><p>&#12354;&#12394;&#12383;&#12364;&#12501;&#12457;&#12523;&#12480;&#12398;&#20869;&#23481;&#12434;&#12522;&#12473;&#12488;&#34920;&#31034;&#12377;&#12427;&#12398;&#12364;&#12362;&#22909;&#12415;&#12391;&#12289;<span class="guilabel"><strong>&#12300;&#35443;&#32048;&#12522;&#12473;&#12488;&#34920;&#31034;&#12301;</strong></span> &#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12522;&#12473;&#12488;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12459;&#12521;&#12512;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#34920;&#31034;&#12377;&#12427;&#12459;&#12521;&#12512;&#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12399;&#12289;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#34920;&#31034;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#12459;&#12521;&#12512;&#12398;&#35373;&#23450;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/visible-columns.png" alt="&#34920;&#31034;&#12459;&#12521;&#12512;"></div></div><div class="variablelist"><dl><dt><span class="term"><span class="guilabel"><strong>&#34920;&#31034;&#12459;&#12521;&#12512;</strong></span></span></dt><dd><p>&#34920;&#31034;&#21487;&#33021;&#12394;&#12459;&#12521;&#12512;&#12398;&#12522;&#12473;&#12488;&#12363;&#12425;&#34920;&#31034;&#12375;&#12383;&#12356;&#12459;&#12521;&#12512;&#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<span class="guibutton"><strong>&#12300;&#19978;&#12395;&#31227;&#21205;&#12301;</strong></span>&#12420;<span class="guibutton"><strong>&#12300;&#19979;&#12395;&#31227;&#21205;&#12301;</strong></span> &#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12459;&#12521;&#12512;&#12398;&#34920;&#31034;&#38918;&#12434;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;<span class="guibutton"><strong>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12395;&#25147;&#12377;&#12301;</strong></span> &#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#22793;&#26356;&#12399;&#21462;&#12426;&#28040;&#12373;&#12428;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#12459;&#12521;&#12512;&#12398;&#12469;&#12452;&#12474;&#22793;&#26356;</strong></span></span></dt><dd><p><span class="guibutton"><strong>&#12300;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12459;&#12521;&#12512;&#12434;&#33258;&#21205;&#30340;&#12395;&#25313;&#12370;&#12427;&#12301;</strong></span> &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12459;&#12521;&#12512;&#12398;&#24133;&#12399;&#25991;&#23383;&#20840;&#20307;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#33258;&#21205;&#30340;&#12395;&#25313;&#12370;&#12425;&#12428;&#12414;&#12377;&#12290;</p></dd></dl></div></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="working-with-files-and-folders.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#25805;&#20316;</td></tr></table></div></body></html>
