<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#20351;&#29992;</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="up" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="prev" href="working-with-files-and-folders.html" title="&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#25805;&#20316;"><link rel="next" href="preferences.html" title="&#12501;&#12449;&#12452;&#12523;&#31649;&#29702;&#12398;&#35373;&#23450;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#20351;&#29992;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="working-with-files-and-folders.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="preferences.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="using-removable-media"></a>&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#20351;&#29992;</h2></div></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="accessing-removable-media"></a>&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;</h3></div></div></div><p>Thunar &#12399;&#12289;<a class="ulink" href="http://freedesktop.org/wiki/Software_2fhal" target="_top">HAL</a> &#12469;&#12509;&#12540;&#12488;&#20184;&#12365;&#12391;&#12499;&#12523;&#12489;&#12375;&#12383;&#12363;&#12289;<a class="ulink" href="http://www.freebsd.org/" target="_top">FreeBSD</a> &#12391;&#20351;&#29992;&#12375;&#12390;&#12356;&#12428;&#12400;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="to-mount-media"></a>&#12513;&#12487;&#12451;&#12450;&#12398;&#12510;&#12454;&#12531;&#12488;</h4></div></div></div><p>&#12513;&#12487;&#12451;&#12450;&#12398; <span class="emphasis"><em>&#12510;&#12454;&#12531;&#12488;</em></span> &#12392;&#12399;&#12289;&#12513;&#12487;&#12451;&#12450;&#12398;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12434;&#20316;&#25104;&#12375;&#12289;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12513;&#12487;&#12451;&#12450;&#12434;&#12510;&#12454;&#12531;&#12488;&#12375;&#12383;&#12392;&#12365;&#12289;&#12513;&#12487;&#12451;&#12450;&#12398;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12364;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#12469;&#12502;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12450;&#12479;&#12483;&#12481;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#12513;&#12487;&#12451;&#12450;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#36969;&#20999;&#12394;&#12487;&#12496;&#12452;&#12473;&#12395;&#12513;&#12487;&#12451;&#12450;&#12434;&#25407;&#20837;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12395;&#26032;&#12375;&#12356;&#12487;&#12496;&#12452;&#12473;&#12434;&#25509;&#32154;&#12375;&#12414;&#12377; (&#20363;: USB &#12473;&#12486;&#12451;&#12483;&#12463;&#12434; USB &#12509;&#12540;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;)&#12290;&#12377;&#12427;&#12392;&#12289;&#12513;&#12487;&#12451;&#12450;&#12434;&#34920;&#12377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;<strong class="application"><code>xfdesktop</code></strong> &#12364;&#21205;&#20316;&#12375;&#12390;&#12362;&#12426;&#12289;<span class="guilabel"><strong>&#12501;&#12449;&#12452;&#12523;/&#12521;&#12531;&#12481;&#12515;&#12450;&#12452;&#12467;&#12531;</strong></span> &#12434;&#34920;&#31034;&#12377;&#12427;&#35373;&#23450;&#12395;&#12375;&#12390;&#12354;&#12428;&#12400;&#12289;&#12371;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12395;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#23455;&#38555;&#12395;&#12513;&#12487;&#12451;&#12450;&#12434;&#12510;&#12454;&#12531;&#12488;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12513;&#12487;&#12451;&#12450;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12501;&#12525;&#12483;&#12500;&#12540;&#12487;&#12451;&#12473;&#12463;&#12434;&#12510;&#12454;&#12531;&#12488;&#12377;&#12427;&#22580;&#21512;&#12289;&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12398; <span class="guilabel"><strong>&#12501;&#12525;&#12483;&#12500;&#12540;&#12489;&#12521;&#12452;&#12502;</strong></span> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12399;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12498;&#12456;&#12521;&#12523;&#12461;&#12540;&#12395;&#12513;&#12487;&#12451;&#12450;&#12398;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12434;&#36861;&#21152;&#12375;&#12289;&#12513;&#12452;&#12531;&#12456;&#12522;&#12450;&#12395;&#12501;&#12525;&#12483;&#12500;&#12540;&#12487;&#12451;&#12473;&#12463;&#12398;&#20869;&#23481;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="to-eject-media"></a>&#12513;&#12487;&#12451;&#12450;&#12398;&#21462;&#12426;&#20986;&#12375;</h4></div></div></div><p>&#12513;&#12487;&#12451;&#12450;&#12398;&#12489;&#12521;&#12452;&#12502;&#12364;&#33258;&#21205;&#25490;&#20986;&#21487;&#33021;&#12394;&#12487;&#12496;&#12452;&#12473; (&#20363;: CD-ROM &#12489;&#12521;&#12452;&#12502;) &#12394;&#12425;&#12400;&#12289;&#12469;&#12452;&#12489;&#12506;&#12452;&#12531;&#12414;&#12383;&#12399;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12395;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12513;&#12487;&#12451;&#12450;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;<span class="guilabel"><strong>&#12300;&#21462;&#12426;&#20986;&#12375;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#25968;&#31186;&#24460;&#12395;&#12489;&#12521;&#12452;&#12502;&#12363;&#12425;&#12513;&#12487;&#12451;&#12450;&#12364;&#25490;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12513;&#12487;&#12451;&#12450;&#12398;&#12489;&#12521;&#12452;&#12502;&#12364;&#33258;&#21205;&#25490;&#20986;&#12375;&#12394;&#12356;&#22580;&#21512; (&#20363;: &#12501;&#12525;&#12483;&#12500;&#12540;&#12489;&#12521;&#12452;&#12502;&#12420; USB &#12473;&#12486;&#12451;&#12483;&#12463;) &#12399;&#12513;&#12487;&#12451;&#12450;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;<span class="guilabel"><strong>&#12300;&#12510;&#12454;&#12531;&#12488;&#35299;&#38500;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#38291;&#12418;&#12394;&#12367;&#23433;&#20840;&#12395;&#12513;&#12487;&#12451;&#12450;&#12434;&#21462;&#12426;&#20986;&#12379;&#12427;&#12289;&#12414;&#12383;&#12399;&#12489;&#12521;&#12452;&#12502;&#12434;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12363;&#12425;&#21462;&#12426;&#22806;&#12375;&#12390;&#12424;&#12356;&#26088;&#12398;&#36890;&#30693;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/removable-media-unmount.png" alt="&#12510;&#12454;&#12531;&#12488;&#35299;&#38500;&#36890;&#30693;"></div></div><p>&#12383;&#12384;&#12375;&#12289;&#12371;&#12398;&#36890;&#30693;&#12399; <strong class="application"><code>libnotify</code></strong> &#12469;&#12509;&#12540;&#12488;&#12364;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12289;&#12363;&#12388;&#36890;&#30693;&#12487;&#12540;&#12514;&#12531;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;Xfce &#29992;&#36890;&#30693;&#12487;&#12540;&#12514;&#12531;&#12399; <a class="ulink" href="http://goodies.xfce.org/projects/applications/notification-daemon-xfce" target="_top">Xfce Goodies Project</a> &#12363;&#12425;&#20837;&#25163;&#12391;&#12365;&#12414;&#12377;&#12290;&#36890;&#30693;&#12469;&#12509;&#12540;&#12488;&#12364;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12398;&#34920;&#31034;&#12364;&#28040;&#12360;&#12390;&#12363;&#12425;&#12513;&#12487;&#12451;&#12450;&#12434;&#21462;&#12426;&#20986;&#12377;&#12363;&#12489;&#12521;&#12452;&#12502;&#12434;&#21462;&#12426;&#22806;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#19968;&#12388;&#20197;&#19978;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12513;&#12487;&#12451;&#12450;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#38291;&#12399;&#12513;&#12487;&#12451;&#12450;&#12398;&#21462;&#12426;&#20986;&#12375;&#12420;&#12510;&#12454;&#12531;&#12488;&#35299;&#38500;&#12399;&#34892;&#12360;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12364;&#12513;&#12487;&#12451;&#12450;&#12398;&#21462;&#12426;&#20986;&#12375;&#12434;&#25298;&#12435;&#12384;&#22580;&#21512;&#12399;&#12289;&#12513;&#12487;&#12451;&#12450;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#21205;&#20316;&#12375;&#12390;&#12356;&#12394;&#12356;&#12363;&#12289;<strong class="application"><code>Terminal</code></strong> &#12454;&#12451;&#12531;&#12489;&#12454;&#12391;&#21205;&#20316;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#21547;&#12417;&#12390;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#24517;&#12378;&#12513;&#12487;&#12451;&#12450;&#12434;&#21462;&#12426;&#20986;&#12377;&#21069;&#12395;&#12510;&#12454;&#12531;&#12488;&#35299;&#38500;&#12434;&#34892;&#12358;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12501;&#12525;&#12483;&#12500;&#12540;&#12487;&#12451;&#12473;&#12463;&#12434;&#12510;&#12454;&#12531;&#12488;&#35299;&#38500;&#12377;&#12427;&#21069;&#12395;&#12501;&#12525;&#12483;&#12500;&#12540;&#12489;&#12521;&#12452;&#12502;&#12363;&#12425;&#21462;&#12426;&#20986;&#12373;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;USB &#12473;&#12486;&#12451;&#12483;&#12463;&#12434;&#12510;&#12454;&#12531;&#12488;&#35299;&#38500;&#12377;&#12427;&#21069;&#12395;&#12501;&#12521;&#12483;&#12471;&#12517;&#12489;&#12521;&#12452;&#12502;&#12363;&#12425;&#21462;&#12426;&#22806;&#12373;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#20808;&#12395;&#12510;&#12454;&#12531;&#12488;&#35299;&#38500;&#12375;&#12390;&#12362;&#12363;&#12394;&#12356;&#12392;&#12289;&#12487;&#12540;&#12479;&#12434;&#22833;&#12387;&#12383;&#12426;&#12289;&#12471;&#12473;&#12486;&#12512;&#12463;&#12521;&#12483;&#12471;&#12517;&#12434;&#24341;&#12365;&#36215;&#12371;&#12375;&#12383;&#12426;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;</p></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="management-of-removable-drives-and-media"></a>&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12392;&#12513;&#12487;&#12451;&#12450;&#12398;&#31649;&#29702;</h3></div></div></div><p>Thunar &#12399; <a class="ulink" href="http://www.foo-projects.org/~benny/projects/thunar-volman/index.html" target="_top">thunar-volman</a> &#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12392;&#12513;&#12487;&#12451;&#12450;&#12398;&#21462;&#25201;&#12356;&#12418;&#33258;&#21205;&#12391;&#34892;&#12360;&#12414;&#12377;&#12290;</p><p>HAL &#12469;&#12509;&#12540;&#12488;&#12364;&#26377;&#21177;&#12391;&#12289;&#12363;&#12388; <strong class="application"><code>thunar-volman</code></strong> &#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;Thunar &#12398; <span class="guilabel"><strong>&#12508;&#12522;&#12517;&#12540;&#12512;&#31649;&#29702;</strong></span> &#27231;&#33021;&#12434;&#26377;&#21177;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#35373;&#23450;&#12434;&#38283;&#12365;&#12289;<span class="guilabel"><strong>&#12300;&#35443;&#32048;&#12301;</strong></span> &#12506;&#12540;&#12472;&#12398; <span class="guilabel"><strong>&#12300;&#12508;&#12522;&#12517;&#12540;&#12512;&#31649;&#29702;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12301;</strong></span> &#12508;&#12479;&#12531;&#12395;&#12481;&#12455;&#12483;&#12463;&#12510;&#12540;&#12463;&#12434;&#12388;&#12369;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#27425;&#12395;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12392;&#12513;&#12487;&#12451;&#12450;&#12398;&#21462;&#25201;&#12356;&#12434;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12375;&#12414;&#12377;&#12290;<span class="guilabel"><strong>&#12300;&#12508;&#12522;&#12517;&#12540;&#12512;&#31649;&#29702;&#12301;</strong></span> &#12475;&#12463;&#12471;&#12519;&#12531;&#12398;&#12508;&#12479;&#12531;&#12398;&#21491;&#19979;&#12395;&#12354;&#12427; <span class="guilabel"><strong>&#12300;&#35373;&#23450;&#12301;</strong></span> &#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<span class="guilabel"><strong>&#12300;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12392;&#12513;&#12487;&#12451;&#12450;&#12301;</strong></span> &#35373;&#23450;&#12480;&#12452;&#12450;&#12525;&#12464;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><div class="screenshot"><div class="mediaobject"><img src="images/removable-drives-and-media.png" alt="&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12392;&#12513;&#12487;&#12451;&#12450;"></div></div><p>&#12354;&#12394;&#12383;&#12364;&#20197;&#21069;&#12395; <strong class="application"><code>gnome-volume-manager</code></strong> &#12434;&#20351;&#29992;&#12375;&#12383;&#12371;&#12392;&#12364;&#12354;&#12428;&#12400;&#12289;&#12377;&#12368;&#12395;&#12394;&#12376;&#12417;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12371;&#12398;&#35211;&#12383;&#30446;&#12392;&#25391;&#12427;&#33310;&#12356;&#12399; <strong class="application"><code>gnome-volume-manager</code></strong> &#12395;&#20284;&#12379;&#12390;&#35373;&#35336;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;&#35373;&#23450;&#12399;&#12289;&#12487;&#12496;&#12452;&#12473;&#12395;&#23550;&#12377;&#12427;&#30446;&#30340;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#22580;&#25152;&#12364;&#12431;&#12363;&#12426;&#12420;&#12377;&#12356;&#12424;&#12358;&#12395;&#12487;&#12496;&#12452;&#12473;&#12398;&#12459;&#12486;&#12468;&#12522;&#12372;&#12392;&#12395;&#20998;&#12369;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><p><span class="guilabel"><strong>&#12300;&#12473;&#12488;&#12524;&#12540;&#12472;&#12301;</strong></span> &#12506;&#12540;&#12472;&#12395;&#12399;&#37325;&#35201;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12411;&#12392;&#12435;&#12393;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#21517;&#21069;&#12399;&#12371;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12289;&#22806;&#20184;&#12369;&#12495;&#12540;&#12489;&#12487;&#12451;&#12473;&#12463;&#12489;&#12521;&#12452;&#12502;&#12289;USB &#12473;&#12486;&#12451;&#12483;&#12463;&#12289;&#12354;&#12427;&#12356;&#12399; CD-ROM &#12398;&#12424;&#12358;&#12394;&#12473;&#12488;&#12524;&#12540;&#12472;&#12487;&#12496;&#12452;&#12473;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12427;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p><div class="variablelist"><dl><dt><span class="term"><span class="guilabel"><strong>&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12364;&#12507;&#12483;&#12488;&#12503;&#12521;&#12464;&#12373;&#12428;&#12383;&#12425;&#12510;&#12454;&#12531;&#12488;&#12377;&#12427;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502; (&#22806;&#20184;&#12369;&#12495;&#12540;&#12489;&#12487;&#12451;&#12473;&#12463;&#12489;&#12521;&#12452;&#12502;&#12420; USB &#12473;&#12486;&#12451;&#12483;&#12463;&#12394;&#12393;) &#12364;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12395;&#25509;&#32154;&#12373;&#12428;&#12383;&#12425;&#33258;&#21205;&#30340;&#12395;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12434;&#12510;&#12454;&#12531;&#12488;&#12375;&#12414;&#12377;&#12290;</p><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#19968;&#37096;&#12398;&#27231;&#33021;&#12434;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12395;&#23550;&#12375;&#12390;&#21205;&#20316;&#12373;&#12379;&#12427;&#38555;&#12395;&#26377;&#21177;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12289;&#12354;&#12427;&#31278;&#12398;&#25658;&#24111;&#38899;&#27005;&#12503;&#12524;&#12452;&#12516;&#12540;&#12399;&#26908;&#20986;&#12373;&#12428;&#12378;&#12289;<span class="guilabel"><strong>&#12300;&#12510;&#12523;&#12481;&#12513;&#12487;&#12451;&#12450;&#12301;</strong></span> &#12506;&#12540;&#12472;&#12398; <span class="guilabel"><strong>&#12300;&#25509;&#32154;&#12373;&#12428;&#12383;&#12425;&#38899;&#27005;&#12501;&#12449;&#12452;&#12523;&#12434;&#20877;&#29983;&#12377;&#12427;&#12301;</strong></span> &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12356;&#12390;&#12418;&#12289;&#25658;&#24111;&#38899;&#27005;&#12503;&#12524;&#12452;&#12516;&#12540;&#12364;&#12507;&#12483;&#12488;&#12503;&#12521;&#12464;&#12373;&#12428;&#12383;&#38555;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#12467;&#12510;&#12531;&#12489;&#12399;&#23455;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12364;&#25407;&#20837;&#12373;&#12428;&#12383;&#12425;&#12510;&#12454;&#12531;&#12488;&#12377;&#12427;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450; (CD-ROM &#12420; DVD &#12394;&#12393;) &#12364;&#12489;&#12521;&#12452;&#12502;&#12395;&#25407;&#20837;&#12373;&#12428;&#12427;&#12392;&#33258;&#21205;&#30340;&#12395;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12434;&#12510;&#12454;&#12531;&#12488;&#12375;&#12414;&#12377;&#12290;</p><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#19968;&#37096;&#12398;&#27231;&#33021;&#12434;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12395;&#23550;&#12375;&#12390;&#21205;&#20316;&#12373;&#12379;&#12427;&#38555;&#12395;&#26377;&#21177;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12289;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12364;&#33258;&#21205;&#23455;&#34892;&#21487;&#33021;&#12363;&#12393;&#12358;&#12363;&#26908;&#20986;&#12373;&#12428;&#12378;&#12289;<span class="guilabel"><strong>&#12300;&#26032;&#12375;&#12356;&#12489;&#12521;&#12452;&#12502;&#12362;&#12424;&#12403;&#12513;&#12487;&#12451;&#12450;&#19978;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#33258;&#21205;&#23455;&#34892;&#12377;&#12427;&#12301;</strong></span> &#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12395;&#23550;&#12375;&#12390;&#20316;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12364;&#25407;&#20837;&#12373;&#12428;&#12383;&#12425;&#21442;&#29031;&#12377;&#12427;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#26032;&#12375;&#12367;&#25407;&#20837;&#12373;&#12428;&#12383;&#12513;&#12487;&#12451;&#12450;&#12398;&#20869;&#23481;&#12364;&#33258;&#21205;&#30340;&#12395;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#20182;&#12395;&#23455;&#34892;&#12391;&#12365;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;&#20182;&#12398;&#23455;&#34892;&#12391;&#12365;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12395;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#20869;&#23481;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#26032;&#12375;&#12356;&#12489;&#12521;&#12452;&#12502;&#12362;&#12424;&#12403;&#12513;&#12487;&#12451;&#12450;&#19978;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#33258;&#21205;&#23455;&#34892;&#12377;&#12427;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#19968;&#37096;&#12398;&#12489;&#12521;&#12452;&#12502;&#12420;&#12513;&#12487;&#12451;&#12450;&#12398;&#33258;&#21205;&#23455;&#34892;&#27231;&#33021;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#33258;&#21205;&#23455;&#34892;&#12513;&#12459;&#12491;&#12474;&#12512;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399; <a class="ulink" href="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html" target="_top">Desktop Application Autostart Specification</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#24375;&#21270;&#12398;&#12383;&#12417;&#12289;&#24120;&#12395;&#33258;&#21205;&#23455;&#34892;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12398;&#30906;&#35469;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;</p><p>Windows &#20114;&#25563;&#12524;&#12452;&#12516; <a class="ulink" href="http://www.winehq.org/" target="_top">Wine</a> &#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#33258;&#21205;&#23455;&#34892;&#12513;&#12459;&#12491;&#12474;&#12512;&#12399; Wine &#12434;&#20351;&#29992;&#12375;&#12390; <code class="filename">autorun.exe</code> &#12501;&#12449;&#12452;&#12523;&#12418;&#23455;&#34892;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><span class="guilabel"><strong>&#26032;&#12375;&#12356;&#12489;&#12521;&#12452;&#12502;&#12362;&#12424;&#12403;&#12513;&#12487;&#12451;&#12450;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#33258;&#21205;&#30340;&#12395;&#38283;&#12367;</strong></span></span></dt><dd><p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#19968;&#37096;&#12398;&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12489;&#12521;&#12452;&#12502;&#12420;&#12513;&#12487;&#12451;&#12450;&#12398;&#33258;&#21205;&#12458;&#12540;&#12503;&#12531;&#27231;&#33021;&#12364;&#20351;&#29992;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#33258;&#21205;&#12458;&#12540;&#12503;&#12531;&#12513;&#12459;&#12491;&#12474;&#12512;&#12395;&#12388;&#12356;&#12390;&#12398;&#35443;&#32048;&#12399; <a class="ulink" href="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html" target="_top">Desktop Application Autostart Specification</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#24375;&#21270;&#12398;&#12383;&#12417;&#12289;&#24120;&#12395;&#33258;&#21205;&#30340;&#12395;&#38283;&#12367;&#12363;&#12393;&#12358;&#12363;&#12398;&#30906;&#35469;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;</p></dd></dl></div><p>&#27531;&#12426;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12354;&#12427;&#31278;&#12398;&#12513;&#12487;&#12451;&#12450;&#12364;&#12489;&#12521;&#12452;&#12502;&#12395;&#25407;&#20837;&#12373;&#12428;&#12383;&#12392;&#12365;&#12289;&#12414;&#12383;&#12399;&#12354;&#12427;&#31278;&#12398;&#22806;&#20184;&#12369;&#12487;&#12496;&#12452;&#12473;&#12364;&#25509;&#32154;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#25351;&#23450;&#12375;&#12383;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#12467;&#12510;&#12531;&#12489;&#12399; 3 &#31278;&#39006;&#12398;&#29305;&#27530;&#22793;&#25968;&#12364;&#20351;&#29992;&#12391;&#12365;&#12289;&#12467;&#12510;&#12531;&#12489;&#23455;&#34892;&#26178;&#12395;&#12381;&#12428;&#12382;&#12428;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;:</p><div class="variablelist"><dl><dt><span class="term"><code class="literal">%d</code></span></dt><dd><p>&#12467;&#12510;&#12531;&#12489;&#12395; <code class="literal">%d</code> &#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12289;&#12381;&#12428;&#12382;&#12428;&#12364;&#26032;&#12375;&#12367;&#36861;&#21152;&#12373;&#12428;&#12383;&#12487;&#12496;&#12452;&#12473;&#12398;&#12487;&#12496;&#12452;&#12473;&#12501;&#12449;&#12452;&#12523;&#12497;&#12473;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;USB &#12473;&#12486;&#12451;&#12483;&#12463;&#12364;&#25509;&#32154;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12487;&#12496;&#12452;&#12473;&#12501;&#12449;&#12452;&#12523;&#12497;&#12473;&#12399;  <code class="filename">/dev/da0s1</code> &#12420; <code class="filename">/dev/sda1</code> (&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#27083;&#25104;&#12395;&#12424;&#12426;&#22793;&#12431;&#12426;&#12414;&#12377;) &#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p><p>&#12487;&#12496;&#12452;&#12473;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#12487;&#12496;&#12452;&#12473;&#12501;&#12449;&#12452;&#12523;&#12364;&#12394;&#12363;&#12387;&#12383;&#12426;&#12289;&#20309;&#12425;&#12363;&#12398;&#29702;&#30001;&#12391;&#12487;&#12496;&#12452;&#12473;&#12501;&#12449;&#12452;&#12523;&#12364;&#35211;&#12388;&#12369;&#12425;&#12428;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#22793;&#25968; <code class="literal">%d</code> &#12399;&#31354;&#12398;&#25991;&#23383;&#21015;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><code class="literal">%h</code></span></dt><dd><p>&#12467;&#12510;&#12531;&#12489;&#12395; <code class="literal">%h</code> &#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12289;&#12381;&#12428;&#12382;&#12428;&#26032;&#12375;&#12367;&#36861;&#21152;&#12373;&#12428;&#12383;&#12487;&#12496;&#12452;&#12473;&#12398; HAL UDI &#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><code class="literal">%m</code></span></dt><dd><p>&#12467;&#12510;&#12531;&#12489;&#12395; <code class="literal">%m</code> &#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12289;&#12381;&#12428;&#12382;&#12428;&#26032;&#12375;&#12367;&#36861;&#21152;&#12373;&#12428;&#12383;&#12487;&#12496;&#12452;&#12473;&#12364;&#12510;&#12454;&#12531;&#12488;&#12373;&#12428;&#12383;&#12510;&#12454;&#12531;&#12488;&#12509;&#12452;&#12531;&#12488;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;&#12510;&#12454;&#12531;&#12488;&#12391;&#12365;&#12394;&#12356;&#12487;&#12496;&#12452;&#12473; (&#12503;&#12522;&#12531;&#12479;&#12420;&#12461;&#12540;&#12508;&#12540;&#12489;&#12394;&#12393;) &#12420;&#33258;&#21205;&#12510;&#12454;&#12531;&#12488;&#12364;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399; <code class="literal">%m</code> &#12399;&#31354;&#12398;&#25991;&#23383;&#21015;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;</p></dd></dl></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="troubleshooting-the-volume-manager"></a>&#12508;&#12522;&#12517;&#12540;&#12512;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#12488;&#12521;&#12502;&#12523;&#12471;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;</h4></div></div></div><p>&#12508;&#12522;&#12517;&#12540;&#12512;&#12510;&#12493;&#12540;&#12472;&#12515;&#12364;&#26399;&#24453;&#36890;&#12426;&#12395;&#21205;&#20316;&#12375;&#12394;&#12356;&#26178;&#12398;&#12488;&#12521;&#12502;&#12523;&#35299;&#27770;&#12395;&#24441;&#31435;&#12388; Tips &#12391;&#12377;&#12290;</p><div class="orderedlist"><ol type="1"><li><p><strong class="application"><code>Thunar</code></strong> &#12364;&#12487;&#12540;&#12514;&#12531;&#12514;&#12540;&#12489;&#12391;&#21205;&#20316;&#12375;&#12390;&#12356;&#12427;&#12363;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12508;&#12522;&#12517;&#12540;&#12512;&#12510;&#12493;&#12540;&#12472;&#12515;&#12399; <strong class="application"><code>Thunar</code></strong> &#12487;&#12540;&#12514;&#12531;&#12391;&#21205;&#20316;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399; Xfce &#12399;&#36215;&#21205;&#26178;&#12395; <strong class="application"><code>Thunar</code></strong> &#12434;&#33258;&#21205;&#30340;&#12395;&#12487;&#12540;&#12514;&#12531;&#12392;&#12375;&#12390;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;&#12394;&#12435;&#12425;&#12363;&#12398;&#29702;&#30001;&#12391;&#12371;&#12428;&#12434; kill &#12375;&#12390;&#12356;&#12383;&#22580;&#21512;&#12399;&#12289;<span class="guilabel"><strong>&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#23455;&#34892;</strong></span>&#12434;&#38283;&#12365; (&#12461;&#12540;&#12508;&#12540;&#12489;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12398; <span class="keycap"><strong>Alt</strong></span>+<span class="keycap"><strong>F2</strong></span> &#12434;&#20351;&#29992;&#12377;&#12427;&#12363;&#12289;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guilabel"><strong>&#12300;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#23455;&#34892;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;)&#12289; <code class="literal">Thunar --daemon</code> &#12392;&#20837;&#21147;&#12375;&#12390; <span class="guibutton"><strong>&#12300;&#23455;&#34892;&#12301;</strong></span> &#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p></li><li><p>&#12487;&#12496;&#12452;&#12473;&#12434;&#12507;&#12483;&#12488;&#12503;&#12521;&#12464;&#12414;&#12383;&#12399;&#12513;&#12487;&#12451;&#12450;&#12434;&#25407;&#20837;&#12375;&#12383;&#12354;&#12392;&#12395; <strong class="application"><code>thunar-volman</code></strong> &#12434; <strong class="application"><code>Terminal</code></strong> &#12454;&#12451;&#12531;&#12489;&#12454;&#12363;&#12425;&#23455;&#34892;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12381;&#12398;&#22580;&#21512;&#12414;&#12378;  <strong class="application"><code>lshal</code></strong> &#12420; <strong class="application"><code>hal-device</code></strong> &#12434;&#20351;&#29992;&#12375;&#12390;&#26032;&#12375;&#12367;&#36861;&#21152;&#12375;&#12383;&#12487;&#12496;&#12452;&#12473;&#12398; HAL UDI &#12434;&#35211;&#12388;&#12369;&#20986;&#12373;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;UDI &#12364;&#20998;&#12363;&#12387;&#12383;&#12425;&#12289;<strong class="application"><code>Terminal</code></strong> &#12454;&#12451;&#12531;&#12489;&#12454;&#12391; <code class="literal">thunar-volman --device-added &lt;udi-of-your-device&gt;</code> &#12434;&#23455;&#34892;&#12375;&#12289;&#20986;&#21147;&#12373;&#12428;&#12427;&#12456;&#12521;&#12540;&#12420;&#35686;&#21578;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></li></ol></div><p>&#12381;&#12428;&#12391;&#12418;&#12358;&#12414;&#12367;&#21205;&#20316;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<a class="ulink" href="http://forum.xfce.org/" target="_top">Xfce Forum</a> &#12420; <a class="ulink" href="http://foo-projects.org/mailman/listinfo/thunar-dev" target="_top">thunar-dev mailing list</a> &#12391;&#23563;&#12397;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="working-with-files-and-folders.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="preferences.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#25805;&#20316; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12501;&#12449;&#12452;&#12523;&#31649;&#29702;&#12398;&#35373;&#23450;</td></tr></table></div></body></html>
