<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#25805;&#20316;</title><link rel="stylesheet" href="../thunar.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><link rel="start" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="up" href="index.html" title="Thunar &#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="prev" href="the-file-manager-window.html" title="&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12454;&#12451;&#12531;&#12489;&#12454;"><link rel="next" href="using-removable-media.html" title="&#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#20351;&#29992;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#25805;&#20316;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="the-file-manager-window.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="using-removable-media.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="working-with-files-and-folders"></a>&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398;&#25805;&#20316;</h2></div></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="opening-files"></a>&#12501;&#12449;&#12452;&#12523;&#12434;&#38283;&#12367;</h3></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12434;&#38283;&#12367;&#12392;&#12365;&#12289;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12399;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12395;&#24540;&#12376;&#12383;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12434;&#38283;&#12367;&#12392;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12486;&#12461;&#12473;&#12488;&#12456;&#12487;&#12451;&#12479;&#12364;&#36215;&#21205;&#12373;&#12428;&#12289;&#30011;&#20687;&#12501;&#12449;&#12452;&#12523;&#12434;&#38283;&#12367;&#12392;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#30011;&#20687;&#12499;&#12517;&#12540;&#12450;&#12364;&#36215;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#25313;&#24373;&#23376;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;&#12501;&#12449;&#12452;&#12523;&#12398;&#25313;&#24373;&#23376;&#12364;&#19981;&#26126;&#12394;&#22580;&#21512;&#12289;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#23481;&#12434;&#35519;&#12409;&#12414;&#12377;&#12290;</p><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="executing-the-default-action"></a>&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#23455;&#34892;</h4></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12391;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12458;&#12540;&#12487;&#12451;&#12458;&#12501;&#12449;&#12452;&#12523;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#38899;&#27005;&#20877;&#29983;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#38283;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#38899;&#27005;&#12503;&#12524;&#12452;&#12516;&#12540;&#12391;&#12501;&#12449;&#12452;&#12523;&#12434;&#20877;&#29983;&#12375;&#12414;&#12377;&#12290;</p><p><strong class="application"><code>Thunar</code></strong> &#12398;&#35373;&#23450;&#12391;&#12501;&#12449;&#12452;&#12523;&#12398;&#12471;&#12531;&#12464;&#12523;&#12463;&#12522;&#12483;&#12463;&#12391;&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#35443;&#12375;&#12367;&#12399; <a class="xref" href="preferences.html#preferences-behavior" title="&#25391;&#12427;&#33310;&#12356;&#12398;&#35373;&#23450;">&#25391;&#12427;&#33310;&#12356;&#12398;&#35373;&#23450;&#38917;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="executing-non-default-actions"></a>&#12487;&#12501;&#12457;&#12523;&#12488;&#20197;&#22806;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#23455;&#34892;</h4></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12390;&#12381;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#20197;&#22806;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12375;&#12383;&#12356;&#22580;&#21512;&#12289;<span class="guimenu"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12301;</strong></span> &#12513;&#12491;&#12517;&#12540;&#12414;&#12383;&#12399;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#36984;&#25246;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="adding-actions"></a>&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#36861;&#21152;</h4></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#36861;&#21152;&#12377;&#12427;&#22580;&#21512;&#12289;&#20197;&#19979;&#12398;&#25163;&#38918;&#12391;&#34892;&#12356;&#12414;&#12377;:</p><div class="orderedlist"><ol type="1"><li><p>&#12513;&#12452;&#12531;&#12456;&#12522;&#12450;&#12391;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#36861;&#21152;&#12375;&#12383;&#12356;&#12479;&#12452;&#12503;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p></li><li><p>&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#38283;&#12367;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p></li><li><p><span class="guilabel"><strong>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#38283;&#12367;&#12301;</strong></span> &#12480;&#12452;&#12450;&#12525;&#12464;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36984;&#12406;&#12363;&#12289;&#12414;&#12383;&#12399;<span class="guibutton"><strong>&#12300;&#25351;&#23450;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12390;&#12371;&#12398;&#12479;&#12452;&#12503;&#12391;&#38283;&#12367;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p></li></ol></div><p>&#12371;&#12428;&#12391;&#36984;&#25246;&#12375;&#12383;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#29992;&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12473;&#12488;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;<span class="guibutton"><strong>&#12300;&#12371;&#12398;&#31278;&#39006;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12377;&#12427;&#12301;</strong></span> &#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12363;&#12289;&#12371;&#12398;&#12479;&#12452;&#12503;&#12395;&#12414;&#12384;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#26032;&#12375;&#12367;&#36861;&#21152;&#12373;&#12428;&#12383;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p><p>&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#36861;&#21152;&#12399; <span class="guimenu"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;...&#12301;</strong></span> &#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12480;&#12452;&#12450;&#12525;&#12464;&#12398; <span class="guibutton"><strong>&#12300;&#12371;&#12428;&#12391;&#38283;&#12367;&#12301;</strong></span> &#12508;&#12479;&#12531;&#12391;&#12418;&#34892;&#12360;&#12414;&#12377;&#12290;</p></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="modifiying-actions"></a>&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#20462;&#27491;</h4></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#20462;&#27491;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#20197;&#19979;&#12398;&#25163;&#38918;&#12391;&#34892;&#12356;&#12414;&#12377;:</p><div class="orderedlist"><ol type="1"><li><p>&#12513;&#12452;&#12531;&#12456;&#12522;&#12450;&#12391;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#20462;&#27491;&#12375;&#12383;&#12356;&#12479;&#12452;&#12503;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p></li><li><p>&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p></li><li><p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#20462;&#27491;&#12377;&#12427;&#22580;&#21512;&#12399; <span class="guilabel"><strong>&#12300;&#12371;&#12428;&#12391;&#38283;&#12367;&#12301;</strong></span> &#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#38283;&#12367;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12289;&#26032;&#12375;&#12356;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</p></li></ol></div><p>&#12377;&#12391;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#21066;&#38500;&#12377;&#12427;&#22580;&#21512;&#12399;&#19978;&#12391;&#35500;&#26126;&#12375;&#12383; <span class="guilabel"><strong>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#38283;&#12367;&#12301;</strong></span> &#12480;&#12452;&#12450;&#12525;&#12464;&#12434;&#34920;&#31034;&#12373;&#12379;&#12289;&#21066;&#38500;&#12375;&#12383;&#12356;&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;<span class="guimenuitem"><strong>&#12300;&#12521;&#12531;&#12481;&#12515;&#12434;&#21066;&#38500;&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="file-properties"></a>&#12501;&#12449;&#12452;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</h3></div></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12454;&#12451;&#12531;&#12489;&#12454;&#12391;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12395;&#12362;&#12369;&#12427;&#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12501;&#12457;&#12523;&#12480;&#12395;&#12388;&#12356;&#12390;&#12398;&#35443;&#32048;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12391;&#12399;&#20197;&#19979;&#12398;&#12371;&#12392;&#12418;&#34892;&#12360;&#12414;&#12377;:</p><div class="itemizedlist"><ul type="disc"><li><p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12521;&#12531;&#12481;&#12515;&#12420; URL &#12522;&#12531;&#12463;&#12398;&#12424;&#12358;&#12394;&#29305;&#27530;&#12501;&#12449;&#12452;&#12523;&#12398;&#12450;&#12452;&#12467;&#12531;&#12398;&#22793;&#26356;</p></li><li><p>&#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12501;&#12457;&#12523;&#12480;&#12408;&#12398;&#12471;&#12531;&#12508;&#12523;&#12398;&#36861;&#21152;&#12414;&#12383;&#12399;&#38500;&#21435;</p></li><li><p>&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12398; UNIX &#12501;&#12449;&#12452;&#12523;&#12450;&#12463;&#12475;&#12473;&#27177;&#12398;&#22793;&#26356;</p></li><li><p>&#21516;&#12376;&#12479;&#12452;&#12503;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#38283;&#12367;&#12392;&#12365;&#12395;&#20351;&#29992;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36984;&#25246;</p></li></ul></div><div class="screenshot"><div class="mediaobject"><img src="images/file-properties.png" alt="&#12501;&#12449;&#12452;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;"></div></div><p>&#12501;&#12449;&#12452;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12454;&#12451;&#12531;&#12489;&#12454;&#12434;&#38283;&#12367;&#22580;&#21512;&#12289;&#20197;&#19979;&#12398;&#25163;&#38918;&#12391;&#34892;&#12356;&#12414;&#12377;:</p><div class="orderedlist"><ol type="1"><li><p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35519;&#12409;&#12383;&#12356;&#12289;&#12414;&#12383;&#12399;&#22793;&#26356;&#12375;&#12383;&#12356;&#12501;&#12449;&#12452;&#12523;&#12420;&#12501;&#12457;&#12523;&#12480;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#12450;&#12452;&#12486;&#12512;&#12434;&#21516;&#26178;&#12395;&#36984;&#25246;&#12375;&#12390;&#12377;&#12409;&#12390;&#12398;&#12450;&#12452;&#12486;&#12512;&#12391;&#20849;&#36890;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#34920;&#31034;&#12373;&#12379;&#12427;&#12371;&#12392;&#12399;&#29694;&#22312;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p></li><li><p>&#20197;&#19979;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#34892;&#12356;&#12414;&#12377;: </p><div class="itemizedlist"><ul type="disc"><li><p>&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenu"><strong>&#12300;&#12501;&#12449;&#12452;&#12523;&#12301;</strong></span> &#8594; <span class="guimenuitem"><strong>&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p></li><li><p>&#36984;&#25246;&#12375;&#12383;&#12450;&#12452;&#12486;&#12512;&#12398;&#19978;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; <span class="guimenuitem"><strong>&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;...&#12301;</strong></span> &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p></li><li><p><span class="keycap"><strong>Alt</strong></span>+<span class="keycap"><strong>Return</strong></span> &#12434;&#25276;&#12375;&#12414;&#12377;&#12290;</p></li></ul></div></li></ol></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="the-file-manager-window.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="using-removable-media.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12501;&#12449;&#12452;&#12523;&#12510;&#12493;&#12540;&#12472;&#12515;&#12454;&#12451;&#12531;&#12489;&#12454; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12522;&#12512;&#12540;&#12496;&#12502;&#12523;&#12513;&#12487;&#12451;&#12450;&#12398;&#20351;&#29992;</td></tr></table></div></body></html>
